{
  "nodes": [
    {
      "id": "Gershenfeld, N. 2008",
      "Theme": "Phygital Practices",
      "category": "Selected",
      "author": "Gershenfeld, N.",
      "title": "Fab: The Coming Revolution on Your Desktop — from Personal Computers to Personal Fabrication",
      "year": 2008,
      "publisher": "Hachette UK",
      "URL": null,
      "Description": "<p>Neil Gershenfeld’s Fab: The Coming Revolution on Your Desktop (2008) argues that digital fabrication represents a decisive break from the industrial division between conception and execution. Building on the ethos of “personal computing,” Gershenfeld proposes “personal fabrication”: the idea that individuals should be able to design and produce physical objects with the same freedom and accessibility that computers brought to information. At the center of this vision are Fab Labs—small, distributed workshops equipped with laser cutters, CNC machines, microcontrollers, and 3D printers—designed not merely as technical spaces but as pedagogical and civic infrastructures. In Fab Labs, people learn how things work by making them, collapsing the epistemic gulf that Simone Weil diagnosed as the root of modern alienation.</p><p>For Gershenfeld, digital fabrication does not automate creativity; it restores agency by reuniting thinking and making. Code becomes material instruction, and fabrication becomes a site of reciprocity rather than hierarchy. Fab Labs demonstrate that when methods are shared rather than hidden, communities appropriate technologies to address local needs, weaving global knowledge into situated practices. This decentralization challenges the industrial logic of scale: production no longer requires centralized factories, because customization and variation cost no more than repetition.</p><p>Yet Gershenfeld’s revolution is ultimately educational and political. Democratizing fabrication means democratizing intelligibility—giving people the capacity to understand and modify the systems that shape their lives. In this sense, Fab anticipates the contemporary post-digital challenge: ensuring that distributed technological power remains legible, accessible, and participatory rather than reabsorbed into opaque computational infrastructures.</p>",
      "index": 0
    },
    {
      "id": "Baudisch, P. et al. 2017",
      "Theme": "Decentralized Governance & Commons",
      "category": "Primary",
      "author": "Baudisch, P.; Mueller, S.",
      "title": "Personal Fabrication",
      "year": 2017,
      "publisher": "Foundations and Trends® in Human–Computer Interaction [Internet];10(3–4):165–293",
      "URL": "https://doi.org/10.1561/1100000055",
      "Description": "<p>Baudisch and Mueller’s Personal Fabrication (2016) outlines the evolution of fabrication technologies from industrially controlled systems toward increasingly democratized, consumer-accessible tools. The authors frame this transition through an AD/DA (Analog-to-Digital/Digital-to-Analog) paradigm, positioning fabrication within the same lineage as earlier digital revolutions in publishing, music, and video. As patents expired and hardware costs fell, fabrication shifted from closed industrial ecosystems to open, maker-led environments characterized by low-cost, hackable, and networked machines. This process, they argue, will culminate in the widespread adoption of “personal fabrication,” where users can design and produce their own physical objects through interactive digital systems. The authors identify six interdependent challenges that must be addressed for this transition to mature: (1) hardware and materials accessibility, (2) embedded domain knowledge, (3) interactive feedback, (4) machine-specific abstraction, (5) sustainability, and (6) intellectual property management.</p><p>In relation to the dissertation Post-Anthropogenic Design-to-Fabrication Practices Towards Global Symbiosis, Baudisch and Mueller’s framework provides an essential theoretical and technological foundation. Their notion of decentralized, open, and embodied fabrication directly aligns with the dissertation’s concept of open design ecologies and transcalar fabrication, where making is distributed across networks of human and non-human agents. The “personal” dimension they describe becomes, in a post-anthropogenic reading, post-personal—a condition in which design intelligence is shared among computational, biological, and material systems. Similarly, their emphasis on sustainability anticipates the dissertation’s argument for global symbiosis, where fabrication operates within ecological reciprocity rather than extractive industrial logics. By embedding expertise and feedback within software-hardware assemblages, Baudisch and Mueller’s vision gestures toward self-organizing, adaptive fabrication ecologies that move beyond human-centered production. Thus, their analysis represents not only a technological precedent but also a transitional paradigm toward the non-standard, symbiotic, and decentralized design-to-fabrication practices that define post-anthropogenic tectonics.</p>",
      "index": 1
    },
    {
      "id": "Diamond, J. 1997",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Primary",
      "author": "Diamond, J. M.",
      "title": "Guns, Germs, and Steel: The Fates of Human Societies",
      "year": 1997,
      "publisher": "W. W. Norton & Company",
      "URL": null,
      "Description": "<p>Jared Diamond’s Guns, Germs, and Steel: The Fates of Human Societies (1997) offers a material and ecological explanation for the unequal development of human civilizations. Diamond argues that disparities in access to resources—particularly domesticable plants and animals, geographic orientation, and environmental stability—determined which societies could accumulate surpluses, specialize labor, and develop complex technologies. Civilizational progress, in this view, is not rooted in cultural superiority but in unequal access to enabling ecologies and the ability to exchange and replicate knowledge, materials, and techniques across regions. Diamond highlights how the diffusion of agriculture, metallurgy, and writing relied on copying and adaptation, where ideas and technologies were reinterpreted within new local contexts, creating an iterative network of innovation.</p><p>This framework resonates deeply with the dissertation Post-Anthropogenic Design-to-Fabrication Practices Towards Global Symbiosis, which reimagines design and fabrication as decentralized, open, and symbiotic systems rather than hierarchically controlled industrial processes. Diamond’s historical analysis of inequality underscores the danger of resource concentration—a pattern mirrored today in the global distribution of fabrication infrastructure, computational power, and material access. Just as early civilizations flourished through the free flow of resources and knowledge, a post-anthropogenic paradigm seeks to dissolve these asymmetries by promoting open-source fabrication networks and transcalar material exchange among human and non-human agents.</p><p>In this context, copying becomes an ethical and generative act—a means of ecological and cultural resilience rather than mere replication. The dissertation extends Diamond’s logic into a speculative future: where fabrication is no longer constrained by geopolitical or anthropocentric borders but operates as a distributed ecology of making, driven by reciprocal access, shared intelligence, and material symbiosis. Thus, while Diamond diagnosed how inequality shaped civilization’s past, post-anthropogenic design proposes how equitable and networked fabrication ecologies might reshape civilization’s future.</p>",
      "index": 2
    },
    {
      "id": "Daggett, C. 2019",
      "Theme": "Decentralized Governance & Commons",
      "category": "Primary",
      "author": "Daggett, C. N.",
      "title": "The Birth of Energy: Fossil Fuels, Thermodynamics, and the Politics of Work",
      "year": 2019,
      "publisher": null,
      "URL": null,
      "Description": "<p>Cara New Daggett’s The Birth of Energy: Fossil Fuels, Thermodynamics, and the Politics of Work (2019) interrogates how modern understandings of “energy” emerged alongside industrial capitalism and fossil-fuel dependence. Daggett argues that energy is not merely a physical or scientific concept but a political and cultural construct that has historically disciplined bodies and environments into systems of productivity, efficiency, and control. The thermodynamic framing of energy—as measurable, extractable, and optimizable—helped naturalize the politics of work, embedding capitalist hierarchies into both material systems and social relations. In this sense, the fossil-fuel regime represents not only a technological formation but also a moral and epistemic order, one that organizes life through the relentless conversion of matter into labor and heat.</p><p>This analysis directly informs our research, which seeks to move beyond anthropocentric and extractive design paradigms. Daggett’s critique reveals how the dominant industrial logic of energy production mirrors current fabrication systems—centralized, resource-intensive, and oriented toward human productivity rather than ecological balance. By exposing the politics embedded in thermodynamic thinking, Daggett opens the possibility for alternative energetics grounded in care, reciprocity, and interdependence. The dissertation takes up this challenge by proposing decentralized fabrication ecologies that operate through symbiotic exchanges of material and information, rather than extractive conversions of energy and labor.</p><p>In this post-anthropogenic framework, fabrication becomes a relational process rather than an industrial output—one that values the vitality of materials and the agency of non-human systems. Whereas Daggett historicizes how energy became a tool of domination, the dissertation envisions how future fabrication can become a tool of collective regeneration. Both works call for a profound rethinking of the material infrastructures that sustain civilization, advocating a shift from fossil-fueled control toward distributed, ethical, and ecologically attuned modes of making.</p>",
      "index": 3
    },
    {
      "id": "Chomsky, N. 1992",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Primary",
      "author": "Chomsky, N.",
      "title": "Year 501: The Conquest Continues",
      "year": 1992,
      "publisher": "South End Press",
      "URL": null,
      "Description": "<p>In Year 501: The Conquest Continues (1993), Noam Chomsky traces the continuity between early European colonialism and the modern structures of global capitalism, arguing that the mechanisms of conquest—resource extraction, economic dependency, and epistemic domination—persist in contemporary forms of neoliberal governance and technological control. Chomsky reveals how systems of power maintain inequality through the monopolization of resources and knowledge, ensuring that wealth and productive capacity remain concentrated within dominant nations and corporate entities. This ongoing “conquest,” he argues, is sustained not only through military and economic means but also through the ideological normalization of exploitation and hierarchy—where global exchange is framed as free and neutral, while in reality it reproduces structural dependency.</p><p>This perspective deeply informs our research, which examines decentralized, symbiotic, and post-anthropogenic design-to-fabrication practices as potential correctives to these enduring asymmetries. Chomsky’s critique of global inequality exposes how the very infrastructures of production—industrial, digital, and ecological—are embedded within colonial logics of control and ownership. In contrast, our research envisions open design ecologies that challenge these hierarchies by redistributing access to material resources, computational intelligence, and design agency. Just as Chomsky calls for the decolonization of knowledge and production, our framework seeks to liberate fabrication from proprietary systems and centralized authority, enabling collaborative exchange, mutual learning, and material reciprocity across scales and species.</p><p>Through this lens, fabrication becomes a form of resistance against the continuation of conquest—an effort to reconfigure making as an ethical, collective, and regenerative practice rather than an instrument of domination. By fostering global networks of shared knowledge and distributed production, our work aligns with Chomsky’s vision of dismantling imperial systems through autonomous cooperation and equitable access, transforming design and fabrication into agents of planetary justice rather than tools of exploitation.</p>",
      "index": 4
    },
    {
      "id": "Fuller, R. 1969",
      "Theme": "Decentralized Governance & Commons",
      "category": "Selected",
      "author": "Fuller, R. B.",
      "title": "Operating Manual for Spaceship Earth",
      "year": 1969,
      "publisher": "Southern Illinois University Press",
      "URL": null,
      "Description": "<p>Buckminster Fuller’s Operating Manual for Spaceship Earth (1969) presents a planetary philosophy that reframes humanity’s technological capacities as tools for collective survival rather than instruments of domination. Fuller argues that Earth is a finite, interdependent system—“Spaceship Earth”—whose successful operation requires a shift from short-term, competitive thinking to comprehensive, anticipatory design. Central to this shift is a revaluation of abstraction. Where industrial modernity used abstraction to fragment labor and obscure systemic relationships, Fuller sees abstraction—mathematics, modeling, and global data—as a means to perceive the planet’s ecological and energetic limits with unprecedented clarity.</p><p>Fuller critiques the rise of specialization, which he views as a legacy of industrial fragmentation that narrows human understanding. Specialists, focused on isolated tasks, lose sight of the larger systems their work affects. This epistemic narrowing prevents society from recognizing the unintended consequences of industrial growth and resource extraction. To counter this trend, Fuller calls for a new kind of generalist—the “comprehensive designer”—who synthesizes knowledge across disciplines to align human activity with planetary equilibrium.</p><p>Automation, for Fuller, is not a threat to human agency but an opportunity to liberate people from narrowly defined labor, allowing them to focus on creativity, invention, and problem-solving. Technology becomes a cognitive prosthesis that enhances our capacity to understand complex systems rather than an opaque force that governs them. Ultimately, Operating Manual for Spaceship Earth advocates for technological intelligibility and planetary stewardship: a global ethic in which humanity learns to navigate complexity, design responsibly at scale, and act as co-custodians of a shared and fragile world.</p>",
      "index": 5
    },
    {
      "id": "Fuller, R. et al. 1975",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Primary",
      "author": "Fuller, R. B.; Applewhite, E. J.; Loeb, A. L.",
      "title": "Synergetics: Explorations in the Geometry of Thinking",
      "year": 1975,
      "publisher": "MacMillan Publishing Company",
      "URL": null,
      "Description": "<p>In Synergetics: Explorations in the Geometry of Thinking (1975), R. Buckminster Fuller presents a visionary framework that redefines design, structure, and thought as interconnected expressions of universal pattern and systemic coherence. Fuller’s concept of synergetics—the study of systems in transformation—emphasizes how complex wholes arise from the interaction of simple, interdependent parts. Rejecting linear and anthropocentric models of design, Fuller proposes a geometry of thinking rooted in energy flows, dynamic equilibria, and material efficiency. His work anticipates a worldview in which design intelligence is distributed across matter, structure, and environment, suggesting that human invention should harmonize with, rather than dominate, natural processes.</p><p>This paradigm profoundly resonates with our research, which explores decentralized and post-anthropogenic design-to-fabrication practices aimed at cultivating global symbiosis and non-standard tectonics. Fuller’s emphasis on pattern integrity and systemic interdependence aligns with the idea that fabrication can operate as an adaptive ecology rather than a linear act of production. Both perspectives view the designer not as a controlling agent but as a participant within a larger network of material and energetic relations.</p><p>By translating Fuller’s synergetic principles into contemporary computational and material frameworks, our research extends his geometric philosophy toward transcalar fabrication systems—networks that integrate digital, biological, and environmental intelligence. In this context, design becomes a collective negotiation among multiple agents and scales, embodying Fuller’s belief in comprehensive anticipatory design as a means of planetary stewardship. Where Fuller sought to reveal the underlying geometry of nature as a guide for human invention, our work reinterprets this vision through open, symbiotic fabrication ecologies that enact cooperation between human and non-human systems. Thus, synergetics provides both the geometric and philosophical groundwork for reimagining design as a relational, regenerative, and ecologically attuned practice.</p>",
      "index": 6
    },
    {
      "id": "Huxley, A. 1932",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Primary",
      "author": "Huxley, A.",
      "title": "Brave New World",
      "year": 1932,
      "publisher": "Harper & Brothers",
      "URL": null,
      "Description": "<p>In Brave New World (1932), Aldous Huxley imagines a meticulously engineered society in which technological mastery, biological manipulation, and social conditioning ensure perfect order at the cost of freedom, emotion, and individuality. Although written nearly a century ago, the novel’s critique of technocratic control and dehumanization feels profoundly contemporary. In an age increasingly defined by automation, algorithmic governance, and data-driven optimization, Huxley’s vision continues to resonate as a prophetic warning: that the pursuit of stability, efficiency, and comfort can easily become a form of enslavement, where humanity surrenders its creative and ethical agency to systems of its own making.</p><p>Our research takes this warning seriously, positioning itself explicitly against the dehumanizing trajectories of technological centralization that Huxley anticipated. While Brave New World portrays a future in which design and production are instruments of control, our work explores post-anthropogenic and symbiotic design-to-fabrication practices that seek to restore autonomy, diversity, and mutualism within design ecologies. Rather than consolidating power within closed technological systems, we advocate for decentralized, open, and adaptive modes of fabrication—systems that distribute intelligence, creativity, and responsibility among human and non-human agents alike.</p><p>In contrast to Huxley’s standardized, efficiency-obsessed world, our approach promotes plurality and co-creation as essential to the evolution of both technology and culture. It recognizes that design, when stripped of ethical and ecological sensitivity, risks perpetuating the same mechanisms of domination that Brave New World exposed. Thus, our research stands as an act of resistance—an effort to reimagine fabrication not as a means of control, but as a practice of liberation and coexistence. By embracing uncertainty, complexity, and interdependence, we aim to counter the ongoing drift toward technological enslavement and reaffirm design as a fundamentally humanizing and symbiotic endeavor.</p>",
      "index": 7
    },
    {
      "id": "Weil, S. 1934",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Selected",
      "author": "Weil, S.",
      "title": "Réflexions sur les causes de la liberté et de l'oppression sociale (Liberty and oppression)",
      "year": 1934,
      "publisher": null,
      "URL": null,
      "Description": "<p>Simone Weil’s Oppression and Liberty offers a rigorous analysis of the structural roots of domination in modern societies. Writing in 1934 against the backdrop of industrial capitalism and the failures of orthodox Marxism, Weil argues that oppression does not originate primarily in private property or ideology, but in the organization of labor itself—specifically, in the separation between conception and execution. Industrial production institutionalizes this fracture: those who design, plan, and calculate are separated from those who perform mechanical tasks without understanding their purpose. For Weil, this epistemic asymmetry is the true foundation of alienation. Workers are deprived not only of economic agency but of the ability to comprehend the processes that govern their lives.</p><p>Weil critiques both capitalism and Marxism for worshipping production as an end in itself. Whether justified as profit or proletarian output, industrial gigantism subordinates human beings to the imperatives of efficiency, scale, and technical specialization. Machines are not inherently oppressive; they become instruments of domination when access to their methods is restricted. “The profane have access only to results, not to methods,” she writes, diagnosing how bureaucracies, experts, and technocratic elites monopolize understanding.</p><p>Freedom, for Weil, is therefore a question of intelligibility. A society is free only when individuals can grasp the logic of the systems they participate in and influence them meaningfully. She calls for a reorganization of production grounded in reciprocity, where knowledge is distributed rather than centralized, and where technological systems are designed to expand comprehension instead of enforcing obedience. Through this framework, Weil reconceives political liberation as the restoration of shared understanding between human beings and the material processes that shape their world.</p>",
      "index": 8
    },
    {
      "id": "Lafargue, P. 1883",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Primary",
      "author": "Lafargue, P.",
      "title": "The Right to Be Lazy [Le droit à la paresse]",
      "year": 1883,
      "publisher": "Paris: H. Oriol",
      "URL": null,
      "Description": "<p>Paul Lafargue’s The Right to Be Lazy (1883) offers one of the earliest and most radical critiques of industrial capitalism and its moral glorification of work. Writing at the height of mechanization, Lafargue exposes how the cult of labor—promoted by both industrialists and segments of the workers’ movement—served to entrench exploitation rather than abolish it. He argues that machinery, instead of liberating people from toil, had been appropriated by capital to intensify productivity and profit, enslaving humanity to a new regime of mechanical dependence. From his unique perspective, Lafargue identifies a profound contradiction: the very technologies meant to free society from material need have become instruments of discipline, inequality, and alienation, benefiting corporations while impoverishing the collective spirit.</p><p>Nearly 150 years later, Lafargue’s warning remains disturbingly relevant. The mechanization of human life continues—only now through digital, algorithmic, and networked forms. Each technological revolution promises liberation, yet repeatedly reproduces new dependencies, new hierarchies, and new forms of control. The cycle of industrialization has not been transcended, only repackaged and accelerated. This historical persistence reveals a deeper structural flaw: a paradigm that equates progress with productivity, and innovation with domination.</p><p>Our research directly challenges this enduring logic. By envisioning post-anthropogenic, decentralized, and symbiotic design-to-fabrication systems, we seek to break the cycle of mechanized subjugation that Lafargue identified. Rather than perpetuating technology as an instrument of labor discipline, we propose its reinvention as a medium of liberation, cooperation, and ecological reciprocity. It is time to move beyond a history that endlessly reinvents the same machinery of control. The new paradigm must reject the fetish of productivity and embrace design as a practice of care, interdependence, and collective freedom—realizing, at last, the emancipatory promise that mechanization has long betrayed.</p>",
      "index": 9
    },
    {
      "id": "Meadows, D. et al. 1972",
      "Theme": "Decentralized Governance & Commons",
      "category": "Primary",
      "author": "Meadows, D. H.; Meadows, D. L.; Randers, J.; Behrens, W. W.",
      "title": "The Limits to Growth: A Report for the Club of Rome's Project on the Predicament of Mankind",
      "year": 1972,
      "publisher": "New York: Universe Books",
      "URL": null,
      "Description": "<p>Donella Meadows’ The Limits to Growth: A Report for the Club of Rome’s Project on the Predicament of Mankind (1972) marked a turning point in the understanding of humanity’s relationship with planetary systems. Developed at a time when computational modeling was just emerging, the study used early computer simulations (notably through the World3 model) to correlate variables such as population growth, resource depletion, industrial output, and pollution. These simulations produced one of the first quantitative representations of Earth as a complex, interdependent system, revealing that unchecked economic and industrial expansion would inevitably exceed the planet’s ecological capacity. Meadows and her team’s findings were revolutionary precisely because they were enabled by the recent rise of computation, allowing for dynamic modeling of feedback loops and non-linear relationships—concepts that reshaped ecological and systems thinking for decades to come.</p><p>Our research aligns with Meadows’ vision of systemic interdependence and ecological limitation, yet it also critiques the technocratic and centralized ethos that often accompanied her project’s institutional reception. While The Limits to Growth was a profound ecological warning, its framing sometimes reinforced the notion that global challenges should be analyzed and managed by elite scientific or policy institutions—a top-down paradigm of control. Our research resists this model, emphasizing bottom-up, decentralized, and participatory forms of design-to-fabrication, where knowledge and agency are distributed across communities, technologies, and ecosystems.</p><p>Building on Meadows’ systemic insights and their computational origins, our work reinterprets the relationship between technology and ecology: not as one of management or prediction, but of collaboration and coevolution. We envision a future where computational tools—once used to diagnose planetary limits—are reappropriated to enable open, symbiotic, and post-anthropogenic fabrication ecologies, fostering a shift from global technocracy to collective planetary stewardship.</p>",
      "index": 10
    },
    {
      "id": "Thomson, D. 1917",
      "Theme": "Computational Exploration",
      "category": "Primary",
      "author": "Thomson, D. W.",
      "title": "On Growth and Form",
      "year": 1917,
      "publisher": "Cambridge University Press",
      "URL": null,
      "Description": "<p>D’Arcy Wentworth Thompson’s On Growth and Form is a foundational text in the study of morphogenesis—the process by which natural forms emerge through physical, mathematical, and environmental interactions. Written in 1917, it is one of the first systematic attempts to explain biological form not through teleology or function, but through underlying structural and energetic laws. Thompson proposed that geometry and material behavior are co-determined by gradients of force, pressure, and growth, positioning form as the result of systemic relationships rather than external design intention.</p><p>For our research, the book is crucial because it provides an early theoretical framework for understanding form as a generative process—a notion that directly informs computational and parametric design methodologies. Thompson’s emphasis on transformation, proportionality, and the mapping of one morphology into another anticipates the logic of parametric variation and algorithmic morphogenesis. His work thus offers a proto-parametric worldview, where the designer’s role becomes one of tuning relationships rather than composing fixed forms.</p><p>This perspective is particularly relevant to contemporary explorations of post-anthropogenic design-to-fabrication ecologies, where agency is distributed among computational, material, and environmental systems. Thompson’s understanding of growth as an emergent negotiation between matter and context aligns with decentralized and open design practices that favor feedback, adaptation, and systemic interdependence. Moreover, his analysis operates transcalarly—from cellular geometries to animal structures—illustrating how consistent generative principles can link micro-scale material behavior with macro-scale ecological organization.</p><p>Ultimately, On Growth and Form serves as both a scientific and philosophical precursor to modern computational design thinking. It repositions form as an evolving process embedded within the dynamics of life and environment, providing an essential conceptual foundation for reimagining design and fabrication as morphogenetic, symbiotic, and ecologically integrated practices.</p>",
      "index": 11
    },
    {
      "id": "Haeckel, E. 1899",
      "Theme": "Symbiotic Material Ecologies",
      "category": "Primary",
      "author": "Haeckel, E.",
      "title": "Art Forms in Nature [Kunstformen der Natur]",
      "year": 1899,
      "publisher": "Originally published in German",
      "URL": null,
      "Description": "<p>Ernst Haeckel’s Art Forms in Nature (1899) is a landmark work that visually and conceptually explores the morphogenetic diversity of life through intricate lithographic illustrations of microscopic organisms, plants, and marine species. Combining scientific observation with aesthetic idealization, Haeckel sought to reveal the geometric and symmetrical principles underlying biological form. His depictions of radiolarians, diatoms, and medusae visualize nature as an architectonic system—where beauty emerges from mathematical order and systemic growth patterns.</p><p>For my research, Haeckel’s work is significant for its early articulation of natural morphologies as models of generative design. Like D’Arcy Thompson, he recognized that biological form arises from dynamic structural and environmental relationships, offering a prefiguration of computational and parametric understandings of morphology. His focus on pattern, recursion, and proportionality anticipates later developments in algorithmic design and digital fabrication, where geometry becomes an expression of systemic behavior rather than representational imitation.</p><p>However, it is necessary to acknowledge that Haeckel’s scientific worldview was entangled with eugenic and teleological ideologies that are philosophically incompatible with the ethical foundations of my research, which rejects hierarchical or deterministic models of life and form. In reinterpreting his work, the value lies not in his sociobiological interpretations but in his analytical visualization of morphogenetic complexity and his recognition of the deep interrelation between natural structures and formal systems.</p><p>Viewed critically, Art Forms in Nature provides an aesthetic and conceptual bridge between natural morphology and computational generativity. Its contribution to my research resides in its demonstration that form can be both materially contingent and formally structured—a duality central to post-anthropogenic and symbiotic design paradigms. Haeckel’s visual taxonomy thus remains a valuable resource for understanding form as a manifestation of systemic organization rather than hierarchical control.</p>",
      "index": 12
    },
    {
      "id": "Stamets, P. 2005",
      "Theme": "Symbiotic Material Ecologies",
      "category": "Primary",
      "author": "Stamets, P.",
      "title": "Mycelium Running: How Mushrooms Can Help Save the World",
      "year": 2005,
      "publisher": "Ten Speed Press",
      "URL": null,
      "Description": "<p>Paul Stamets’ Mycelium Running (2005) explores the vast and intricate networks formed by fungal mycelium, proposing them as a paradigm for ecological intelligence and systemic resilience. Through scientific research and practical case studies, Stamets illustrates how mycelial networks function as the planet’s natural infrastructure—decomposing, regenerating, and connecting diverse ecosystems. He positions fungi not only as vital agents in ecological balance but also as models for understanding interdependence, adaptation, and regenerative cycles within complex systems.</p><p>For my research, Stamets’ work is pivotal in articulating a model of symbiotic connectivity that extends beyond metaphor into material and systemic practice. The mycelial network embodies the principles of decentralization, feedback, inter-species collaboration, and non-hierarchical organization that are central to post-anthropogenic design and fabrication approaches. Its distributed intelligence—where each node contributes to the resilience of the whole—provides a biological analogue for open design ecologies and transcalar fabrication systems in which local actions contribute to global coherence.</p><p>Moreover, Stamets’ emphasis on mycelium’s capacity for self-organization and environmental adaptation parallels computational and material systems that evolve in response to changing parameters. His ecological vision reinforces the notion that sustainable design emerges from attunement with living processes rather than dominance over them. This aligns closely with the goal of developing design-to-fabrication practices that operate symbiotically within planetary systems.</p><p>In essence, Mycelium Running offers both a scientific and philosophical framework for reimagining design as an ecological act—rooted in networks of reciprocity, regeneration, and distributed agency. Stamets’ insights bridge biological and computational thinking, presenting mycelium as a living prototype for sustainable, adaptive, and interconnected modes of design and fabrication.</p>",
      "index": 13
    },
    {
      "id": "Allen, S. 1997",
      "Theme": "Computational Exploration",
      "category": "Primary",
      "author": "Allen, S.",
      "title": "From Object to Field",
      "year": 1997,
      "publisher": "Architectural Design;67(5–6):24–31",
      "URL": null,
      "Description": "<p>In this seminal essay, Stan Allen advances the concept of field conditions as an alternative to object-based, compositional models of architecture. Moving “from individuals to collectives, from objects to fields,” Allen repositions architectural design as a relational and adaptive process governed by local interactions rather than top-down formal control. Drawing analogies from mathematics, physics, and post-minimalist art, he describes field conditions as loosely bounded, non-hierarchical systems in which order emerges through the serial aggregation of parts and the negotiation of contextual forces. His historical and material readings—from the Mosque of Córdoba to Le Corbusier’s Venice Hospital—demonstrate how architecture can embody an algebraic, incremental logic of growth, allowing difference to arise through repetition and local adaptation.</p><p>Allen’s framework is especially relevant to our research on post-anthropogenic, decentralized design-to-fabrication practices. His emphasis on bottom-up organization, local agency, and the fluid relationship between construction and form anticipates contemporary notions of distributed intelligence and open-ended design ecologies. The essay’s call for architects to “work with and not against the site” resonates with strategies that integrate environmental feedback, material behavior, and computational fabrication into continuous processes of formation. Moreover, Allen’s later discussion of “flocks, schools, swarms, and crowds” aligns with multi-agent and self-organizing systems central to current algorithmic and ecological design paradigms.</p><p>Ultimately, “From Object to Field” provides a foundational theoretical bridge between modernist compositional thinking and emergent, adaptive architectures. It situates architecture within a dynamic field of relations—social, material, and environmental—making it a key precursor to the distributed, transcalar, and symbiotic design frameworks that inform our exploration of post-anthropogenic tectonics.</p>",
      "index": 14
    },
    {
      "id": "Allen, S. 1998",
      "Theme": "Computational Exploration",
      "category": "Primary",
      "author": "Allen, S.",
      "title": "ANY 23: Diagram Work: Data Mechanics for a Topological Age",
      "year": 1998,
      "publisher": "ANY / Anyone Corporation van Berkel, B.; Bos, C. (Eds.)",
      "URL": null,
      "Description": "<p>In Diagrams Matter, Stan Allen reframes the architectural diagram not as a tool of representation but as an abstract machine—a generative system that organizes relationships between matter, information, and event. Drawing on Deleuze and Guattari’s notion of the diagram as a “constructive” rather than representational device, Allen argues that diagrams operate through transposition rather than translation, converting relationships between heterogeneous media, materials, and scales without the mediation of symbolic meaning. In this sense, the diagram mediates between the actual and the virtual, situating architecture as a performative field where material, technical, and social forces interact dynamically.</p><p>Allen’s concept of diagrammatic practice—indifferent to disciplinary boundaries and attentive to feedback between information and matter—directly informs our research into post-anthropogenic, decentralized design-to-fabrication systems. His emphasis on the diagram as an operational rather than representational construct parallels computational and ecological design approaches where agency, emergence, and relational organization supersede fixed typologies or authorial control. The notion that architecture “actualizes the virtual” aligns with distributed fabrication networks and adaptive systems that negotiate between digital information and material behavior in real time.</p><p>By positioning the diagram as both medium and method, Allen opens architecture to complex exchanges with its “outside”—technological, social, and environmental systems. This resonates with our research’s focus on open, transcalar, and collaborative ecologies of design. Ultimately, Diagrams Matter provides a theoretical foundation for understanding architecture as a dynamic interface—an evolving network of interactions rather than a static object—anticipating contemporary explorations of algorithmic materialism, decentralized authorship, and symbiotic design processes that redefine tectonics in a post-anthropogenic context.</p>",
      "index": 15
    },
    {
      "id": "Snooks, R. 2017",
      "Theme": "Computational Exploration",
      "category": "Selected",
      "author": "Snooks, R.",
      "title": "Behavioral Formation: Multi-Agent Algorithmic Design Strategies",
      "year": 2017,
      "publisher": "PhD Dissertation, RMIT University",
      "URL": "https://doi.org/10.25439/rmt.27591192",
      "Description": "<p>In Behavioral Formation, Roland Snooks proposes a computational design methodology rooted in agent-based systems, shifting architectural authorship from the direct modeling of form to the orchestration of behavioral environments. Instead of drawing shapes or manipulating parametric surfaces, the designer encodes a set of local rules and interactions that govern the behavior of autonomous agents. Architectural form emerges as the collective, large-scale consequence of these micro-level negotiations.</p><p>This approach reframes the designer’s role. Rather than acting as a traditional form-giver or a distant programmer, the designer becomes an ecological orchestrator who constructs the conditions within which emergence occurs. Crucially, Snooks emphasizes that this generative process does not result in black-box opacity: the designer fully understands the rule-based logic, even though the specific outcomes remain unpredictable. Uncertainty is not a limitation but a productive form of nonlinear intelligibility, akin to natural morphogenesis where deterministic processes yield irreducible complexity.</p><p>Snooks’ framework represents a philosophical evolution of Deleuzian thought in architecture: the fold is not a stylistic trope but the structural logic of recursive interactions. Form is no longer imposed from above but unfolds from within a field of encoded relations.</p><p>Yet the methodology remains bounded by its computational substrate. The emergent behavior is simulated rather than embodied, and material feedback is abstracted rather than directly integrated. As a result, Behavioral Formation outlines a powerful ontology of digital emergence while leaving open the question of how these behavioral ecologies translate into fabrication and material negotiation.</p>",
      "index": 16
    },
    {
      "id": "Snooks, R. 2022",
      "Theme": "Computational Exploration",
      "category": "Primary",
      "author": "Snooks, R.",
      "title": "Behavioral Formation: Volatile Design Processes and the Emergence of a Strange Specificity",
      "year": 2022,
      "publisher": "Architectural Intelligence, Volume 1, article number 9, (2022)",
      "URL": "https://doi.org/10.1007/s44223-022-00007-8",
      "Description": "<p>This paper articulates a decade-long research trajectory that redefines architectural tectonics through algorithmic design and robotic fabrication. Roland Snooks’ agentBody Prototypes synthesize structure, surface, and ornament into an inseparable whole, collapsing the disciplinary boundaries between expression, performance, and construction. His iterative, experimental methodology couples behavioral multi-agent algorithms with advanced fabrication systems such as wire-arc additive manufacturing and carbon-fiber infusion. Through these methods, tectonics becomes not an outcome but a continuously negotiated process—an evolving material intelligence embedded within both computation and fabrication.</p><p>In relation to our research, Snooks’ work offers a vital model for post-anthropogenic design-to-fabrication practices grounded in distributed agency and decentralized formation. His approach dismantles linear, optimization-driven workflows and replaces them with feedback-rich ecologies where design and making co-evolve. This reciprocal relationship between algorithmic intention and material contingency aligns with our exploration of open, transcalar design ecologies capable of fostering global symbiosis between human and non-human agents.</p><p>Crucially, Snooks’ position extends—or even resists—the concept of morphospace as a pre-defined domain of possible forms. Rather than operating within a precalculable design space, his work proposes a bounded but dynamic environment in which sets of behavioral rules govern emergent outcomes. Here, both design and fabrication are understood as generative fields—systems that evolve internal logics rather than converging on optimal or predetermined solutions. By embracing this indeterminate, self-organizing framework, Snooks situates tectonic formation as an open-ended, ecological process rather than a finite design problem.</p><p>His research thus provides a compelling precedent for our pursuit of decentralized, symbiotic, and post-anthropocentric fabrication cultures—where design intelligence arises from within material, computational, and environmental interplay rather than external control.</p>",
      "index": 17
    },
    {
      "id": "Deleuze, G. 1993",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Primary",
      "author": "Deleuze, G.",
      "title": "The Fold: Leibniz and the Baroque",
      "year": 1993,
      "publisher": "University of Minnesota Press",
      "URL": null,
      "Description": "<p>In The Fold: Leibniz and the Baroque, Gilles Deleuze reinterprets Leibniz’s metaphysics to propose a world composed not of discrete substances but of continuous and ever-transforming relations. Leibniz’s concept of the monad—a self-contained, indivisible unit that reflects the entire universe from its unique perspective—suggests a closed, pre-established harmony where each entity mirrors the whole without direct interaction. Deleuze challenges this enclosed model of substance, reimagining the monad not as an isolated atom of being but as a dynamic site of folding and unfolding. The fold becomes a metaphysical and material process through which the inside and outside continually exchange properties, dissolving boundaries between individual entities and their environments.</p><p>Architecture has frequently appropriated Deleuze’s concept of the fold to theorize supple, pliant geometry—an understanding that emerged prominently during the digital turn. As critics such as Douglas Spencer note, architectural discourse often drew on Deleuze and Guattari’s process-oriented ideas—like the rhizome, abstract machine, and the smooth and the striated—for their capacity to describe generative, non-hierarchical, and continuous systems. Within this context, the fold was taken up as a spatial and formal principle of continuity and modulation, emphasizing processes of transformation over static representation. However, in Deleuze’s own terms, the fold extends far beyond geometry: it articulates an ontological model of becoming where structure and substance are in perpetual negotiation.</p><p>This philosophical shift from fixed substances to differential processes provides a compelling framework for our research into decentralized, post-anthropogenic design-to-fabrication systems. Deleuze’s fold articulates a world of perpetual becoming, where matter, form, and force are co-implicated rather than hierarchically arranged. The fold operates across scales—from the micro-material to the planetary—suggesting an ontology of transcalar continuity that resonates with our aim to integrate digital, material, and ecological systems within open design ecologies. By replacing the monadic enclosure with a logic of interpenetration, Deleuze opens a space for non-linear, emergent modes of production, positioning design and fabrication as co-evolving processes of symbiotic formation.</p>",
      "index": 18
    },
    {
      "id": "Cache, B. 1995",
      "Theme": "Computational Exploration",
      "category": "Primary",
      "author": "Cache, B.",
      "title": "Earth Moves: The Furnishing of Territories",
      "year": 1995,
      "publisher": "MIT Press",
      "URL": null,
      "Description": "<p>Bernard Cache’s Earth Moves: The Furnishing of Territories (1995) offers a foundational philosophical and technological framework that resonates strongly with the concerns of our research on post-anthropogenic, decentralized, and open-ended design-to-fabrication practices. Drawing from Deleuze’s concept of the fold, Cache reconceives architecture not as the production of static forms, but as the continuous modulation of forces, surfaces, and territories. The world is not composed of fixed objects but of variable inflections—movements of matter that are always in formation.</p><p>At the core of this dynamic ontology lies the notion of the objectile—an object defined not by its final form, but by its generative parameters. The objectile exists as a continuum of potential instantiations, a calculated entity capable of variation across a family of forms. This conceptual shift from mold to modulation prefigures the logic of contemporary file-to-factory workflows, where digital models are directly materialized through computational and robotic systems. For Cache, materialization is not a passive translation of design intent but a co-productive process in which the agency of matter, code, and machine are interwoven.</p><p>When framed through the lens of computational design, Cache’s objectile anticipates the principles of morphogenesis and morphospace, where form emerges as a dynamic process within a continuum of virtual possibilities. Just as morphogenetic design explores fields of potential forms governed by parametric and material conditions, the objectile situates architecture within an open, topological landscape of becoming. In relation to our research, this alignment reinforces the move from centralized authorship to distributed, process-oriented ecologies of making. Earth Moves thus provides a critical philosophical grounding for understanding fabrication as a living, adaptive interface—one that enables transcalar, symbiotic design systems in which form, matter, and computation co-evolve beyond anthropocentric paradigms.</p>",
      "index": 19
    },
    {
      "id": "Negroponte, N. 1998",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Primary",
      "author": "Negroponte, N.",
      "title": "Beyond Digital",
      "year": 1998,
      "publisher": "WIRED 6.12 (Dec.)",
      "URL": null,
      "Description": "<p>Nicholas Negroponte’s “Beyond Digital” (1998) anticipates a post-digital paradigm in which computation ceases to be a visible technology and instead becomes an invisible substrate of everyday life. His assertion that “the Digital Revolution is over” reframes digitality not as an endpoint but as a condition — an infrastructural atmosphere enabling new modes of existence, production, and organization. For our research, which explores post-anthropogenic design-to-fabrication practices toward global symbiosis, Negroponte’s argument provides an early conceptual grounding for understanding how technological paradigms evolve from instrumental to environmental, from centralized systems of control to distributed ecologies of interaction.</p><p>Negroponte’s “five forces of change” — global imperatives, size polarities, redefined time, egalitarian energy, and meaningless territory — prefigure the decentralized, multiscalar frameworks central to our investigation. His vision of a world where “communities formed by ideas will be as strong as those formed by physical proximity” resonates with open design ecologies and networked fabrication systems that dissolve the boundaries between local and global, human and nonhuman, digital and material. The erosion of territoriality and emergence of “unterritorial” collaboration also parallels the ethos of distributed making — where fabrication, resource exchange, and authorship are collectively negotiated across planetary scales.</p><p>However, while Negroponte’s vision of a democratic, egalitarian internet seemed plausible in the late 1990s and early 2010s, the trajectory of digital culture has revealed the persistence — and even amplification — of hierarchical structures. The caste system, as he described it, was not merely an artifact of the physical world; it has been replicated and reconfigured in the digital sphere through data monopolies, algorithmic bias, and uneven access to technological agency. His text, though over-optimistic, remains an important speculative provocation — a reminder of what the digital age could and should have become.</p><p>Ultimately, Beyond Digital stands as both a visionary and cautionary milestone, articulating the consequences of globalization and the global digitization of life within the interconnected World Wide Web. It frames a horizon our research seeks to reapproach — a post-digital ecology where decentralization, openness, and symbiosis might finally realize the inclusive potential Negroponte once imagined.</p>",
      "index": 20
    },
    {
      "id": "DeLanda, M. 2002",
      "Theme": "Computational Exploration",
      "category": "Primary",
      "author": "DeLanda, M.",
      "title": "Intensive Science and Virtual Philosophy",
      "year": 2002,
      "publisher": "Bloomsbury",
      "URL": null,
      "Description": "<p>Manuel DeLanda’s Intensive Science and Virtual Philosophy (2002) offers a rigorous philosophical framework for rethinking material processes, morphogenesis, and emergence—ideas that resonate strongly with the theoretical and operative ambitions of our research. DeLanda reinterprets Deleuze’s concepts of the virtual, intensive, and multiplicity through the lens of contemporary science, particularly thermodynamics, nonlinear dynamics, and complexity theory. He proposes that form and structure are not imposed from above but arise through self-organizing processes driven by intensive differences and far-from-equilibrium conditions.</p><p>This perspective directly informs our investigation into post-anthropogenic design-to-fabrication practices, where form-finding and material articulation emerge through distributed, adaptive, and non-linear processes rather than fixed human authorship. DeLanda’s insistence on a non-essentialist realism—where material systems possess real capacities and tendencies that actualize through interaction—offers a philosophical grounding for decentralized design ecologies. In this light, fabrication becomes less about control and more about enabling the self-organization of matter across scales and contexts, aligning with the goal of achieving global symbiosis through open and responsive design systems.</p><p>DeLanda’s discussion of complexity and emergence also parallels the ethos of computational and transcalar fabrication. His notion that complexity must be understood qualitatively, as the capacity for systems to reorganize through bifurcations and phase transitions, aligns with approaches that treat digital and material processes as generative fields rather than deterministic workflows. Furthermore, his observation that computer simulations “stage interactions between virtual entities from which properties, tendencies, and capacities actually emerge” prefigures the role of computational environments as laboratories for exploring distributed agency and emergent form.</p><p>Overall, Intensive Science and Virtual Philosophy provides a conceptual bridge between material ontology and computational design thinking, supporting an understanding of fabrication as a dynamic, emergent negotiation between human, non-human, and material intelligences within a decentralized planetary ecology.</p>",
      "index": 21
    },
    {
      "id": "DeLanda, M. 2004",
      "Theme": "Symbiotic Material Ecologies",
      "category": "Primary",
      "author": "DeLanda, M.",
      "title": "Material Complexity",
      "year": 2004,
      "publisher": "Leach N, Turnbull D, Williams C, eds. Digital Tectonics. Wiley Academy",
      "URL": null,
      "Description": "<p>Manuel DeLanda’s essay “Material Complexity” in Digital Tectonics (2004) develops a philosophy of material agency and morphogenesis that powerfully complements the theoretical orientation of our research. Drawing from both materials science and Deleuze’s critique of the hylomorphic model—the idea that form is externally imposed upon inert matter—DeLanda argues for an understanding of design as a process of collaboration with active materials. He illustrates this through the behavior of dislocations in metals, showing how toughness and rigidity emerge as collective, nonlinear phenomena arising from the self-organizing dynamics of defects. For DeLanda, such emergent properties reveal that matter is not passive but endowed with tendencies, capacities, and internal singularities—a thermodynamic vitality that expresses itself most clearly in heterogeneous, far-from-equilibrium conditions.</p><p>This view aligns directly with our research’s aim to reimagine post-anthropogenic design-to-fabrication practices as forms of distributed co-production between human and non-human agents. DeLanda’s critique of industrial homogenization—both of materials and of skilled labor—underscores how modern production systems suppressed material variability in favor of efficiency and predictability. By contrast, our work seeks to reclaim heterogeneity and indeterminacy as generative forces within decentralized, open design ecologies. The notion that design can “tease a form out of active material” rather than impose one resonates with emerging computational and robotic fabrication processes that integrate feedback, adaptation, and material responsiveness across scales.</p><p>Ultimately, DeLanda’s reflection on material self-organization provides a conceptual bridge between philosophy, materials science, and digital fabrication. It supports an ecological and transcalar understanding of tectonics—one in which structure and form emerge through the negotiation of dynamic, energetic, and affective exchanges between matter, tools, and designers—advancing a vision of symbiotic fabrication practices beyond the anthropocentric paradigm.</p>",
      "index": 22
    },
    {
      "id": "Mitchell, W. 2005",
      "Theme": "Computational Exploration",
      "category": "Primary",
      "author": "Mitchell, W. J.",
      "title": "Constructing Complexity",
      "year": 2005,
      "publisher": "In: Computer-Aided Architectural Design Futures; pp.41–50",
      "URL": "https://doi.org/10.1007/1-4020-3698-1_3",
      "Description": "<p>William J. Mitchell’s Constructing Complexity offers a conceptual framework that resonates strongly with our research’s exploration of post-anthropogenic design-to-fabrication practices. Mitchell defines architectural complexity as the ratio between added design content and added construction content, arguing that the digital revolution has enabled architects to move beyond industrial-era uniformity toward non-repetitive, contextually responsive forms. His account of buildings as “materialized digital information” situates computation not merely as a representational medium but as an active agent in shaping material processes and aesthetic outcomes.</p><p>This understanding establishes a productive lens through which to examine our research’s ambition to bridge high-tech and low-tech fabrication ecologies. While Mitchell emphasizes the efficiencies of digitally controlled machinery—laser cutters, multi-axis mills, numerically controlled fabrication—as key enablers of non-standard tectonics, our work situates similar formal ambitions within decentralized, resource-constrained environments where manual labor and distributed making predominate. The resulting friction between digitally scripted design intent and non-automated construction realities recalls Mitchell’s observation that complexity is not simply a matter of geometry but of how information and material processes are coordinated across scales.</p><p>By extending Mitchell’s model into post-anthropogenic and transcalar contexts, our research reinterprets “complexity” as a collective and ecological condition rather than a computational one. The ratio between design and construction content becomes a relational metric—mediated by networks of human and non-human actors, open design platforms, and vernacular fabrication practices. In this light, Constructing Complexity provides both a technical foundation and a critical foil: it frames the promise of digital precision and mass customization that our research reimagines through more-than-human, open-ended, and distributed modes of making—toward a globally symbiotic, non-standard architecture.</p>",
      "index": 23
    },
    {
      "id": "Waldrop, M. 1993",
      "Theme": "Computational Exploration",
      "category": "Primary",
      "author": "Waldrop, M. M.",
      "title": "Complexity: The Emerging Science at the Edge of Order and Chaos",
      "year": 1993,
      "publisher": "Simon & Schuster",
      "URL": null,
      "Description": "<p>Waldrop’s Complexity: The Emerging Science at the Edge of Order and Chaos (1992) offers a foundational narrative for understanding systems that evolve, adapt, and self-organize without centralized control—an intellectual framework that deeply informs our research. His account of complexity science, emerging from the Santa Fe Institute, situates adaptive networks, feedback loops, and emergent order as central mechanisms through which diverse agents collectively generate new forms of organization. These principles resonate strongly with post-anthropogenic design-to-fabrication paradigms, which similarly reject linear, deterministic models in favor of distributed, co-evolutionary systems of making.</p><p>In complexity theory, Waldrop identifies the “edge of chaos” as a dynamic zone between stability and disorder—where innovation, resilience, and adaptation thrive. This notion parallels our exploration of decentralized open design ecologies, where material, digital, and ecological systems interact continuously, generating non-standard tectonics through emergent feedback rather than prescriptive authorship. The book’s emphasis on self-organization and adaptive processes also aligns with the logic of transcalar fabrication, in which design intelligence is embedded across scales—from the local material agency of fabrication tools to the global networks of open-source collaboration.</p><p>By framing design as a complex adaptive system, Waldrop’s narrative encourages a shift from object-oriented to process-oriented thinking. It supports the idea that fabrication practices can act as ecological negotiations rather than isolated technological acts—balancing autonomy and interdependence, order and indeterminacy. In this sense, Complexity provides both a conceptual lens and a philosophical grounding for reimagining design not as a human-centered imposition of form, but as an emergent choreography of relations among human, non-human, and machinic agents. Waldrop’s work thus reinforces the theoretical and systemic ambitions of our research toward global symbiosis through decentralized, adaptive, and ecologically attuned modes of design and fabrication.</p>",
      "index": 24
    },
    {
      "id": "Crolla, K. 2018",
      "Theme": "Phygital Practices",
      "category": "Selected",
      "author": "Crolla, K.",
      "title": "Building Simplexity: The “More or Less” of Post-Digital Architecture Practice",
      "year": 2018,
      "publisher": "PhD Dissertation, RMIT University",
      "URL": "https://doi.org/10.25439/rmt.27602601",
      "Description": "<p>Kristof Crolla’s Building Simplexity (2018) positions architectural design within a post-digital paradigm where computational ambition must be reconciled with the stubborn realities of material construction. For Crolla, complexity is not achieved through increasingly sophisticated algorithms but through a strategic interplay between digital intent and physical constraint. He defines this approach as simplexity: attaining formally rich outcomes through simple, low-tech, and constructible means. Rather than treating fabrication as a downstream act of execution, Crolla insists that it is an active epistemic partner. Architecture emerges through an iterative dialogue among form, matter, material systems, and materialisation, in which material feedback continually reshapes digital decisions.</p><p>Crolla’s method remains rooted in parametric design, operating within an expansive morphospace of controlled variations. Here, uncertainty is welcomed but bounded: designers explore possibility through measurable parameters, navigating a continuum of options that remain legible and buildable. Unlike methodologies that foreground digital autonomy or agent-based emergence, Crolla emphasizes reciprocity—the capacity of materials, tolerances, and construction processes to inform and sometimes redirect computational form-finding.</p><p>Philosophically, Building Simplexity builds on Deleuze and Cache’s notion of the objectile, but grounds it in the pragmatics of fabrication. Crolla warns that digital experimentation untethered from constructability risks becoming abstract speculation. By restoring material negotiation to the center of design, he reframes post-digital practice as a craft of mediation—one in which computation is not a generator of autonomous complexity but a facilitator of constructive intelligence. Simplexity thus offers a balanced vision for contemporary architecture: where emergence is tempered by embodiment, and where innovation arises from the productive friction between the digital and the real.</p>",
      "index": 25
    },
    {
      "id": "Burry, M. 2011",
      "Theme": "Phygital Practices",
      "category": "Primary",
      "author": "Burry, M.",
      "title": "Scripting Cultures: Architectural Design and Programming",
      "year": 2011,
      "publisher": "Wiley",
      "URL": null,
      "Description": "<p>Mark Burry’s Scripting Cultures: Architectural Design and Programming (2011) articulates a pivotal cultural and technical shift in architecture—from the designer as software user to the designer as digital toolmaker. Central to this transition is what Burry calls authoritative customization: the designer’s capacity to reprogram or script digital tools to align with their own design logic rather than conforming to the limitations of commercial software. This reclaiming of authorship transforms computation from a passive medium into an active collaborator. Such a stance resonates with our research, which explores post-anthropogenic design-to-fabrication practices and decentralized open design ecologies oriented toward global symbiosis.</p><p>Burry’s reflections on file-to-factory workflows situate scripting as a critical link between digital design and material realization. He demonstrates how direct digital manufacturing—where code communicates seamlessly with fabrication machinery—enables the production of bespoke, non-standard components without sacrificing efficiency. This paradigm anticipates the distributed fabrication networks that our research seeks to expand, where open protocols and shared digital infrastructures allow for localized, adaptive making across scales and contexts.</p><p>Equally significant is Burry’s chapter on “Simplifying Complexity for Fabrication.” Here, scripting is not presented as a means of generating complexity for its own sake, but as a strategy for managing and curating it—translating intricate geometries into constructible, materially responsive systems. This conceptualization aligns with our transcalar fabrication agenda, which frames complexity as an emergent property of collaboration between digital processes, material behavior, and ecological contingencies.</p><p>Through the interrelation of authoritative customization, file-to-factory intelligence, and the simplification of complexity, Scripting Cultures offers a foundational framework for rethinking computational authorship and fabrication ethics. It provides valuable theoretical grounding for our pursuit of open, symbiotic, and adaptive design systems capable of bridging digital, material, and ecological domains.</p>",
      "index": 26
    },
    {
      "id": "Venturi, R. 1966",
      "Theme": "Decentralized Governance & Commons",
      "category": "Primary",
      "author": "Venturi, R.",
      "title": "Complexity and Contradiction in Architecture",
      "year": 1966,
      "publisher": "Museum of Modern Art",
      "URL": null,
      "Description": "<p>In Complexity and Contradiction in Architecture, Robert Venturi challenges the reductive rationalism of modernism, proposing an architecture that embraces ambiguity, tension, and contradiction. His notion of “complexity” celebrates multiplicity and layered meaning — a “both-and” condition that resists the singularity and purity of modernist logic. By reintroducing ornament, symbolism, and historical reference, Venturi destabilized the modernist pursuit of universality and opened a path toward postmodern pluralism. Yet, while positioned as a critique of modernism, Venturi’s postmodernism remains fundamentally top-down and anthropocentric: it privileges the architect’s authorial control and treats complexity as a compositional and aesthetic construct rather than an emergent property of systems. The architect still orchestrates meaning from above, reinforcing human-centered agency and maintaining architecture as a medium of symbolic manipulation rather than ecological or material interaction.</p><p>From the perspective of our research, Venturi’s concept of “complexity” can be more accurately understood as complication — the deliberate juxtaposition of contradictory parts within a unified composition. Later theorists such as Greg Lynn and Jeff Kipnis have identified this as “complication masquerading as complexity,” highlighting its dependence on static, representational form rather than on dynamic, self-organizing processes. Venturi’s “complex whole” thus relies on contradiction and collage, not on the adaptive, processual, and distributed logics that define contemporary conceptions of emergence. By contrast, our research reframes complexity as emergent and symbiotic, arising from interactions among materials, agents, and environments. Within decentralized open design ecologies, complexity is not composed but generated — a property of systems in flux, where design intelligence is collectively negotiated across scales and species.</p><p>This distinction is critical for defining the boundaries of our research and clarifying that it should not be associated with postmodernism. Venturi’s human-centered, representational complexity provides an essential historical counterpoint — a moment that revealed the limits of composition as a response to modernity. Our work advances beyond this framework toward a post-anthropogenic paradigm, where complexity from emergence, and fabrication simplexity converge to articulate new forms of global symbiosis. In this light, Venturi’s text remains invaluable not as a model, but as a conceptual threshold that delineates where our discourse begins: at the point where complication yields to genuine systemic complexity and where design evolves from authorship to ecology.</p>",
      "index": 27
    },
    {
      "id": "Jandrić, P. 2023",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Primary",
      "author": "Jandrić, P.",
      "title": "Postdigital",
      "year": 2023,
      "publisher": "In: Encyclopedia of Postdigital Science and Education. Springer",
      "URL": "https://doi.org/10.1007/978-3-031-35469-4_23-1",
      "Description": "<p>Jandrić’s (2023) overview of the postdigital provides a critical framework for understanding contemporary technological and cultural production beyond the binary of the digital and analog, aligning closely with the philosophical foundations of our research. The postdigital condition—defined as messy, hybrid, and transdisciplinary—foregrounds an entanglement of technological, biological, and informational systems that resonates with our exploration of post-anthropogenic design-to-fabrication practices. In both cases, the focus shifts from digital novelty to systemic interrelations and socio-material ecologies, where design and fabrication are understood as part of complex, multi-scalar networks rather than isolated technical processes.</p><p>Jandrić’s emphasis on rejecting technological instrumentalism and determinism parallels our interest in decentralizing design agency and challenging anthropocentric production paradigms. His account of postdigital scholarship—particularly its commitment to critical pedagogy, social justice, and transdisciplinary knowledge ecologies—supports an expanded notion of design as a political and ethical act embedded in planetary systems. This aligns with our aim to develop open, distributed design ecologies and transcalar fabrication logics that enable forms of global symbiosis between human and non-human agents.</p><p>Furthermore, the postdigital’s concern with the “banality” and invisibility of digitality (after Negroponte and Cascone) mirrors our effort to move beyond the fetishization of digital tools toward integrative material practices that engage both computational and environmental intelligences. The postdigital framework thus offers a theoretical lens for understanding how design computation can evolve into relational, hybrid, and context-aware processes—bridging fabrication, ecology, and collective agency. Ultimately, Jandrić’s articulation of the postdigital as a condition of ongoing negotiation and co-emergence provides a conceptual scaffolding for rethinking fabrication as a site of planetary co-design and for situating our research within a broader postdigital and posthumanist discourse.</p>",
      "index": 28
    },
    {
      "id": "Cramer, F. 2014",
      "Theme": "Phygital Practices",
      "category": "Primary",
      "author": "Cramer, F.",
      "title": "What Is “Post-Digital”?",
      "year": 2014,
      "publisher": "A Peer-Reviewed Journal About (APRJA), 3(1)",
      "URL": "https://doi.org/10.7146/aprja.v3i1.116068",
      "Description": "<p>Cramer’s (2014) essay “What Is Post-Digital?” offers a nuanced and materially grounded exploration of how the postdigital emerges from both the saturation and disenchantment with digital culture. Rather than signalling the end of digital technology, Cramer defines the postdigital as a condition in which digital systems have become mundane and are critically recontextualized within hybrid material practices that blend the analog, the digital, and the social. This conception directly informs our research by framing post-anthropogenic design-to-fabrication as a postdigital practice—one that refuses binary distinctions between technological and ecological, synthetic and organic, or high-tech and low-tech production.</p><p>Cramer’s analysis of the “DIY versus corporate media” divide and the “maker movement” resonates with our exploration of decentralized open design ecologies. Both challenge the dominance of centralized, proprietary systems by emphasizing distributed, participatory, and materially situated modes of making. His description of postdigital hybridity—where “old” media like printmaking, cassettes, and zines are reactivated within new collaborative frameworks—parallels our interest in transcalar fabrication systems that combine local material intelligence with global digital coordination.</p><p>Moreover, Cramer’s critique of “techno-positivist innovation narratives” aligns with our rejection of linear, progress-driven understandings of design technology. Instead, he calls for a pluralistic material culture where tools and processes are valued for their affordances, imperfections, and contextual meanings. This aligns with our vision of fabrication as an ecological negotiation rather than an optimization problem. Finally, his emphasis on the semiotic shift from symbolic code to indexical trace—where making becomes ontological rather than representational—offers a critical lens for rethinking design as a performative act of co-creation within planetary material systems. In this sense, Cramer’s postdigital framework underpins our research’s ambition to situate design-to-fabrication practices within a broader discourse of global symbiosis and relational materiality.</p>",
      "index": 29
    },
    {
      "id": "Yan, C. et al. 2024",
      "Theme": "Phygital Practices",
      "category": "Primary",
      "author": "Yan, C.; Yuan, P. F.",
      "title": "Phygital Intelligence",
      "year": 2024,
      "publisher": "Architectural Intelligence [Internet];3(1)",
      "URL": "https://doi.org/10.1007/s44223-024-00073-0",
      "Description": "<p>Yan and Yuan’s (2024) editorial on Phygital Intelligence situates architectural practice within an emerging paradigm that merges the digital and the physical, redefining how design and construction interface across virtual and material domains. The authors position the “phygital” as a hybrid condition that transcends traditional binaries—between the real and the virtual, the human and the machinic, the local and the global. This conceptual shift resonates directly with the objectives of our research, which explores decentralized and transcalar design-to-fabrication practices aimed at fostering global symbiosis through non-standard, post-anthropogenic tectonics.</p><p>Yan and Yuan identify three key areas in which phygital intelligence reconfigures architecture: spatial perception, AI-driven design, and the ecological repositioning of human-nonhuman relations. Their articulation of mixed-reality technologies such as AR/VR and brain–computer interfaces expands spatial cognition beyond static ergonomics, towards adaptive and responsive environments. This aligns with our research’s interest in participatory and distributed modes of making, where human and nonhuman agents co-produce form and performance through data-rich feedback systems.</p><p>Furthermore, the authors’ discussion of AI-facilitated generative design underscores a transition from deterministic authorship to collaborative synthesis between designer and machine. Such hybrid intelligence echoes our exploration of open, networked design ecologies—where knowledge and fabrication capacities are decentralized across scales, materials, and contexts. Importantly, Yan and Yuan emphasize that phygital intelligence should not merely yield technological innovation but must engage ethical and ecological reconfigurations of habitation.</p><p>By framing architecture as a site of negotiation between virtual intelligence, physical matter, and planetary systems, Phygital Intelligence provides a critical theoretical scaffold for rethinking how post-anthropogenic design practices might operate as instruments of global symbiosis. It substantiates the notion that the future of design-to-fabrication lies not in automation alone, but in the cultivation of hybrid, co-evolutionary intelligences bridging the digital and the ecological.</p>",
      "index": 30
    },
    {
      "id": "Baudrillard, J. 1968",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Primary",
      "author": "Baudrillard, J.",
      "title": "The System of Objects",
      "year": 1968,
      "publisher": " Verso Books.",
      "URL": null,
      "Description": "<p>Jean Baudrillard’s The System of Objects (1968) offers a prescient critique of automation that directly informs our research. For Baudrillard, technological “intelligence” produces not emancipation but passivity: the more “smart” an object becomes, the less it requires human engagement. Automation transforms users into spectators of their own systems, dissolving the reciprocal, tactile, and interpretive relationship that once bound people to the tools and materials of their world. What appears as technical progress is, for Baudrillard, a subtle erasure of agency—a displacement of creativity into the operational logic of machines.</p><p>Our research extends this warning into the contemporary landscape of design-to-fabrication. As computational and automated processes proliferate, the figure of the designer risks becoming another spectator—one who curates rather than constructs, oversees rather than intervenes. Baudrillard’s insight exposes the paradox of “smart” fabrication: intelligence is achieved not through participation but through the elimination of uncertainty and gesture, reducing creativity to the calibration of pre-programmed efficiencies. In this light, automation is not neutral; it carries with it the ideological residue of consumerism, where production, like consumption, becomes an act of observation rather than exchange.</p><p>By revisiting Baudrillard’s critique, our research situates post-anthropogenic design within this bleak continuum of technological spectatorship. His argument becomes a cautionary framework: if automation in fabrication merely perfects the system’s self-operation, it risks reproducing the same detachment he diagnosed in consumer society. Rather than opposing his pessimism, our work acknowledges and extends it—examining how post-human design ecologies might confront, rather than conceal, the loss of human agency within the expanding intelligence of machines.</p>",
      "index": 31
    },
    {
      "id": "Wiener, N. 1948",
      "Theme": "Phygital Practices",
      "category": "Primary",
      "author": "Wiener, N.",
      "title": "Cybernetics: Or Control and Communication in the Animal and the Machine",
      "year": 1948,
      "publisher": null,
      "URL": null,
      "Description": "<p>Norbert Wiener’s Cybernetics: Or Control and Communication in the Animal and the Machine (1948) establishes the conceptual foundation for much of contemporary computational design theory and practice. In this seminal work, Wiener articulates a unifying framework for understanding systems—biological, mechanical, and social—through the lenses of communication, feedback, and control. His proposition that both living organisms and machines operate as information-processing systems laid the groundwork for subsequent developments in artificial intelligence, systems theory, and digital computation—fields that deeply inform our research into post-anthropogenic, symbiotic design processes.</p><p>Cybernetics introduced the notion of feedback loops as mechanisms of self-regulation and adaptation—principles now fundamental to generative design, parametric modeling, and responsive fabrication systems. Wiener’s recognition of communication as control anticipates the ways computational design operates today: through the continuous exchange of data between designer, system, material, and environment. This relational paradigm supports decentralized and emergent design practices, where form and behavior evolve through interaction rather than top-down determination.</p><p>In the context of our research, Wiener’s ideas resonate with the move toward decentralized open design ecologies and transcalar fabrication networks, where intelligence is distributed across agents, materials, and machines. His exploration of the parallels between biological and mechanical systems foreshadows the convergence of computation and ecology in post-anthropogenic design thinking. Cybernetics thus provides not only a technical precedent but also a philosophical one—framing design as a process of negotiation within complex, adaptive systems rather than a purely human act of authorship.</p><p>Ultimately, Wiener’s Cybernetics remains foundational to the principles of emergence, feedback-driven form-finding, and systemic interconnectivity that underpin contemporary approaches to computational and symbiotic design. It offers an enduring theoretical lens through which to understand and develop new modes of design-to-fabrication that align with global and ecological entanglement.</p>",
      "index": 32
    },
    {
      "id": "Licklider, J. 1960",
      "Theme": "Phygital Practices",
      "category": "Primary",
      "author": "Licklider, J. C. R.",
      "title": "Man-Computer Symbiosis",
      "year": 1960,
      "publisher": "IRE Transactions on Human Factors in Electronics, volume HFE-1, pages 4-11",
      "URL": "https://doi.org/10.1109/THFE2.1960.4503259",
      "Description": "<p>In Man–Computer Symbiosis (1960), J.C.R. Licklider proposes a vision of cooperative interaction between humans and computers that extends beyond mere automation. He envisions a partnership in which humans and machines “live together in intimate association” — each complementing the other’s capabilities. Humans, Licklider argues, are best suited to setting goals, formulating hypotheses, and making evaluative judgments, while machines excel at executing routine, data-intensive, or time-sensitive operations. The goal of this symbiosis is not simply efficiency, but a transformation of how thought and decision-making occur, enabling intellectual operations “more effectively than man alone can perform them.”</p><p>In relation to our research, Licklider’s framework provides a crucial conceptual grounding for understanding emerging modes of human–machine collaboration in design-to-fabrication systems. His notion of symbiosis anticipates contemporary shifts in computational design, where design authorship and agency are distributed across human and non-human actors. Rather than a hierarchy in which the human designer supervises and the machine executes, symbiotic approaches suggest a co-evolutionary dynamic — one in which tools are not passive instruments but active participants in generative and decision-making processes.</p><p>As our research explores decentralized, open, and transcalar fabrication ecologies, Licklider’s ideas invite a re-evaluation of the human’s position within these systems. His early distinction between “mechanically extended man” and truly symbiotic systems parallels the move from conventional automation toward adaptive human–robot teams capable of autonomous reasoning and negotiation. In this light, man–computer symbiosis becomes a theoretical bridge — linking early cybernetic conceptions of cooperative intelligence with post-anthropocentric design practices that aim for global, ecological forms of symbiosis across scales of matter, agency, and computation.</p>",
      "index": 33
    },
    {
      "id": "Negroponte, N. 1970",
      "Theme": "Decentralized Governance & Commons",
      "category": "Primary",
      "author": "Negroponte, N.",
      "title": "The Architecture Machine: Toward a More Human Environment",
      "year": 1970,
      "publisher": " The MIT Press",
      "URL": "https://doi.org/10.7551/mitpress/8269.001.0001",
      "Description": "<p>In The Architecture Machine, Nicholas Negroponte envisions a future in which computers act not as drafting instruments but as intelligent collaborators in the design process. Written during his leadership of MIT’s Architecture Machine Group, the book merges architectural theory with early cybernetics and artificial intelligence, proposing a “two-way conversation” between human and machine. Negroponte argues that design systems should be capable of perception, learning, and adaptation—able to handle ambiguity and evolve through dialogue with the user. The book presents experimental systems such as URBAN5, where the computer interprets spatial input, infers intent, and offers design feedback.</p><p>For our research, The Architecture Machine provides an early framework for understanding distributed design intelligence within computational and fabrication contexts. Negroponte’s call for machines that “learn from their users” anticipates the adaptive, data-driven logics that now underpin decentralized and open design ecologies. His notion of a participatory and evolving architecture resonates with our exploration of systems where agency and authorship are shared among human and non-human actors. By emphasizing dialogue and mutual adaptation, Negroponte foreshadows contemporary notions of human–machine symbiosis in design-to-fabrication processes.</p><p>The text also introduces a form of transcalar reasoning: the “machine in residence” concept implies computational systems that can negotiate between intimate, human-scale environments and complex, systemic urban or environmental conditions. This perspective parallels our research’s ambition to develop fabrication ecologies operating across scales and disciplines. While Negroponte’s technical reach was limited by the computing capabilities of his time, his theoretical position remains profoundly relevant. His insistence that machines should embrace uncertainty, context, and qualitative reasoning challenges the determinism often associated with automation. Ultimately, The Architecture Machine stands as a foundational vision of post-anthropocentric design practice—one where computational systems evolve toward true symbiosis with human creativity and the built environment.</p>",
      "index": 34
    },
    {
      "id": "Mitchell, W. 1979",
      "Theme": "Phygital Practices",
      "category": "Primary",
      "author": "Mitchell, W. J.",
      "title": "Computer-Aided Architectural Design",
      "year": 1979,
      "publisher": "Van Nostrand Reinhold Company",
      "URL": null,
      "Description": "<p>Mitchell’s Computer-Aided Architectural Design (1977/1979) provides a foundational framework for understanding how computation transforms architectural thinking—from the automation of representation to the structuring of design as a process. His proposition that CAAD marks a “shift from representation to process” remains profoundly relevant to our research, which engages design-to-fabrication practices beyond anthropocentric and centralized paradigms.</p><p>Mitchell’s emphasis on computational structuring—defining goals, constraints, and relationships—anticipates contemporary algorithmic and parametric methods that underpin decentralized and adaptive design systems. By conceptualizing design as an information process rather than a fixed geometric act, CAAD opens a lineage that allows for distributed intelligence, iterative feedback, and emergent form-finding—all key mechanisms in post-anthropogenic and transcalar design frameworks. The capacity to generate and evaluate alternatives computationally aligns with ecologically responsive design strategies, where environmental and material data can inform fabrication directly, enabling symbiotic integration between digital systems and material ecologies.</p><p>Moreover, Mitchell’s attention to data management and representation foreshadows today’s networked and open-source design environments. His notion of design databases as evolving repositories of knowledge parallels the idea of decentralized open design ecologies, where information circulates across scales and agents rather than remaining within isolated authorial control. In this sense, CAAD is not merely a precursor to BIM or digital fabrication but an early articulation of architecture as a cybernetic, process-based discipline—one capable of negotiating complexity through computation.</p><p>Revisiting Mitchell’s work thus situates our research within a longer trajectory of computational thought, illuminating how early CAAD theories anticipated the relational, adaptive, and distributed design systems now necessary for global symbiosis in architectural production.</p>",
      "index": 35
    },
    {
      "id": "Llach, D. 2007",
      "Theme": "Computational Exploration",
      "category": "Primary",
      "author": "Llach, D. C.",
      "title": "A Generative Grammar for 2D Manufacturing of 3D Objects",
      "year": 2007,
      "publisher": "Master Thesis, MIT Media Lab",
      "URL": "http://dspace.mit.edu/handle/1721.1/39500",
      "Description": "<p>Daniel Cardoso Llach’s A Generative Grammar for 2D Manufacturing of 3D Objects (2007) offers a pivotal critique of the persistent dualism between design and fabrication, a divide he traces through architectural and western philosophical history (Descartes) as the separation of mind and body, conception and execution. Llach’s central proposition — a generative grammar for 2D manufacturing of 3D forms — is presented as an antidote to what he calls “the excesses of too exclusively post-rational approaches” in contemporary digital design. In these post-rational practices, computational tools are often used to perfect form while relegating material engagement to a subordinate, automated process. Llach argues instead for a generative dialogue between design and fabrication in which material intelligence, structural behavior, and process constraints become active participants in the creation of form.</p><p>This argument directly informs our research, which similarly challenges the disciplinary and operational hierarchies that separate digital authorship from material realization. Llach’s critique of symbolic 3D modeling environments — which render the contingencies of fabrication invisible — parallels our concern with how current computational systems perpetuate centralized and anthropocentric models of design. By framing fabrication not as a mechanical endpoint but as an epistemic and creative dimension of design, Llach opens space for rethinking computation as a site of co-production between designer, machine, and material.</p><p>Through his reflection on the work of MIT’s Digital Design and Fabrication Group (DDFG), Llach also exposes how narratives of automation sustain the illusion of creative freedom detached from materiality. His generative grammar, by contrast, suggests a materially responsive computational logic — one that anticipates distributed and open-ended fabrication practices. In this sense, Llach’s work offers a crucial conceptual foundation for our exploration of post-dualist, decentralized design-to-fabrication ecologies that embrace interdependence and material symbiosis over abstraction and control.</p>",
      "index": 36
    },
    {
      "id": "Menges, A. 2013",
      "Theme": "Computational Exploration",
      "category": "Primary",
      "author": "Menges, A.",
      "title": "Morphospaces of Robotic Fabrication",
      "year": 2013,
      "publisher": "Rob|Arch 2012: Robotic Fabrication in Architecture, Art and Design (proceedings)",
      "URL": "https://doi.org/10.1007/978-3-7091-1465-0_3",
      "Description": "<p>Achim Menges’ Morphospaces of Robotic Fabrication (2013) introduces the notion of “machinic morphospaces” as a conceptual and methodological framework to link computational design and robotic fabrication. Drawing from theoretical morphology in biology—particularly the distinction between empirical and theoretical morphospaces—Menges redefines the relationship between form generation and materialization. Rather than treating fabrication as a post-design operation, the paper argues for an integrative approach where material, machine, and geometry co-evolve within a shared parameter space. Morphospaces thus become generative fields that delineate the boundaries of what is geometrically possible, materially viable, and robotically fabricable.</p><p>In relation to our research, this framework offers a valuable lens for examining how decentralized and post-anthropogenic design practices might engage with fabrication as an adaptive, ecological process rather than a deterministic one. Menges’ machinic morphospaces operate as “negotiation diagrams” between computational abstraction and embodied construction—an epistemic bridge that resonates with the ambition to dissolve rigid hierarchies between design authorship, material agency, and production infrastructure. By embedding fabrication constraints within the generative system, morphospaces allow for non-linear exploration of form, fostering emergent diversity rather than standardization.</p><p>Furthermore, the concept opens critical ground for understanding fabrication not merely as a tool of efficiency but as a site of ecological intelligence. When translated into decentralized open design ecologies, machinic morphospaces could function as distributed “commons of possibility,” mapping the shared limits and affordances of diverse fabrication ecologies across scales and locales. In this sense, Menges’ theory contributes not only to the discourse on robotic fabrication but to a broader rethinking of design-to-fabrication logics towards global symbiosis—where computational and material systems co-produce non-standard, situated tectonics within an interconnected planetary framework.</p>",
      "index": 37
    },
    {
      "id": "Carpo, M. 2024",
      "Theme": "Phygital Practices",
      "category": "Selected",
      "author": "Carpo, M.",
      "title": "The Sustainable Lightness of Digital Fabrication",
      "year": 2024,
      "publisher": "Architectural Design [Internet];94(5):14–21",
      "URL": "https://doi.org/10.1002/ad.3092",
      "Description": "<p>Mario Carpo’s The Sustainable Lightness of Digital Fabrication (2024) traces how the digital turn reconfigures the relationship between design, fabrication, and the economics of making. Carpo argues that digital fabrication marks a decisive break from the industrial paradigm, which for over a century tied efficiency to standardization. In industrial production, uniformity was both a technical requirement and an economic necessity: repeating identical objects reduced cost, reinforced centralized factories, and reproduced the hierarchy separating designers from workers. Digital fabrication, however, introduces a fundamental shift—the cost of producing variation approaches the cost of repetition, enabling what Carpo famously frames as the possibility of mass-customization.</p><p>This transformation carries profound cultural and political implications. Because digital tools can store and manipulate information directly, each instance of a design can be unique without incurring higher expense. Carpo sees this as an emancipatory break: technologies once dependent on industrial scale now allow decentralized, local production driven by individual or community agency. The “lightness” he describes is not merely material efficiency but a structural reorientation of authorship, value, and technological power.</p><p>Yet Carpo also warns that the post-digital condition has not fully realized its democratizing promise. While early digital fabrication empowered designers and makers, contemporary computational ecosystems risk reinstating centralized control through proprietary platforms, opaque algorithms, and automated interfaces that obscure their operations. What once promised distributed intelligence now threatens new forms of epistemic dependency.</p><p>For Carpo, the future of digital fabrication depends on preserving intelligibility—ensuring that technological power remains transparent, participatory, and accessible. Only then can digital tools sustain the cultural and political liberation inherent in their technical possibilities.</p>",
      "index": 38
    },
    {
      "id": "Carpo, M. 2017",
      "Theme": "Phygital Practices",
      "category": "Primary",
      "author": "Carpo, M.",
      "title": "The Second Digital Turn: Design Beyond Intelligence",
      "year": 2017,
      "publisher": "MIT Press",
      "URL": null,
      "Description": "<p>Mario Carpo’s The Second Digital Turn: Design Beyond Intelligence (2017) provides a crucial theoretical framework for understanding the shift from the first wave of digital design—rooted in parametric variation and mass customization—to a second phase defined by algorithmic indeterminacy, data-driven processes, and the partial displacement of human authorship. In the context of our research, Carpo’s reflections illuminate how contemporary design-to-fabrication practices are evolving from human-centered systems of control toward decentralized, post-anthropocentric forms of production.</p><p>Carpo traces the first digital turn of the 1990s as a humanist endeavor: architects used computation to execute what they could already conceive, extending traditional design logics through digital precision and variability. The “second digital turn,” by contrast, signals a fundamental epistemological rupture—machines no longer serve merely as tools but as agents capable of generating unforeseen outcomes through data-based reasoning. This shift destabilizes the architect’s historical role as sole author and opens a space for nonhuman intelligences—artificial, material, or environmental—to participate in design decision-making.</p><p>For our research, this transformation provides both a conceptual precedent and a point of departure. Carpo’s notion of “design beyond intelligence” parallels the ambition to develop post-anthropogenic and symbiotic design ecologies, where agency is distributed across networks of humans, machines, and matter. His critique of centralized authorship and standardization resonates with emerging decentralized fabrication logics that privilege open-source collaboration and transcalar responsiveness over singular authorship or industrial uniformity.</p><p>Ultimately, Carpo’s argument foregrounds a transition from representational to performative modes of design, a condition our research extends toward ecological and systemic dimensions. By situating fabrication within distributed digital ecosystems rather than hierarchical workflows, our project aligns with Carpo’s call for designers to compose “with” computational processes rather than “through” them—seeking not mastery over technology, but co-evolution within it.</p>",
      "index": 39
    },
    {
      "id": "Carpo, M. 2023",
      "Theme": "Decentralized Governance & Commons",
      "category": "Primary",
      "author": "Carpo, M.",
      "title": "Beyond Digital: Design and Automation at the End of Modernity",
      "year": 2023,
      "publisher": "MIT Press",
      "URL": null,
      "Description": "<p>Mario Carpo’s Beyond Digital: Design and Automation at the End of Modernity (MIT Press, 2023) provides a crucial theoretical framework for understanding the transition from industrial, centralized modes of production toward computationally distributed, post-mechanical systems of making. Carpo charts a historical arc from hand-making to mechanical mass production and finally to digital fabrication, arguing that the defining feature of the digital is its non-scalar logic — a condition where economies of scale no longer apply because each digitally fabricated object can differ at no additional cost. This conceptual shift underpins many of the premises explored in our research, particularly the move from top-down industrial systems to decentralized, adaptive networks of production.</p><p>Carpo’s notion of an “economy without scale” resonates with our investigation of distributed, open, and collaborative fabrication ecologies. By positioning computation as the technical logic that dissolves the modernist pursuit of standardization, Carpo provides both historical grounding and philosophical justification for exploring non-standard tectonics and transcalar design workflows. His discussion of digital mass customization and the potential for local, on-demand production anticipates the ecological and socio-technical implications of distributed making that our research seeks to expand upon.</p><p>Moreover, Carpo’s reflections on the pandemic as the moment of collapse for the industrial “Anthropocenic” paradigm offer a direct parallel to our inquiry into post-anthropogenic design logics. Where Carpo envisions a post-industrial world sustained by information and automation, our research extends this trajectory toward ecological co-agency — exploring how decentralized fabrication might foster forms of global symbiosis rather than human-centered efficiency.</p><p>Ultimately, Beyond Digital contributes an essential theoretical backbone for rethinking design-to-fabrication not as a linear, centralized process but as a heterogeneous network of human and non-human actors operating through computation, automation, and distributed intelligence. It frames the digital not as a toolset but as a paradigm of systemic reorganization — a premise foundational to our research.</p>",
      "index": 40
    },
    {
      "id": "Davis, D. et al. 2013",
      "Theme": "Phygital Practices",
      "category": "Primary",
      "author": "Davis, D.; Peters, B.",
      "title": "Design Ecosystems: Customising the Architectural Design Environment with Software Plug-ins",
      "year": 2013,
      "publisher": "Architectural Design",
      "URL": null,
      "Description": "<p>This article explores the transformative shift in architectural authorship and digital design culture through the proliferation of scripting and plug-in development within CAD environments. Davis and Peters articulate how architects have moved from being passive users of monolithic “cathedral” software systems toward becoming active participants in open “bazaar”-like ecosystems of tool-making and sharing. The piece situates this cultural change in the context of generative modeling platforms such as Grasshopper, where architects collaboratively build, exchange, and evolve digital components that extend their design environments. By emphasizing the emergent, decentralized, and evolutionary qualities of these ecosystems, the authors highlight how architects now orchestrate their own computational milieus—spaces that continuously adapt in response to project needs, technological advances, and community contributions.</p><p>For our research, this work is highly relevant as it frames software customization not merely as a technical enhancement but as a new mode of authorship and collaboration within digital architecture. The notion of the “design ecosystem” parallels our inquiry into decentralized open design ecologies and the negotiation of authorship across scales and disciplines. Davis and Peters’ discussion of flexibility, interoperability, and the danger of “black-box” dependencies underscores the importance of transparency and adaptability within computational workflows—qualities essential for post-anthropogenic, symbiotic modes of design-to-fabrication. Their exploration of plug-in cultures offers a conceptual bridge between local tool-making practices and globally networked forms of design intelligence, informing how distributed design systems might evolve toward collective, adaptive, and ecologically attuned modes of fabrication.</p>",
      "index": 41
    },
    {
      "id": "Braumann, J. et al. 2012",
      "Theme": "Phygital Practices",
      "category": "Primary",
      "author": "Braumann, J.; Cokcan, S. B.",
      "title": "Digital and Physical Tools for Industrial Robots in Architecture: Robotic Interaction and Interfaces",
      "year": 2012,
      "publisher": "International Journal of Architectural Computing;10(4):541–54",
      "URL": "https://doi.org/10.1260/1478-0771.10.4.541",
      "Description": "<p>Braumann and Brell-Cokcan’s “Digital and Physical Tools for Industrial Robots in Architecture: Robotic Interaction and Interfaces” (2012) presents a pivotal exploration into the democratization of robotic fabrication through accessible digital-physical interfaces. The authors position human–machine and machine–machine interaction as central to evolving design and production ecologies, showing how platforms like Grasshopper and Arduino enable architects and designers to directly program and customize robotic behaviour. This convergence of physical computing, open-source development, and architectural software marks a shift from static, unidirectional automation toward responsive and adaptive modes of making.</p><p>For our research, which investigates emergent post-anthropogenic design-to-fabrication practices and the potential of decentralized, symbiotic systems of production, Braumann and Brell-Cokcan’s work provides a crucial precedent. Their development of custom interfaces and end-effectors—bridging industrial robotics and creative experimentation—embodies the move from centralized, high-tech industry workflows to open, participatory modes of fabrication. The paper demonstrates how accessible prototyping and programming tools enable non-expert users to engage with complex kinematic systems, thereby decentralizing authorship and expanding the agency of design actors beyond traditional disciplinary and technological boundaries.</p><p>Moreover, the authors’ emphasis on bidirectional data flows and interactive feedback loops anticipates a more-than-human understanding of fabrication: one in which material, machine, and designer continuously negotiate outcomes in real time. This resonates with our inquiry into transcalar fabrication systems and non-standard tectonics, where digital ecologies and physical processes co-evolve across distributed networks. In this sense, Braumann and Brell-Cokcan’s work not only lowers the barrier between humans and robotic systems but also gestures toward a broader paradigm of open design symbiosis—an ecosystemic approach to fabrication that aligns with our pursuit of globally interlinked, adaptive, and ecologically responsive construction logics.</p>",
      "index": 42
    },
    {
      "id": "Mumford, L. 1959",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Primary",
      "author": "Mumford, L.",
      "title": "An Appraisal of Lewis Mumford ’ s “ Technics and Civilization ” (1934)",
      "year": 1959,
      "publisher": "Daedalus, Curr Work Controv. 1959;88(3):527-536",
      "URL": "http://www.jstor.org/stable/20026520",
      "Description": "<p>Lewis Mumford’s “An Appraisal of Technics and Civilization” (1959) revisits his seminal 1934 work with both humility and critical distance, offering a self-assessment that remains deeply relevant to our research. In this retrospective, Mumford reinforces his central thesis that technology and civilization are not autonomous systems but co-evolving expressions of human intention, shaped by cultural, psychological, and ecological forces rather than by economic determinism alone. This view aligns with our concern for re-situating design and fabrication within relational, non-anthropocentric frameworks, where material and technical systems are integrated with wider ecological processes rather than instrumentalized as mere tools of production.</p><p>Mumford’s emphasis on the “internalization of the external world” and the “externalization of the internal world”—his early articulation of the feedback between human consciousness and the material environment—anticipates post-anthropogenic notions of symbiosis and distributed agency in contemporary design thinking. His critique of the “machine age” as a regime of depersonalized regimentation speaks to our effort to decentralize technological authorship through open, participatory design ecologies. Furthermore, Mumford’s overlooked distinction between the dynamic “masculine” machine and the passive “feminine” container resonates metaphorically with our inquiry into non-standard tectonics, where containment, transformation, and metabolic continuity become design values.</p><p>Despite its historical distance, Mumford’s reflection foregrounds the need for a humanistic yet ecological reorientation of technics—what he termed an “assimilation of the machine.” For our work, this suggests a framework in which technological systems evolve not toward domination or efficiency, but toward coexistence, adaptability, and care. Technics and Civilization, through this 1959 appraisal, thus remains an essential reference for understanding how technological paradigms might transition from anthropocentric mastery to global symbiosis.</p>",
      "index": 43
    },
    {
      "id": "Schon, D. 1984",
      "Theme": "Phygital Practices",
      "category": "Primary",
      "author": "Schon, D. A.",
      "title": " The Reflective Practitioner: How Professionals Think in Action.",
      "year": 1984,
      "publisher": " Basic Books",
      "URL": null,
      "Description": "<p>Donald Schön’s The Reflective Practitioner: How Professionals Think in Action (1984) offers a critical framework for understanding the cognitive and experiential dimensions of professional practice—one that resonates deeply with the evolving landscape of computational and post-anthropogenic design. Schön’s central notion of reflection-in-action—the capacity to think critically within the process of making—illuminates how designers engage dynamically with digital tools, materials, and emergent systems. In our research, this perspective provides a valuable lens through which to examine the entangled relationships between human and non-human agencies in design-to-fabrication workflows.</p><p>In computational design, especially within decentralized and open design ecologies, the act of “designing” extends beyond human intention to include algorithmic processes, machine learning models, and robotic fabrication systems. Schön’s emphasis on knowing-in-action—the tacit, embodied knowledge that emerges through engagement—can be reinterpreted here as a hybrid reflective practice occurring between designer and machine. Reflection is no longer confined to the human practitioner but distributed across computational feedback loops, simulation environments, and responsive material systems.</p><p>Furthermore, Schön’s critique of “technical rationality”—the belief that professional knowledge can be fully codified into rules or procedures—anticipates current tensions in computational design between automation and authorship. Our research aligns with Schön’s argument that complex, indeterminate problems demand improvisation and reflexivity rather than deterministic algorithms. Within transcalar fabrication systems, this translates to iterative prototyping, real-time adaptation, and the co-evolution of design intent and material behavior.</p><p>Ultimately, The Reflective Practitioner underscores the necessity of cultivating a reflective ethos within technologically mediated design practices. It encourages a mode of operation that remains critical, adaptive, and responsive—qualities essential to advancing a more symbiotic and decentralized approach to global fabrication ecologies.</p>",
      "index": 44
    },
    {
      "id": "Sennett, R. 2009",
      "Theme": "Phygital Practices",
      "category": "Primary",
      "author": "Sennett, R.",
      "title": " The Craftsman",
      "year": 2009,
      "publisher": "Penguin",
      "URL": null,
      "Description": "<p>Richard Sennett’s The Craftsman (2009) offers valuable conceptual grounding for our research by framing craftsmanship not as a nostalgic return to pre-industrial making, but as an enduring mode of thought and engagement with material, process, and technology. Sennett redefines craft as an approach to making—one grounded in care, skill, and iterative dialogue with materials—rather than a fixed set of manual techniques. By emphasizing the cognitive and ethical dimensions of material practice, he provides a framework for reinterpreting digital and post-anthropogenic modes of fabrication as contemporary forms of craftsmanship.</p><p>Sennett’s analysis of the historical tension between hand and machine—tracing from Ruskin’s moral critique of industrialism to modern debates on automation—helps situate our research within a lineage that sees technology not as the negation of craft, but as its evolution. Rather than privileging the handmade as “pure,” Sennett argues for a middle ground: machines can extend and reflect the maker’s thinking, transforming technical processes into opportunities for reflection and refinement. This resonates with design-to-fabrication systems where algorithmic processes and robotic fabrication act as collaborators rather than mere tools.</p><p>Furthermore, Sennett’s discussion of authorship challenges the romantic notion of the solitary craftsman. He suggests that traditional craft isolates the maker from the collective potential of machinic and social networks. In contrast, contemporary distributed and open design ecologies—central to our research—enable a new form of collective craftsmanship, where knowledge and authorship are decentralized.</p><p>Finally, Sennett’s insistence on respecting material agency anticipates current discourses on non-human collaboration and symbiosis. His notion that the maker should “take advantage of material properties” rather than impose arbitrary form aligns with post-anthropogenic approaches that emphasize co-adaptive processes between material, tool, and environment. In this sense, The Craftsman becomes a critical lens through which to reconceptualize digital fabrication as an ethical, ecological, and epistemological continuation of the craft tradition.</p>",
      "index": 45
    },
    {
      "id": "Witt, A. 2010",
      "Theme": "Phygital Practices",
      "category": "Primary",
      "author": "Witt, A. J.",
      "title": "A Machine Epistemology in Architecture. Encapsulated Knowledge and the Instrumentation of Design",
      "year": 2010,
      "publisher": "Candide J Archit Knowl. 3(3):37-88.",
      "URL": null,
      "Description": "<p>Andrew J. Witt’s “A Machine Epistemology in Architecture: Encapsulated Knowledge and the Instrumentation of Design” (2010) examines how design knowledge becomes embedded—or encapsulated—within machines, tracing the epistemological consequences of this process for architectural practice. Witt distinguishes between design knowledge—the architect’s synthetic understanding of spatial, geometric, and material relationships—and instrumental knowledge, which concerns the operational logic of tools, software, and machines. In modern computational design, these two forms increasingly overlap as architects script, simulate, and fabricate through digital means, transforming abstract knowledge into executable procedures.</p><p>Witt situates this discussion historically, comparing digital design tools to 19th-century mechanical drawing devices that translated complex geometric knowledge into repeatable mechanical operations. Just as early geometric instruments enabled architects to construct complex forms without fully grasping the underlying mathematics, today’s computational systems encapsulate design intent within code and machine logic. For Witt, this encapsulation both expands and constrains architectural agency: while it amplifies the capacity to model and fabricate complex geometries, it also abstracts design processes, shifting expertise from conceptual to operational domains.</p><p>This text provides a critical framework for our research into post-anthropogenic design-to-fabrication practices by foregrounding the epistemic implications of machine-mediated design. Witt’s notion of encapsulated knowledge challenges the myth of the autonomous architect and repositions design as a distributed, machinic, and procedural intelligence. His exploration of the reciprocal relationship between design and instrumental knowledge aligns with our investigation of decentralized, open, and transcalar fabrication systems—where design authorship, technical agency, and material formation are co-produced through machinic ecologies. Witt’s historical and theoretical perspective thus grounds our inquiry into how computational and fabrication technologies reshape architectural knowledge toward more collective and symbiotic modes of practice.</p>",
      "index": 46
    },
    {
      "id": "Gramazio, F. et al. 2014",
      "Theme": "Phygital Practices",
      "category": "Primary",
      "author": "Gramazio, F.; Kohler, M.; Willmann, J.",
      "title": "The Robotic Touch: How Robots Change Architecture",
      "year": 2014,
      "publisher": null,
      "URL": null,
      "Description": "<p>This seminal volume documents nearly a decade of research from ETH Zurich’s Chair of Architecture and Digital Fabrication, exploring how robotic processes transform architectural production. Gramazio, Kohler, and Willmann position the robot not merely as a tool of precision, but as an active design agent capable of negotiating between digital data and material behavior. Through richly illustrated case studies—from brick-stacking robots to aerially assembled structures—the book frames robotics as a generative medium that redefines the boundaries between design, computation, and construction.</p><p>For our research, The Robotic Touch provides a foundational reference for understanding how design-to-fabrication processes can evolve beyond centralized, industrial paradigms. The projects demonstrate how feedback between material performance, algorithmic control, and robotic agency can lead to emergent, non-standard tectonics—an approach resonant with the search for adaptive, distributed design ecologies. Rather than prescribing fixed outcomes, the authors advocate for a system in which the logic of making becomes intertwined with the logic of design, anticipating forms of autonomy and cooperation that parallel broader post-anthropogenic perspectives.</p><p>While the book’s focus remains largely within the technological and experimental framework of academic research, its implications extend toward more decentralized and collaborative modes of production. It foregrounds the potential of robotic fabrication as an open platform for rethinking authorship, material responsibility, and the relationship between local resources and global knowledge exchange. In this sense, The Robotic Touch serves as both a historical benchmark and a methodological provocation—pointing toward design cultures where human, machine, and material agencies operate in negotiated symbiosis, a theme central to the ambitions of our research.</p>",
      "index": 47
    },
    {
      "id": "Larsson, M. et al. 2019",
      "Theme": "Phygital Practices",
      "category": "Primary",
      "author": "Larsson, M.; Yoshida, H.; Igarashi, T.",
      "title": "Human-in-the-loop Fabrication of 3D Surfaces with Natural Tree Branches",
      "year": 2019,
      "publisher": "SCF ’19: Proceedings of the 3rd Annual ACM Symposium on Computational Fabrication",
      "URL": "https://doi.org/10.1145/3328939.3329000",
      "Description": "<p>This paper explores a novel, semi-automated fabrication workflow that integrates human intuition with computational precision to construct 3D surfaces from irregular, naturally shaped tree branches. Larsson and colleagues address the underutilization of non-standard, curved wood — typically discarded as low-value biomass — by developing a human-in-the-loop digital fabrication system that allows these organic materials to participate in precision design processes. Through 3D scanning, algorithmic matching, and interactive feedback, the workflow aligns the natural geometries of tree branches to digitally defined target surfaces, forming reciprocal structures that distribute structural forces effectively.</p><p>The project’s core innovation lies in its negotiation between natural material irregularity and digital formal intent. Instead of forcing natural materials into industrial standardization, the system adapts computational design to accommodate their inherent variability. This aligns with our research’s interest in post-anthropogenic, decentralized design-to-fabrication paradigms — practices that prioritize co-agency between human, material, and technological actors. By embedding human sensory feedback (audio-visual guidance) within the fabrication loop, Larsson et al. advocate for a more inclusive and adaptable mode of making, one that reintroduces material tactility and craft-based intuition into the digital fabrication ecosystem.</p><p>From a broader ecological and socio-technical perspective, the work offers a micro-scale example of how localized, low-cost, and participatory fabrication systems can operate within larger design ecologies. It demonstrates how waste or low-value natural materials can be computationally revalorized, suggesting pathways toward more circular, symbiotic design practices. While the system’s economic efficiency remains limited, its cultural and aesthetic implications underscore a shift toward value systems that privilege locality, material intelligence, and distributed craftsmanship — key trajectories relevant to our exploration of post-industrial, globally networked yet contextually rooted design ecologies.</p>",
      "index": 48
    },
    {
      "id": "Vazquez, A. et al. 2016",
      "Theme": "Phygital Practices",
      "category": "Selected",
      "author": "Vazquez, A. N.; Jabi, W.",
      "title": "RAF | A framework for symbiotic agencies in robotic – aided fabrication",
      "year": 2016,
      "publisher": "Charrette, Volume 4, Number 1, Spring 2017, Pp 58-73(16)",
      "URL": "http://orca.cf.ac.uk/125334/",
      "Description": "<p>In RAF: A Framework for Symbiotic Agencies in Robotic-Aided Fabrication (2016), Alicia Nahmad Vázquez and Wassim Jabi propose a paradigm shift in digital fabrication, reframing robots not as tools of automated execution but as co-agents within a dynamic, feedback-rich design ecology. Their framework challenges inherited industrial hierarchies—where designers conceive, machines execute, and materials passively comply—by redistributing agency across humans, robots, and matter during fabrication.</p><p>RAF centers on the idea of symbiotic agency: real-time, bidirectional exchanges among computational models, robotic behaviors, and material responses. Rather than treating fabrication as the fixed realization of a predetermined digital form, RAF situates making as an unfolding negotiation. Sensors, adaptive robotic routines, and live material feedback enable the robotic system to adjust paths, respond to contingencies, and influence design intent as fabrication occurs. This “phygital” environment dissolves the boundary between digital simulation and physical performance: emergence happens materially, not just computationally.</p><p>Conceptually, RAF synthesizes two dominant post-digital trajectories. From agent-based design research, it inherits the logic of encoded environments—rule-based systems that generate form through behavioral interaction. From fabrication-oriented approaches, it adopts the insistence on material reciprocity—recognition that matter itself participates in shaping outcomes. RAF fuses these into a continuous ecology where virtual and physical agents co-evolve.</p><p>By proposing a framework in which autonomy, adaptation, and intelligibility operate across both code and material, Vázquez and Jabi articulate a model of post-digital authorship rooted in collaboration rather than control. RAF thus reframes robotic fabrication as an environment of shared decision-making, expanding design beyond representation toward a materially enacted, symbiotic emergence.</p>",
      "index": 49
    },
    {
      "id": "Gannon, M. 2018",
      "Theme": "Phygital Practices",
      "category": "Primary",
      "author": "Gannon, M.",
      "title": "Human-centered Interfaces for Autonomous Fabrication Machines (Doctoral dissertation)",
      "year": 2018,
      "publisher": "Carnegie Mellon University",
      "URL": null,
      "Description": "<p>Gannon’s dissertation explores how human-centered interaction design can redefine relationships between people and intelligent fabrication systems, offering critical insights for our research into decentralized and symbiotic design-to-fabrication practices. Gannon situates his inquiry within the historical continuum of automation — from mid-twentieth-century computer-controlled manufacturing to the current emergence of autonomous, sensing, and learning-based machines. While earlier automation primarily emphasized efficiency, precision, and industrial scalability, Gannon proposes a paradigm shift toward collaborative autonomy, where machines augment rather than replace human creativity.</p><p>Through a series of design experiments — including Reverb, Tactum, ExoSkin, and Mimus — Gannon develops progressively complex interactions between humans and intelligent fabrication systems. These prototypes exemplify how contextual awareness, embodied interfaces, and real-time feedback can make machines “attentive” collaborators. Rather than treating the machine as an opaque, pre-programmed tool, his work reframes it as a cohabitant actor within the design process. This methodological stance resonates with our research’s pursuit of distributed, post-anthropocentric fabrication ecologies, in which agency is shared across human and nonhuman actors.</p><p>Importantly, Gannon’s adoption of cybernetic principles — prioritizing feedback, emergence, and responsiveness over top-down artificial intelligence — provides a conceptual bridge to more-than-human systems thinking. By using fabrication machines as proxies for future intelligent environments, the dissertation underscores the ethical and experiential stakes of designing with autonomy, not merely for it.</p><p>For our research, Gannon’s contribution lies in demonstrating that the interface itself can serve as a site of negotiation between human intention, material intelligence, and machine agency. His work encourages a move from optimization-driven automation toward participatory, adaptive, and ecologically attuned fabrication practices — a critical step toward envisioning design systems grounded in mutualism and global symbiosis.</p>",
      "index": 50
    },
    {
      "id": "Braumann, J. et al. 2021",
      "Theme": "Phygital Practices",
      "category": "Primary",
      "author": "Braumann, J.; Singline, K.",
      "title": "Towards Real-Time Interaction with Industrial Robots in the Creative Industries",
      "year": 2021,
      "publisher": "IEEE ICRA Conference",
      "URL": "https://doi.org/10.1109/icra48506.2021.9561024",
      "Description": "<p>Braumann and Singline’s “Towards Real-Time Interaction with Industrial Robots in the Creative Industries” (ICRA 2021) explores the technical and conceptual challenges of achieving interactive, near real-time robotic control within design-driven fabrication environments. The paper examines how visual, flow-based programming tools such as Grasshopper can be extended to enable dynamic feedback and responsive robotic behaviors — capabilities traditionally limited by acyclic dataflows and non-real-time operating systems. Three key approaches are presented: Ethernet KRL Interface (EKI), Robot Sensor Interface (RSI), and mxAutomation. Each approach negotiates between deterministic industrial protocols and the flexible, exploratory needs of creative practice.</p><p>For our research, this paper provides a crucial framework for understanding how interaction and feedback can transform robotic fabrication from static, toolpath-driven processes into adaptive, symbiotic systems. The authors’ integration of real-time control through middleware abstraction and accessible visual interfaces resonates strongly with our aim to decentralize and democratize design-to-fabrication workflows. Their emphasis on accessible, non-expert use of robotics aligns with our inquiry into distributed, open-source design ecologies, where complex fabrication processes can be reconfigured through local knowledge and adaptive, multi-scalar networks.</p><p>Conceptually, the paper bridges the technological infrastructure of industrial robotics with the performative, creative methodologies of the arts. It highlights how human–machine collaboration can evolve from preprogrammed automation toward co-creative engagement — a paradigm essential for our pursuit of post-anthropogenic design systems. By foregrounding latency, feedback, and control as not only technical but epistemic constraints, Braumann and Singline’s work situates real-time robotic interaction as a foundational step toward responsive, symbiotic fabrication ecologies that blur distinctions between designer, tool, and material agency.</p>",
      "index": 51
    },
    {
      "id": "Menges, A. et al. 2008",
      "Theme": "Phygital Practices",
      "category": "Primary",
      "author": "Menges, A.; Hengel, M.",
      "title": "Inclusive Performance: Efficiency Versus Effectiveness Towards a Morpho-Ecological Approach for Design",
      "year": 2008,
      "publisher": "Architectural Design, Volume 78, Issue 2 pp. 54-63",
      "URL": "https://doi.org/10.1002/ad.642",
      "Description": "<p>This article by Michael Hensel and Achim Menges presents the Morpho-Ecological approach, which reframes architectural performance beyond the traditional pursuit of efficiency toward a more systemic and context-sensitive notion of effectiveness. The authors critique the modernist and technocratic reduction of performance to single-parameter optimisation—often privileging minimal material use or energy savings—and instead propose a framework that integrates material behaviour, fabrication logics, environmental responsiveness, and morphogenetic processes. This approach positions design as an open system of reciprocal relations between material, environmental, and computational agencies.</p><p>For our research, this text offers a critical foundation for understanding how material systems can be conceived as generative and adaptive, rather than prescriptive or representational. The Morpho-Ecological framework resonates with the ambition to move towards decentralized, non-anthropocentric design methodologies that foster symbiotic relationships between built and ecological systems. By privileging effectiveness—the capacity of a system to negotiate multiple criteria and emergent behaviors—over efficiency, Hensel and Menges outline a mode of design that embraces heterogeneity, feedback, and environmental modulation as intrinsic design parameters.</p><p>Their discussion of integral computational frameworks, where analysis and generation operate in tandem, aligns with our research’s interest in transcalar and distributed fabrication practices. The article underscores the potential of computation not merely as a representational tool but as an operative medium for embedding local constraints and performative behaviours into design and fabrication systems. Ultimately, this work provides theoretical and methodological grounding for exploring design-to-fabrication practices that are materially aware, ecologically entangled, and performatively open—key premises for advancing post-anthropogenic design ecologies.</p>",
      "index": 52
    },
    {
      "id": "Gulay, E. et al. 2019",
      "Theme": "Phygital Practices",
      "category": "Primary",
      "author": "Gulay, E.; Lucero, A.",
      "title": "Integrated Workflows: Generating Feedback Between Digital and Physical Realms",
      "year": 2019,
      "publisher": "CHI Conference Proceedings [Internet]. https://doi.org/10.1145/3290605.3300290 ",
      "URL": "https://doi.org/10.1145/3290605.3300290",
      "Description": "<p>Gulay and Lucero address the persistent gap between digital and physical realms in architectural design. Despite advances in parametric modeling and digital fabrication, most workflows remain linear: digital models are conceived through GUI-based interfaces, then materialized, with little feedback returning to inform design decisions. Their literature review examines this divide through four domains—digital transformation, physical model-making, digital fabrication and automation, and hybrid/tangible interaction—highlighting how current processes either over-rely on simulation or underutilize material intelligence.</p><p>The authors critique GUI-dominated paradigms that emulate material behavior without providing tactile or morphological feedback. Conversely, physical models offer irreplaceable sensory and spatial information that supports iterative cognition but are rarely integrated into computational environments. Hybrid approaches emerge as a response, aiming to create feedback-rich processes where digital and physical manipulations co-evolve.</p><p>Their central contribution is the “transitional method,” a cyclical workflow in which physical improvisation, digital translation (via scanning and algorithmic manipulation), physical refinement, and fabrication continuously inform one another. Demonstrated through a plywood bending project, this method foregrounds iterative feedback, embodied engagement, and material agency as primary drivers of form-finding, rather than treating fabrication as a terminal step.</p><p>For our research, this paper offers both conceptual and methodological grounding for rethinking design-to-fabrication as a distributed, ecological process. The transitional method aligns with the aim of developing decentralized, open design ecologies that draw on local material realities and designer intuition alongside algorithmic systems. It also gestures toward post-anthropogenic modes of practice by decentering human authorship and acknowledging materials and machines as active participants in form generation. Gulay and Lucero thus provide a critical bridge between HCI, architectural theory, and emergent tectonic practices.</p>",
      "index": 53
    },
    {
      "id": "Hughes, F. 2014",
      "Theme": "Computational Exploration",
      "category": "Primary",
      "author": "Hughes, F.",
      "title": "The Architecture of Error: Matter, Measure, and the Misadventures of Precision",
      "year": 2014,
      "publisher": "MIT Press",
      "URL": null,
      "Description": "<p>Francesca Hughes’s The Architecture of Error: Matter, Measure, and the Misadventures of Precision (2014) has generated significant critical discussion around architecture’s relationship to precision and error. One analysis frames Hughes’s thesis through the lens of contemporary digital production, imagining a scenario in which digital precision grants architects unprecedented control—eliminating human error, material unpredictability, and the limitations of manual construction. Projects such as Zaha Hadid Architects’ Dongdaemun Design Plaza, composed of over 45,000 unique CNC-fabricated panels, are cited as evidence of this technical capacity to overcome what Hughes describes as the “burden of error” in architectural production.</p><p>A central issue highlighted in this reading is design fidelity: the relationship between digital concepts and their materialized outcomes. In many construction contexts, deviations between the two are inevitable and typically framed as errors. This interpretation of Hughes’s critique questions such negative framings, proposing that these deviations could instead be understood as productive differences. Building on Hughes’s identification of architecture’s “fear of error,” it suggests that error might function as an active and generative category—technically, intellectually, or both—within contemporary practice.</p><p>This analytical perspective aligns closely with our research, which seeks to reconsider the role of error within design-to-fabrication workflows. Rather than treating deviations as failures to be eliminated through tighter control, this view positions them as potential sites of innovation, negotiation, and material agency. By reconfiguring error as integral rather than supplementary, it invites a critical reassessment of precision’s role in architecture and opens space for more adaptive, materially engaged modes of practice. Hughes’s work, as interpreted through this lens, provides a crucial theoretical foundation for challenging architecture’s reliance on standardized, reproductive infrastructures and exploring alternative relationships between digital tools and material realities.</p>",
      "index": 54
    },
    {
      "id": "Ball, P. 2004",
      "Theme": "Computational Exploration",
      "category": "Primary",
      "author": "Ball, P.",
      "title": "Critical Mass: How One Thing Leads to Another",
      "year": 2004,
      "publisher": "Farrar, Straus and Giroux",
      "URL": null,
      "Description": "<p>Philip Ball’s Critical Mass: How One Thing Leads to Another (2004) offers a compelling framework for understanding how complex social and material systems give rise to emergent collective behaviors without centralized control. Drawing on statistical physics, complexity theory, and historical social science, Ball argues that while individual actions are unpredictable, aggregated behaviors exhibit regularities akin to physical systems approaching critical thresholds. Once a “critical mass” is reached, local interactions can generate large-scale transformations—much like phase transitions in matter.</p><p>This perspective resonates strongly with our research, which explores decentralized design-to-fabrication processes and the possibility of bottom-up tectonic organizations. Ball’s notion of emergent order suggests that architectural systems need not rely on top-down authorship to produce coherent, adaptive structures. Instead, distributed interactions—between agents, machines, materials, and communities—can yield organized, complex forms once a certain density or intensity of interaction is achieved. This provides a conceptual lens for rethinking fabrication not as the linear execution of a centralized design, but as the activation of collective behaviors within a design ecology.</p><p>Moreover, Ball’s critique of reductionist social models parallels a growing critique within architectural computation: deterministic control over matter and process often fails to account for nonlinear feedback loops and material agency. His emphasis on statistical regularities and self-organization supports the idea that fabrication systems can be structured to facilitate emergent outcomes rather than predetermine them. In transcalar fabrication contexts, this means designing protocols and interfaces that allow local interactions to scale up into global patterns, much like the phenomena Ball describes. Ultimately, Critical Mass offers both theoretical grounding and methodological inspiration for developing post-anthropocentric, adaptive fabrication frameworks that operate through distributed intelligence and emergent order rather than centralized control.</p>",
      "index": 55
    },
    {
      "id": "Oxman, N. 2012",
      "Theme": "Symbiotic Material Ecologies",
      "category": "Primary",
      "author": "Oxman, N.",
      "title": "Programming Matter",
      "year": 2012,
      "publisher": "Architectural Design [Internet]. 1;82(2):88–95",
      "URL": "https://doi.org/10.1002/ad.1384",
      "Description": "<p>Neri Oxman’s “Programming Matter” articulates a paradigmatic shift from geometry-driven form-making towards material-informed, performative design logics. She critiques both the modernist separation of form, structure, and material, and its digital counterpart—the division of modelling, analysis, and fabrication—which has entrenched a reliance on predefined, homogeneous material libraries. In contrast, Oxman draws inspiration from nature’s capacity to integrate structure and function through local variations in material properties, proposing the concept of “programmable matter” as a design and fabrication strategy. Central to this vision is the notion of anisotropy—directional dependency in material properties—found across biological systems such as feathers, seeds, and sponges. These examples reveal how structural and functional roles emerge through differentiated internal organization rather than discrete components.</p><p>Technically, Oxman’s work at the Mediated Matter Group explores functionally graded digital fabrication through multi-material extrusion using robotic platforms. By dynamically mixing materials during deposition, variable-density concrete and variable-elasticity polymers are fabricated as continuous gradients. This approach enables formal expression to arise directly from spatially distributed material performance, aligning fabrication with environmental and structural logics rather than imposing them post hoc.</p><p>For our research, Oxman’s framework offers a critical precedent for rethinking the design-to-fabrication continuum beyond geometric description and discrete material assignment. By treating matter as an active design substrate, her work gestures toward more ecologically attuned fabrication practices—where gradients, heterogeneity, and performance are embedded at the material level. While her approach is technologically intensive and centralized, its conceptual implications resonate with our interest in post-anthropogenic, open design ecologies: it reframes fabrication not as the end of design but as an ongoing, materially intelligent process. This emphasis on programming material behavior rather than shaping static forms provides a compelling theoretical and technical ground for advancing non-standard tectonics.</p>",
      "index": 56
    },
    {
      "id": "Zhou, J. et al. 2021",
      "Theme": "Symbiotic Material Ecologies",
      "category": "Primary",
      "author": "Zhou, J.; Barati, B.; Wu, J.; Scherer, D.; Karana, E.",
      "title": "Digital biofabrication to realize the potentials of plant roots for product design",
      "year": 2021,
      "publisher": "Bio-Design and Manufacturing, 4(1), 111-122",
      "URL": "https://doi.org/10.1007/s42242-020-00088-2",
      "Description": "<p>This paper investigates the potentials of plant roots as agents of digital biofabrication for product design, situating roots alongside mycelium and silkworms as biological collaborators in hybrid material practices. Unlike scaffolding-based approaches—such as Klarenbeek’s Mycelium Chair or MIT’s Silk Pavilion—where organisms are contained within pre-fabricated structures, the research focuses on the intrinsic “glue-ability” of plant roots to bind and consolidate porous elements into stable 3D forms. Through a material-driven design methodology, the authors systematically explore the affordances of roots by experimenting with growth media, barriers, and artificial gravity, documenting how roots adaptively twist, coil, and anchor themselves in response to environmental stimuli. The experiments culminated in a proof-of-concept stool fabricated from 600 parametrically designed, porous PLA beads that were collectively bound by oat roots, demonstrating a functional, load-bearing composite material.</p><p>The paper’s key contribution lies in mapping root behaviour to computationally optimizable design parameters, providing a taxonomy of variables—ranging from growing conditions to material structures—that expands the design space for root-based fabrication. The research frames roots not as passive growth systems but as intelligent, adaptive agents capable of constructing complex and robust composites when paired with digitally designed scaffolds. Importantly, the study highlights both the unpredictability and the promise of working with living matter, suggesting the need for mathematical models to predict growth patterns and for future explorations of living, interactive systems where roots remain alive and responsive.</p><p>By positioning plant roots as active participants in material formation, the work challenges conventional boundaries between the natural and the artificial, proposing biofabrication strategies that merge computational design with biological intelligence. This approach opens pathways for sustainable, symbiotic material practices while raising critical questions about control, agency, and collaboration in hybrid digital–biological fabrication systems.</p>",
      "index": 57
    },
    {
      "id": "Ramsgaard Thomsen, M. et al. 2022",
      "Theme": "Symbiotic Material Ecologies",
      "category": "Primary",
      "author": "Ramsgaard Thomsen, M.; Tamke, M.",
      "title": "Towards a transformational eco-metabolistic bio-based design framework in architecture",
      "year": 2022,
      "publisher": "Bioinspiration & Biomimetics, 17(4), 045005",
      "URL": "https://doi.org/10.1088/1748-3190/ac62e2",
      "Description": "<p>Mette Ramsgaard Thomsen and Martin Tamke’s paper Towards a Transformational Eco-Metabolistic Bio-based Design Framework in Architecture (2022) proposes a paradigm shift in architectural practice by positioning bio-based materials not as simple substitutes for geosphere-derived materials, but as catalysts for rethinking representation, design, and fabrication. The authors argue that architectural culture has long been structured around permanence and stability, privileging homogeneity and durability in material choices. Bio-based materials, in contrast, are inherently heterogeneous, temporal, and transformative, demanding new representational frameworks that account for their embedded lifespans and dynamic behaviors.</p><p>The paper distinguishes between three classes of bio-based materials—harvested, designed, and living—and associates them respectively with heterogeneity, behaving, and living performance. For harvested materials such as timber, the challenge lies in capturing and instrumentalizing natural variability. Designed materials, like bio-polymers, exhibit volatility and temporality, which the authors argue should be embraced as design parameters rather than treated as shortcomings. Living materials, such as mycelium or bacteria, open up an entirely new frontier in architecture, raising questions of cohabitation, temporalized representation, and interspecies symbiosis.</p><p>A significant contribution of this work lies in its critique of architectural representation. Current frameworks—such as BIM or facility management models—are ill-equipped to handle material transformation and are predicated on the illusion of permanence. Thomsen and Tamke propose instead an “eco-metabolistic” model in which representations persistently correlate with the life cycles, transformations, and performances of materials, extending design agency beyond completion into habitation and decay.</p><p>This research resonates with wider debates on post-anthropocentric design, situating architecture as a mediator of ecological processes rather than a consumer of inert resources. It challenges optimization-driven approaches and instead advocates for frameworks that accept uncertainty, variability, and temporality as central design drivers. By reframing bio-based materials as metabolically active, the paper opens pathways toward a genuinely regenerative architectural practice grounded in ecological entanglement.</p>",
      "index": 58
    },
    {
      "id": "López‐Durán, F. et al. 2010",
      "Theme": "Symbiotic Material Ecologies",
      "category": "Primary",
      "author": "López‐Durán, F.; Moore, N.",
      "title": "(Ut)opiates: Rethinking Nature",
      "year": 2010,
      "publisher": "Architectural Design [Internet]. 1;80(6):44–9",
      "URL": "https://doi.org/10.1002/ad.1161",
      "Description": "<p>In “(Ut)opiates: Rethinking Nature,” Fabiola López-Durán and Nikki Moore interrogate the foundations of contemporary sustainability discourse in architecture, exposing its indebtedness to premodern, Romantic notions of nature as harmonious and self-balancing. They argue that the dominant paradigm of “green architecture” often rests on an assumption of equilibrium between humans and their environments, overlooking evolutionary biology’s understanding of adaptation as a process driven by struggle, antagonism, and deformation rather than balance. The authors trace a historical lineage from Buffon and Lamarck through Darwin, situating “milieu” as a shifting concept that migrates from physics and natural history into sociology, geography, urbanism, and architecture. In doing so, they foreground how the environment has been consistently constructed as a “field of intervention” in which not only plants and animals but humans themselves become subjects of manipulation.</p><p>Central to their critique is the entanglement of architectural modernism with Lamarckian eugenics, particularly through Le Corbusier’s engagement with Alexis Carrel’s eugenicist vision of remaking society by reshaping its environment. López-Durán and Moore show how architecture became an instrument in a broader project of normative modernization, aligning the built domain with regulatory systems of population management. Sustainability, in this light, emerges less as a neutral or restorative practice than as an ideological tool that naturalizes populations, resources, and environments under the guise of ecological balance.</p><p>This reframing challenges the often-celebrated idealism of sustainable design by exposing its complicity with histories of control and exclusion. By positioning sustainability as both utopian promise and mechanism of governance, the essay pushes architecture to rethink its role: not as a guarantor of balance, but as a site where antagonisms, diversities, and resistances must be engaged rather than suppressed. For contemporary debates, the text highlights the necessity of moving beyond sustainability as managerial control and toward practices that acknowledge conflict, difference, and the political dimensions of ecological design.</p>",
      "index": 59
    },
    {
      "id": "Watson, J. 2019",
      "Theme": "Symbiotic Material Ecologies",
      "category": "Primary",
      "author": "Watson, J.",
      "title": "Lo-TEK: Design by Radical Indigenism",
      "year": 2019,
      "publisher": null,
      "URL": null,
      "Description": "<p>Julia Watson’s Lo—TEK: Design by Radical Indigenism (2019) positions indigenous and vernacular ecological knowledge as complex design technologies, challenging the dominant techno-centric narrative of progress that often equates innovation with high-tech, industrialized solutions. By reframing Traditional Ecological Knowledge (TEK) as technology, Watson situates practices such as living root bridges, floating farms, and water temples not as relics of pre-modernity but as living infrastructures of resilience, deeply integrated with ecosystems and cultural cosmologies. This repositioning disrupts the binary between the “primitive” and the “advanced,” foregrounding an epistemology where technology is ecological, place-based, and culturally encoded.</p><p>In relation to design-to-fabrication discourses, Lo—TEK opens critical ground for rethinking how fabrication can be aligned with ecological systems across scales. Watson’s emphasis on low-tech, distributed practices resonates with ideas of decentralization and the search for alternatives to resource-intensive, centralized modes of production. Where digital fabrication often valorizes precision, control, and novelty, Lo—TEK advocates for adaptive systems tested over centuries, embedding complexity through material entanglement with climate, terrain, and biodiversity. This contrast challenges design researchers to consider hybrid trajectories: high-tech workflows informed by indigenous low-tech paradigms, where resilience is derived not only from computational optimization but also from cultural symbiosis with nonhuman systems.</p><p>At the same time, Watson’s work is not without limitations. While it powerfully revalorizes indigenous knowledge, its presentation risks romanticization, and the translatability of such practices into contemporary urbanized contexts remains contested. Yet for research exploring post-anthropogenic design ecologies and transcalar fabrication, the book provides a critical counterpoint: it suggests that truly global symbiosis may lie in negotiating between high-tech speculative futures and deeply situated ancestral practices. Lo—TEK thus serves as both a theoretical provocation and a repertoire of alternative strategies, reminding design scholarship that ecological intelligence is not newly invented but rediscovered through attention to radical indigenism.</p>",
      "index": 60
    },
    {
      "id": "Cojocaru, A. et al. 2021",
      "Theme": "Symbiotic Material Ecologies",
      "category": "Primary",
      "author": "Cojocaru, A.; Isopescu, D. N.",
      "title": "Passive Strategies of Vernacular Architecture for Energy Efficiency",
      "year": 2021,
      "publisher": "Buletinul Institutului Politehnic “Gheorghe Asachi” Din Iaşi;67(2):33–44",
      "URL": "https://doi.org/10.2478/bipca-2021-0013",
      "Description": "<p>Cojocaru and Isopescu’s article Passive Strategies of Vernacular Architecture for Energy Efficiency (2021) revisits the role of climate-responsive design principles embedded in traditional building practices, situating them as precursors to contemporary sustainable architecture. The authors frame vernacular strategies not as nostalgic relics but as accumulated ecological intelligence, offering principles that remain relevant for today’s environmental and energy crises. Drawing on Rapoport’s notion of balance between nature, livelihood, culture, and security, as well as Rudofsky’s documentation of global vernacular forms, the article highlights how passive strategies—such as orientation, shading, ventilation, thermal mass, earth-sheltering, and courtyards—were historically deployed to secure comfort before mechanical systems existed.</p><p>The strength of the paper lies in its systematic classification of passive strategies into cooling and heating techniques and its clear linkage to energy efficiency targets such as near Zero-Energy Buildings (nZEB). Its review of case studies, from Iranian wind towers and Japanese thatched roofs to Greek whitewashed dwellings, underscores the cultural specificity of passive strategies while demonstrating their universal adaptability. By emphasizing architectural geometry, site orientation, and materiality, the paper frames vernacular design as inherently integrative of environmental, social, and aesthetic dimensions.</p><p>However, the article remains primarily descriptive, presenting strategies and precedents without deeply engaging with the challenges of translating these lessons into contemporary urban and technological contexts. While it acknowledges the limitations of vernacular forms in meeting modern expectations of comfort, it does not critically address how passive strategies might be hybridized with digital design tools, advanced materials, or decentralized modes of fabrication.</p><p>For research into design-to-fabrication ecologies and post-anthropogenic frameworks, the article provides a valuable foundation in pre-industrial climatic intelligence. Its relevance lies less in its methodology than in its conceptual reminder: sustainability is not solely a technological pursuit but also a cultural and ecological continuity, where rediscovery of past wisdom can inform future-oriented innovation.</p>",
      "index": 61
    },
    {
      "id": "Calixto, V. et al. 2024",
      "Theme": "Decentralized Governance & Commons",
      "category": "Selected",
      "author": "Calixto, V.; Croffi, J.",
      "title": "Back to Black Boxes? An Urgent Call for Discussing the Impacts of the Emergent AI-Driven Tools in the Architecture Design Education",
      "year": 2024,
      "publisher": "Proceedings of CAADRIA [Internet];3:39–48",
      "URL": "https://doi.org/10.52842/conf.caadria.2024.3.039",
      "Description": "<p>Victor Calixto and Croffi’s Back to Black Boxes? (2024) interrogates the growing opacity of contemporary computational design environments, arguing that the post-digital condition—once celebrated for its democratizing potential—has instead re-centralized power within increasingly inaccessible infrastructures. Their essay critiques the cultural assumption that seamlessness equals progress: as interfaces become smoother and AI systems more autonomous, the underlying processes become harder to inspect, question, or meaningfully intervene in. What digital fabrication originally promised—a collapse of the divide between conception and execution—has quietly reversed. Users manipulate results without understanding methods, echoing Simone Weil’s warning that alienation emerges whenever comprehension is withheld.</p><p>Calixto and Croffi situate this opacity historically. While early digital tools foregrounded procedural logic and invited participation in the mechanics of computation, today’s platforms foreground convenience, optimization, and “frictionless” workflows. Designers increasingly operate as consumers of algorithmic outputs rather than co-authors of computational processes. The black box, once a critique of industrial automation, resurfaces as a defining feature of AI-driven design.</p><p>Yet the authors do not call for abandoning abstraction. Instead, they advocate for legible abstraction: tools that expose their internal reasoning, allow users to trace causal pathways, and support interpretability over mere efficiency. They argue that the future of the post-digital hinges on designing epistemic environments where agency is shared, intelligibility is preserved, and computational power remains participatory rather than proprietary. Their critique thus reframes the post-digital not as a technological stage but as an ethical responsibility: to ensure that digital tools expand, rather than erode, the capacity to understand and act.</p>",
      "index": 62
    },
    {
      "id": "Leach, N. 2016",
      "Theme": "Decentralized Governance & Commons",
      "category": "Primary",
      "author": "Leach, N.",
      "title": "The Culture of the Copy",
      "year": 2016,
      "publisher": "Architectural Design;86(5):126–33",
      "URL": "https://doi.org/10.1002/ad.2098",
      "Description": "<p>Neil Leach’s The Culture of the Copy (2016) revisits long-standing debates on originality, authenticity, and reproduction, situating them within contemporary conditions of digital technologies. Drawing from Benjamin, Baudrillard, Butler, Dawkins, and Bhabha, Leach argues that human culture is fundamentally built upon copying and imitation rather than on an elusive notion of originality. Where Benjamin saw the erosion of aura through mechanical reproduction, and Baudrillard declared the disappearance of the original itself in the age of simulation, Leach suggests that digital reproduction has further normalized copying to the point where replication is the very condition of cultural production.</p><p>Central to his argument is the idea that copying is not merely derivative but constitutive of culture. Dawkins’ concept of memes and Blackmore’s extension of memetics frame cultural evolution as a process of replication, while Butler positions identity itself as performative imitation. Similarly, swarm intelligence and market trends exemplify how collective behaviors emerge through iterative acts of mimicry. Architecture, too, is reread through this lens: styles, typologies, and design languages evolve less through singular originality than through incremental adaptation, repetition, and variation.</p><p>For design and fabrication practices, this challenges the privileging of originality as the ultimate value. Copying emerges as a generative process, capable of producing new hegemonies, destabilizing norms, or enabling collective forms of authorship. In contemporary digital culture—characterized by endless circulation, remixing, and replication—copying can even become a critical or subversive act, as Bhabha’s notion of mimicry highlights in its “almost the same, but not quite” dynamic.</p><p>In relation to architectural and design research, Leach’s work invites reconsideration of how practices of replication, whether through digital fabrication, open-source ecologies, or distributed design systems, may themselves form the foundation of innovation. Rather than being antithetical to creativity, copying—understood as iterative, networked, and collective—becomes a vital cultural and technological force.</p>",
      "index": 63
    },
    {
      "id": "Ng, P. 2025",
      "Theme": "Decentralized Governance & Commons",
      "category": "Selected",
      "author": "Ng, P.",
      "title": "Decentralise Indexing in Common Data Environments for Collective Actions in Urban Design: A Blockchain Proposal",
      "year": 2025,
      "publisher": null,
      "URL": null,
      "Description": "<p>Provides Ng’s Decentralised Indexing in Common Data Environments (2025) addresses a structural problem that becomes urgent in post-digital design: how to sustain distributed, intelligible, and participatory technological ecosystems once they scale beyond local labs or workshops. Ng argues that while digital fabrication, robotic-aided processes, and computational design have enabled new forms of co-authorship between humans, machines, and materials, these practices remain vulnerable to re-centralization. Proprietary platforms, opaque algorithms, and corporate data infrastructures risk absorbing open workflows into closed technical stacks. The challenge, therefore, is not only how to distribute tools, but how to distribute the ability to understand and govern technological processes.</p><p>Ng proposes decentralized indexing as a foundational architecture for Common Data Environments (CDEs). Rather than storing project information, authorship records, and fabrication data within a single authority, he introduces mechanisms for distributed tracing, verification, and governance. Through blockchain-inspired consensus models—such as his “Proof-of-Architectural-Work”—Ng enables contributions to be recorded immutably and transparently, ensuring that collective knowledge cannot be enclosed or monetized by intermediaries. These systems allow authorship to be legible across federated networks, support peer-to-peer validation of design and fabrication processes, and establish value frameworks based on participation, reputation, and shared stewardship rather than extraction.</p><p>Read within the broader evolution of post-digital thought, Ng provides the missing institutional layer. He shows how the distributed agencies theorized by Snooks, Crolla, and Vázquez & Jabi can scale without losing reciprocity or intelligibility. Ultimately, Ng reframes CDEs as political infrastructures: environments where the means of production remain public, traceable, and collectively cared for, enabling technological emancipation through durable forms of epistemic transparency.</p>",
      "index": 64
    },
    {
      "id": "Bingham‐Hall, J. 2017",
      "Theme": "Decentralized Governance & Commons",
      "category": "Primary",
      "author": "Bingham‐Hall, J.",
      "title": "Imagined community and networked hyperlocal publics",
      "year": 2017,
      "publisher": "Architectural Design [Internet]. 1;87(1):64–71",
      "URL": "https://doi.org/10.1002/ad.2133",
      "Description": "<p>John Bingham-Hall’s Imagined Community and Networked Hyperlocal Publics interrogates how communication technologies mediate collective identity, situating hyperlocal platforms such as blogs or Twitter networks within a long genealogy of public-making practices. Drawing on theorists including Arendt, Habermas, and Anderson, the text foregrounds the symbolic and phatic dimensions of communication, challenging an overly instrumentalist reading of digital media. For Bingham-Hall, hyperlocal publics are not reducible to their capacity for democratic action or data-driven planning but are crucial because they allow people to imagine belonging—through shared stories, mediated encounters, and symbolic affirmations of place.</p><p>The analysis stresses continuity: postal networks, coffeehouse debates, and digital neighbourhood blogs all show that mediated information has always structured civic life. By linking present-day digital publics to these historical precedents, Bingham-Hall resists the tech industry’s framing of platforms as purely disruptive. Instead, he emphasizes that publics emerge in the interplay of the immediate (face-to-face) and the mediated (texts, media infrastructures, symbolic markers), where symbolic gestures—such as reading the same neighbourhood blog—can carry more weight than rational discourse. Importantly, the hyperlocal public is distinct from “community”: it is loose, contingent, and conflictual, avoiding the “tyranny of community” identified by Sennett.</p><p>For research into decentralized open design and transcalar ecologies, this perspective highlights how publics form not only through material infrastructures but also through symbolic and narrative reinforcement. The creation of distributed design networks may depend less on technical protocols alone than on cultivating shared imaginaries and phatic exchanges that anchor abstract collaboration in a sense of situated belonging. Bingham-Hall’s critique thus offers a reminder that designing future socio-technical systems—whether urban or digital—requires attention to the affective and symbolic registers of communication that enable publics to cohere across scales.</p>",
      "index": 65
    },
    {
      "id": "Diamond, J. 2004",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Secondary",
      "author": "Diamond, J. M.",
      "title": "Collapse: How Societies Choose to Fail or Succeed",
      "year": 2004,
      "publisher": null,
      "URL": null,
      "Description": "<p>In Collapse, Jared Diamond examines the environmental and societal causes behind the decline of past civilizations—such as the Maya, the Anasazi, and the Norse in Greenland—and draws parallels to contemporary global challenges. Central to his argument is the interplay between ecological mismanagement, resource overexploitation, and social rigidity that prevents adaptation to environmental feedback. Diamond’s framework highlights how societies that fail to develop sustainable relationships with their environments tend to collapse, while those capable of self-correction through innovation, decentralization, and resilience tend to endure.</p><p>This work offers a compelling ecological lens through which to interrogate design and fabrication practices in the Anthropocene. Diamond’s notion of systemic collapse as a failure of feedback integration aligns with critical discussions in post-anthropogenic design, where the focus shifts from human-centered optimization toward interdependent and adaptive systems. His emphasis on local decision-making and contextual environmental awareness resonates with decentralized open design ecologies that reject monolithic industrial paradigms in favor of distributed, responsive, and participatory modes of production.</p><p>In relation to emerging transcalar design frameworks, Collapse underscores the risks of hierarchical, extractive systems that neglect the ecological and material consequences of fabrication. Diamond’s historical perspective acts as a cautionary narrative that contextualizes the urgency of developing symbiotic infrastructures capable of mediating between global and local scales. By framing sustainability not as a technological problem but as a systemic and cultural one, Diamond provides a foundation for rethinking fabrication as an ecological dialogue rather than a linear act of production. Ultimately, his analysis reinforces the necessity of adaptive, decentralized, and ecologically coherent design methodologies to prevent repeating the cyclical patterns of collapse that have defined past civilizations.</p>",
      "index": 66
    },
    {
      "id": "Say, J. B. 1803",
      "Theme": "Computational Exploration",
      "category": "Secondary",
      "author": "Say, J.B.",
      "title": "Traité d'économie politique",
      "year": 1803,
      "publisher": "Paris: Deterville",
      "URL": null,
      "Description": "<p>Jean-Baptiste Say’s Traité d’économie politique (1803) is a seminal document in the construction of modern capitalist rationality—an intellectual architecture that separated the economy from the environment and established the human-centered logic of production as the primary generator of value. Say’s influential assertion that natural resources possess no exchangeable value because they are “given by nature for free” encapsulates a profound epistemic error: the erasure of ecological labor from economic calculus. By assuming that “natural riches are inexhaustible” and therefore beyond the purview of economic science, Say inaugurated a tradition of thought that naturalized extraction, commodified production, and denied the finitude of material and energetic systems.</p><p>In the context of post-anthropogenic and symbiotic design research, Say’s work functions as a historical mirror reflecting the origins of our current ecological and systemic crises. His framework legitimized the industrial project’s disconnection between production and regeneration, reinforcing a linear understanding of material flows that underpins contemporary design-to-fabrication economies. This separation of human creativity from natural agency laid the ideological groundwork for standardization, scalability, and efficiency—qualities that have dominated architectural and industrial paradigms at the cost of resilience, locality, and reciprocity.</p><p>For a discourse aiming toward decentralized open design ecologies and transcalar symbiosis, Say’s treatise is a reminder of what must be unlearned. His writings embody the root of an anthropocentric fallacy—the belief that human ingenuity exists outside ecological limits. Revisiting Say thus becomes an act of critical archaeology: uncovering the moment when the “economic” became detached from the “ecological.” Understanding his legacy allows us to invert its assumptions—to treat nature not as an inexhaustible background, but as a co-designer and active participant in value creation. In this light, Say’s Traité is less a model to follow than a historical warning against the abstraction and disembodiment that still haunt modern design and fabrication systems.</p>",
      "index": 67
    },
    {
      "id": "Poincaré, H. 1890",
      "Theme": "Computational Exploration",
      "category": "Secondary",
      "author": "Poincaré, H.",
      "title": "Sur le problème des trois corps et les équations de la dynamique",
      "year": 1890,
      "publisher": null,
      "URL": null,
      "Description": "<p>Henri Poincaré’s Sur le problème des trois corps et les équations de la dynamique (1890) marks a decisive moment in the history of science, where determinism began to give way to complexity and unpredictability. Ostensibly a mathematical study on the stability of celestial bodies, the work inaugurated a new epistemological attitude toward systems governed by non-linear interactions. Poincaré demonstrated that even systems ruled by simple physical laws could evolve in ways that defied precise prediction—introducing the notion of sensitive dependence on initial conditions, the precursor to what would later be called chaos theory.</p><p>In the context of design and fabrication—especially within post-anthropogenic and decentralized frameworks—Poincaré’s contribution resonates as a foundational articulation of emergent order. His work reframed the idea of “solution” from a closed, static endpoint to an evolving, contingent negotiation between parameters. Rather than eliminating uncertainty, Poincaré’s mathematics revealed it as intrinsic to the generative fabric of nature. This perspective supports a design ethos where instability, adaptation, and feedback become productive principles rather than failures of control.</p><p>For computational design and distributed making practices, Poincaré’s insight translates into an appreciation of the indeterminate and relational nature of complex systems—whether physical, material, or social. Nonlinear interactions between agents (be they algorithms, materials, or collaborators) echo his dynamic systems, where local conditions continuously reshape global configurations. In a decentralized design ecology, such dynamics foreground processes of co-adaptation and negotiation over centralized authorship or deterministic outcomes.</p><p>Thus, Sur le problème des trois corps stands not merely as a mathematical milestone but as an early philosophical pivot toward complexity thinking. It anticipates the epistemic shift underpinning contemporary design methodologies that seek to engage the world not as an object to be controlled, but as an evolving field of interacting forces and mutual dependencies.</p>",
      "index": 68
    },
    {
      "id": "Prigogine, I. et al. 1984",
      "Theme": "Computational Exploration",
      "category": "Secondary",
      "author": "Prigogine, I.; Stengers, I.",
      "title": "Order Out of Chaos: Man’s New Dialogue with Nature",
      "year": 1984,
      "publisher": null,
      "URL": null,
      "Description": "<p>Ilya Prigogine and Isabelle Stengers’ Order Out of Chaos: Man’s New Dialogue with Nature (1984) is a landmark work that redefines how systems—physical, biological, and social—organize and evolve. Building on Prigogine’s research into dissipative structures, the book argues that far-from-equilibrium conditions are not signs of disorder but generative states through which new forms of order emerge. This reframing dismantles the classical scientific image of a deterministic, reversible universe and replaces it with a vision of nature as inherently dynamic, creative, and historical.</p><p>The relevance of Order Out of Chaos extends beyond thermodynamics into the philosophy of complexity and self-organization. It foregrounds instability as a necessary condition for innovation and transformation, emphasizing that openness to energy and information exchange enables systems to adapt and evolve rather than decay. In this sense, Prigogine and Stengers articulate a cosmology of becoming—one that dissolves the boundary between natural and artificial processes, suggesting that creativity is intrinsic to matter itself.</p><p>For design, fabrication, and ecological thought, this framework provides a profound conceptual foundation. It shifts the designer’s role from that of a controlling agent to a participant within dynamic, co-evolving systems. Instead of imposing form, design becomes a means of steering flows—material, energetic, informational—through feedback and reciprocity. The notion of dissipative structures offers a model for adaptive, decentralized, and resilient design strategies, where emergence replaces prediction and evolution supplants optimization.</p><p>Philosophically, Prigogine and Stengers’ dialogue with nature calls for an ethics of engagement rather than mastery. Their vision resonates with contemporary moves toward post-anthropocentric and symbiotic practices: systems in which human and nonhuman agents co-produce order through continual exchange. Order Out of Chaos thus stands as both a scientific and philosophical cornerstone for reimagining creativity, complexity, and collaboration across scales and species.</p>",
      "index": 69
    },
    {
      "id": "Reynolds, C. 1987",
      "Theme": "Computational Exploration",
      "category": "Secondary",
      "author": "Reynolds, C. W.",
      "title": "Flocks, Herds, and Schools: A Distributed Behavioral Model",
      "year": 1987,
      "publisher": "Computer Graphics;21(4):25–34",
      "URL": null,
      "Description": "<p>Craig W. Reynolds’ Flocks, Herds, and Schools: A Distributed Behavioral Model (1987) introduced “Boids,” a pioneering computer simulation demonstrating how complex collective motion can emerge from the interaction of simple local rules. Each agent, or “boid,” follows three principles—separation, alignment, and cohesion—producing the lifelike dynamics of bird flocks or fish schools without any central coordination. This model became a seminal contribution to the study of artificial life, computer graphics, and later, swarm robotics and distributed intelligence.</p><p>Reynolds’ work reframed the understanding of collective behavior by showing that order and coherence can arise spontaneously from decentralized interactions. The implication is profound: complexity need not be engineered from the top down, but can instead self-organize from minimal, relational constraints. His model became an early computational articulation of emergence—illustrating how local decision-making and environmental feedback generate global patterns of organization.</p><p>Within the broader intellectual landscape of design and systems theory, Flocks, Herds, and Schools exemplifies a paradigm shift from representation to behavior, from fixed form to adaptive process. It offers a framework for thinking about design as choreography rather than prescription—an orchestration of relations rather than the imposition of shape. This resonates with approaches that privilege distributed authorship, material agency, and multi-scalar coordination. The boid model’s emphasis on autonomy and responsiveness aligns with ecological and post-anthropocentric visions of design, where complexity is negotiated rather than imposed.</p><p>Reynolds’ simulation continues to influence architecture, fabrication, and digital art, offering a methodological and philosophical lens for exploring non-linear systems and participatory design. By revealing how collective intelligence can emerge without hierarchy, it challenges traditional notions of control and authorship. Flocks, Herds, and Schools thus stands as a foundational reference for any inquiry into distributed organization, adaptive systems, and the generative potential of cooperative interaction.</p>",
      "index": 70
    },
    {
      "id": "Deleuze, G. et al. 1987",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Secondary",
      "author": "Deleuze, G.; Guattari, F.",
      "title": "A Thousand Plateaus: Capitalism and Schizophrenia",
      "year": 1987,
      "publisher": null,
      "URL": null,
      "Description": "<p>Gilles Deleuze and Félix Guattari’s A Thousand Plateaus: Capitalism and Schizophrenia (1980) is a seminal text that dismantles hierarchical, linear models of thought and replaces them with dynamic, non-hierarchical, and relational systems of becoming. Through the concepts of the rhizome, assemblage, deterritorialization, and the smooth and the striated, Deleuze and Guattari articulate an ontology of multiplicity—one that privileges connection, transformation, and emergence over unity or form. Their philosophical project resists totalization and instead foregrounds networks of affect, matter, and energy as the basis for organization and creativity.</p><p>In architectural and design discourse, A Thousand Plateaus became an influential theoretical reservoir during the digital turn of the 1990s and 2000s. As Douglas Spencer notes, architecture often appropriated Deleuze and Guattari’s ideas with a bias toward their Bergsonian and Spinozist registers—celebrating fluidity, variation, and morphogenesis—while downplaying their Marxian critique of capital, control, and production. The concepts of the “fold,” “abstract machine,” and “smooth space” were translated into generative, topological, and algorithmic practices, giving rise to an aesthetic of continuous transformation that mirrored emerging computational tools. Yet, this selective adoption often neutralized the political and ethical dimensions of Deleuze and Guattari’s work, reducing their radical ontology to formalist experimentation.</p><p>Read more holistically, A Thousand Plateaus offers more than a vocabulary for digital morphogenesis—it proposes a philosophy of distributed agency and collective becoming. Its notion of the rhizome models decentralized organization; the abstract machine maps processes of articulation and deterritorialization that resonate with open, adaptive systems; and the smooth and striated articulate gradients of order, resistance, and negotiation. For contemporary design and fabrication thinking, Deleuze and Guattari’s text invites a re-engagement with complexity not as aesthetic spectacle but as socio-material process—where creativity operates through multiplicity, relationality, and the constant reconfiguration of forces across scales.</p>",
      "index": 71
    },
    {
      "id": "Lynn, G. 1993",
      "Theme": "Computational Exploration",
      "category": "Secondary",
      "author": "Lynn, G.",
      "title": "Folding in Architecture",
      "year": 1993,
      "publisher": null,
      "URL": null,
      "Description": "<p>Greg Lynn’s Folding in Architecture (1993) marks a pivotal moment in the convergence of philosophy, digital technology, and architectural theory during the 1990s. Drawing heavily on Gilles Deleuze’s notion of “the fold” from The Fold: Leibniz and the Baroque, Lynn reinterprets it as both a conceptual and material strategy for rethinking continuity, differentiation, and transformation in design. The “fold” becomes a way to transcend the rigid dichotomies of modernist form—inside/outside, structure/skin, figure/ground—replacing them with continuous topologies capable of accommodating complexity, fluidity, and multiplicity.</p><p>Lynn’s argument situates architecture within a post-Cartesian paradigm of dynamic systems, where geometry is not static representation but a generative process. The fold, in this sense, is not a metaphor but an operative diagram for designing relationships that are both continuous and heterogeneous. This framework coincided with the rise of computational design tools that enabled architects to simulate smooth transformations and gradients of curvature—forms that seemed to embody Deleuzean becoming. Folding in Architecture thus stands as a manifesto for the digital turn in architecture, where form generation and morphogenesis became central to discourse and practice.</p><p>However, the legacy of Lynn’s work extends beyond its stylistic influence. The folding paradigm introduced a new sensibility toward matter and information—an understanding that spatial and structural behavior could emerge from local conditions and dynamic interrelations. While later critiques (e.g., Spencer, 2011) have noted the depoliticization of Deleuzean thought within this movement, Lynn’s contribution remains foundational for opening architecture to computational, topological, and non-linear thinking.</p><p>In a broader theoretical context, Folding in Architecture articulates a shift from composition to modulation, from the discrete to the continuous, and from hierarchy to network. It exemplifies the moment when architecture began to conceive of form not as an object to be imposed, but as a process—an evolving negotiation between material, geometry, and force.</p>",
      "index": 72
    },
    {
      "id": "Lorenz, E. 1963",
      "Theme": "Computational Exploration",
      "category": "Secondary",
      "author": "Lorenz, E. N.",
      "title": "Deterministic Nonperiodic Flow",
      "year": 1963,
      "publisher": null,
      "URL": null,
      "Description": "<p>Edward N. Lorenz’s Deterministic Nonperiodic Flow (1963) is a foundational paper in chaos theory and nonlinear dynamics. Arising from Lorenz’s attempts to model atmospheric convection, the study revealed that even simple deterministic systems could produce behavior so sensitive to initial conditions that long-term prediction became impossible. This discovery—often illustrated by the “butterfly effect”—challenged the Newtonian view of a fully predictable universe and introduced the concept of deterministic chaos, where order and unpredictability coexist within the same system.</p><p>Lorenz’s insights transformed not only meteorology but also the broader scientific and philosophical understanding of complexity. By demonstrating that small perturbations could lead to vastly divergent outcomes, Deterministic Nonperiodic Flow recast stability and instability as interdependent rather than oppositional. The Lorenz attractor—a strange attractor that exhibits bounded yet non-repeating trajectories—became a metaphor for self-organization, emergence, and the inherent creativity of dynamic systems.</p><p>In the context of design and fabrication, Lorenz’s work provides a powerful framework for rethinking control, prediction, and emergence. It suggests that complex forms and behaviors can arise from iterative feedback and minimal rules rather than prescriptive design intent. This resonates with computational and generative practices where small variations in input or boundary conditions yield qualitatively new morphologies. Rather than suppressing uncertainty, designers can embrace it as a source of adaptive potential—a principle that aligns with ecological and distributed models of organization.</p><p>Philosophically, Lorenz’s paper embodies a shift from linear causality to relational dynamics, from command-and-control paradigms to open, self-regulating systems. It invites an epistemology attuned to sensitivity, interdependence, and transformation. Deterministic Nonperiodic Flow thus stands as a cornerstone of complexity thought—bridging physics, computation, and design theory in its recognition that creativity often emerges not from order imposed, but from instability sustained.</p>",
      "index": 73
    },
    {
      "id": "Turing, A. 1952",
      "Theme": "Computational Exploration",
      "category": "Secondary",
      "author": "Turing, A. M.",
      "title": "The Chemical Basis of Morphogenesis",
      "year": 1952,
      "publisher": null,
      "URL": null,
      "Description": "<p>Alan M. Turing’s The Chemical Basis of Morphogenesis (1952) is a groundbreaking work that bridges mathematics, biology, and the philosophy of form. In this paper, Turing proposed a reaction–diffusion model to explain how spatial patterns—such as stripes, spots, and spirals—emerge spontaneously in biological organisms from initially homogeneous conditions. Through simple equations describing the interaction of chemical substances (“morphogens”), Turing demonstrated how complex, ordered structures can arise from instability and feedback rather than genetic or external control.</p><p>This insight transformed the understanding of pattern formation, establishing one of the earliest mathematical models of emergence and self-organization. Turing’s morphogenetic theory anticipates later developments in nonlinear dynamics and complexity science, showing that life’s forms are not imposed from above but generated through local interactions and distributed processes. His model offered a scientific foundation for the idea that order is not antithetical to chaos but arises from it—a vision of creativity embedded in material and chemical processes.</p><p>In the context of design and fabrication, Turing’s work resonates deeply with approaches that seek to harness self-organizing systems, computational simulation, and material intelligence. The reaction–diffusion paradigm provides both a metaphor and a method for understanding how form can emerge through local cooperation and continuous differentiation. It underpins contemporary generative and bio-inspired design practices that aim to cultivate form through interaction rather than prescription.</p><p>Philosophically, The Chemical Basis of Morphogenesis repositions the designer—or the organism—as a participant in a broader ecology of processes. It invites an understanding of form-making as negotiation between forces, feedback loops, and matter’s own propensities. Turing’s contribution thus transcends biology: it is an epistemological shift toward thinking of design, growth, and structure as emergent, decentralized, and inherently dynamic—an early articulation of complexity as the generative principle of life and form.</p>",
      "index": 74
    },
    {
      "id": "Weaver, W. 1948",
      "Theme": "Computational Exploration",
      "category": "Secondary",
      "author": "Weaver, W.",
      "title": "Science and Complexity",
      "year": 1948,
      "publisher": null,
      "URL": null,
      "Description": "<p>Warren Weaver’s Science and Complexity (1948) is a pivotal essay that anticipates the emergence of complexity science and systems theory in the second half of the twentieth century. Writing in the immediate postwar period, Weaver identifies three historical stages in scientific inquiry: the study of “problems of simplicity,” characterized by linear causality and reductionism; “problems of disorganized complexity,” addressed statistically; and a new class of “problems of organized complexity,” which concern systems composed of many interacting parts whose collective behavior cannot be understood by analyzing components in isolation. This conceptual shift marked the birth of a holistic and relational paradigm for scientific thought.</p><p>Weaver’s articulation of organized complexity reframed the role of science—from isolating variables to understanding networks of interdependence. He argued that future progress depended on developing new tools and conceptual frameworks to study these intermediate, multi-variable systems that dominate biological, social, and ecological domains. His essay thus foreshadowed developments in cybernetics, information theory, and nonlinear dynamics, establishing an intellectual foundation for contemporary approaches to emergence, self-organization, and adaptive systems.</p><p>For design and fabrication, Weaver’s text offers a crucial epistemological transition: it invites thinking in terms of relationships, feedback, and distributed causality. It suggests that creativity and adaptation emerge not from centralized control but from the negotiation of interdependent agents and variables. This orientation toward systems thinking resonates with computational, ecological, and participatory design paradigms that embrace complexity as a productive, rather than obstructive, condition.</p><p>Philosophically, Science and Complexity embodies the moment when modern science began to recognize the limits of reductionism and the necessity of integrative, cross-disciplinary inquiry. Weaver’s call for new modes of reasoning across scales and disciplines remains strikingly contemporary—an enduring reminder that the future of knowledge and creation lies in understanding systems as living, evolving wholes rather than decomposable machines.</p>",
      "index": 75
    },
    {
      "id": "Jacobs, J. 1961",
      "Theme": "Decentralized Governance & Commons",
      "category": "Secondary",
      "author": "Jacobs, J.",
      "title": "The Death and Life of Great American Cities",
      "year": 1961,
      "publisher": null,
      "URL": null,
      "Description": "<p>Jane Jacobs’ The Death and Life of Great American Cities (1961) is a seminal critique of modernist urban planning and a foundational text for understanding cities as complex, self-organizing systems. Rejecting the rationalist, top-down visions of planners such as Le Corbusier, Jacobs argues that urban vitality arises from the dense, diverse, and spontaneous interactions of everyday life. Her observations of sidewalks, mixed uses, and small-scale diversity revealed that the city’s strength lies not in monumental order but in the intricate, adaptive fabric of social and spatial relationships that evolve organically over time.</p><p>Jacobs’ notion of “organized complexity” parallels the emergent systems later described by Warren Weaver and Ilya Prigogine: cities, like ecosystems, depend on feedback, interdependence, and continual negotiation between order and chaos. Her concept of the “sidewalk ballet” captures the choreography of decentralized interactions through which safety, cooperation, and innovation emerge without centralized design. This perspective transforms urbanism from an exercise in control to one of stewardship—cultivating conditions that allow life and adaptation to flourish.</p><p>In the context of design, Jacobs’ insights resonate with distributed and participatory models of creation. She implicitly advocates for a relational and ecological understanding of form-making, where local knowledge and iterative processes are valued over abstract formalism. Her critique of the “radiant” and “garden” city paradigms anticipates later critiques of technological and managerial utopias that disregard social complexity.</p><p>Philosophically, The Death and Life of Great American Cities represents a turning point in rethinking urbanism as a living system—a self-regulating ecology of interactions rather than a static machine. It foregrounds diversity, feedback, and adaptability as principles of resilience and creativity. Jacobs’ human-scaled systems thinking continues to inform not only urban design but broader inquiries into how decentralized, networked, and emergent structures sustain life and collective evolution.</p>",
      "index": 76
    },
    {
      "id": "Conway, J. 1970",
      "Theme": "Computational Exploration",
      "category": "Secondary",
      "author": "Conway, J. H.",
      "title": "The Game of Life",
      "year": 1970,
      "publisher": null,
      "URL": null,
      "Description": "<p>John H. Conway’s The Game of Life (1970) is a mathematical and computational experiment that became one of the most influential models of emergence and self-organization in the twentieth century. Conceived as a cellular automaton, the Game of Life operates on a grid of cells that live, die, or reproduce according to simple local rules. Despite its minimal algorithmic structure, the system generates unexpectedly rich and dynamic behaviors—patterns that move, replicate, and interact in ways reminiscent of biological or ecological processes. Conway’s model thus illustrates how complexity and apparent intelligence can emerge from simplicity, without central control or premeditated design.</p><p>The Game of Life offered a profound conceptual shift for understanding systems as generative rather than representational. It demonstrated that deterministic rules could produce open-ended, unpredictable phenomena, bridging mathematics, computation, and biology. This became a cornerstone for the study of artificial life and complexity science, inspiring thinkers such as Stephen Wolfram and influencing disciplines from ecology to architecture. It proposed that order and novelty are not opposites but products of recursive local interactions—an insight that continues to shape models of distributed intelligence and adaptive design.</p><p>In relation to design and fabrication, Conway’s automaton represents a foundational paradigm for generative systems thinking. It embodies a move away from top-down form-making toward bottom-up processes of differentiation, where global structure emerges through local feedback. Its logic parallels contemporary computational and material approaches that simulate growth, pattern formation, and collective behavior.</p><p>Philosophically, The Game of Life suggests a world where agency is distributed and creativity is emergent—a universe of becoming rather than control. It underscores a fundamental lesson for design and systems theory alike: that complexity, resilience, and beauty often arise not from hierarchical organization, but from the recursive play of simple relations evolving together through time.</p>",
      "index": 77
    },
    {
      "id": "Wolfram, S. 2002",
      "Theme": "Computational Exploration",
      "category": "Secondary",
      "author": "Wolfram, S.",
      "title": "A New Kind of Science",
      "year": 2002,
      "publisher": "Wolfram Media",
      "URL": null,
      "Description": "<p>Stephen Wolfram’s A New Kind of Science (2002) proposes a radical shift in how complexity is understood, modeled, and generated. Rejecting the dominance of traditional mathematical equations in describing natural phenomena, Wolfram turns to simple computational rules—especially cellular automata—as engines capable of producing extraordinary emergent complexity. His central claim is that simple, discrete programs can yield behaviors as intricate and unpredictable as those found in nature. This challenges the idea that complexity must arise from elaborate design intentions or top-down control; instead, it often emerges from bottom-up, rule-based interactions.</p><p>For design and fabrication, Wolfram’s framework offers a way to reconceptualize form generation, material behavior, and construction processes not as static outputs but as dynamic systems driven by local rules. Rather than imposing a singular, centralized vision, designers can set initial conditions and rule sets, then allow computational processes to unfold, producing unexpected yet coherent patterns. This resonates with contemporary approaches that seek to harness material agency, self-organization, and non-linear behaviors in design workflows.</p><p>Importantly, Wolfram emphasizes that many complex phenomena are computationally irreducible—they cannot be shortcut or fully predicted without actually running the process. This notion undermines the fantasy of total control in digital design, foregrounding instead the importance of feedback, iteration, and exploration. In a fabrication context, this suggests that design and making might be structured as adaptive, evolving systems rather than linear pipelines.</p><p>Finally, Wolfram’s insistence that the universe itself may operate as a vast cellular automaton reframes the relationship between natural and artificial systems: both can be understood through shared computational logics. This blurring invites designers to work with systems not merely as metaphors but as generative frameworks, positioning fabrication as a site where abstract rules meet material reality in unpredictable, emergent ways.</p>",
      "index": 78
    },
    {
      "id": "Jandrić, P. et al. 2018",
      "Theme": "Decentralized Governance & Commons",
      "category": "Secondary",
      "author": "Jandrić, P.; al., et",
      "title": "Postdigital Science and Education",
      "year": 2018,
      "publisher": "Educational Philosophy and Theory ",
      "URL": "https://doi.org/10.1080/00131857.2018.1454000",
      "Description": "<p>Postdigital Science and Education (Jandrić et al., ongoing since 2018) articulates a critical framework for understanding the contemporary condition in which digital technologies are no longer novel or external to human life but deeply embedded within social, cultural, biological, and material practices. Drawing on Nicholas Negroponte’s declaration that “the digital revolution is over,” the postdigital perspective reframes digital technologies as infrastructural and ubiquitous—like air or water—where their presence is felt most acutely in moments of failure or absence. This shift is not about abandoning the digital but recognizing that its transformative novelty has passed, giving way to hybrid entanglements of old and new media, analog and digital processes, and biological and informational systems.</p><p>The postdigital condition is characterized by messiness, paradox, and hybridity. It refuses clear-cut distinctions between “virtual” and “real,” emphasizing instead how digital technologies intertwine with embodied practices, sociomaterial environments, and existing cultural forms. In fields such as education, this is evident in the blending of formal and informal learning, the collapse of distinctions between online and offline spaces, and the ways networked devices infiltrate everyday pedagogical settings without deliberate institutional planning. These dynamics destabilize the assumption that technology acts as an external enhancement, instead positioning it as constitutive of contemporary knowledge ecologies.</p><p>Importantly, the postdigital turn also introduces critical perspectives on power and economics through concepts such as “bio-informational capitalism,” which captures the fusion of digital infrastructures with biological systems and data economies. This expands debates beyond technological determinism to include ethical, epistemic, and political questions surrounding algorithmic governance, digital inequality, and the commodification of knowledge.</p>",
      "index": 79
    },
    {
      "id": "Goidea, A. 2023",
      "Theme": "Symbiotic Material Ecologies",
      "category": "Secondary",
      "author": "Goidea, A.",
      "title": "Transcalar design: Biological principles in architecture through computational design and additive fabrication",
      "year": 2023,
      "publisher": "PhD Dissertation, Lund University",
      "URL": null,
      "Description": "<p>Ana Goidea’s doctoral thesis Transcalar Design: Biological Principles in Architecture through Computational Design and Additive Fabrication articulates transcalarity as a conceptual and methodological framework for rethinking architectural production. Positioned at the intersection of computational design, digital fabrication, and biodesign, the thesis explores how biological principles—such as distributed intelligence, material adaptation, and scalar interdependencies—can be meaningfully translated into architectural processes. Goidea argues that biological systems operate across scales in ways that yield performative, integrated, and resilient outcomes. This transcalar logic stands in contrast to the reductionist and standardized approaches of industrial modernism, which often suppress or ignore cross-scalar effects. Her work proposes that instead of simplifying complexity, designers can harness digital tools to mediate and design with scalar interdependencies.</p><p>The thesis unfolds through three design experiments—Pulp Faction, Meristem Wall, and Swarm Materialization—each acting as a laboratory for testing how generative computation and additive fabrication can operationalize transcalar principles. These projects foreground material exploration and the reciprocal relationship between digital modeling and physical prototyping. Goidea frames digital tools not merely as instruments of efficiency but as epistemic mediators capable of capturing, amplifying, and deploying the logic of natural systems. This methodological stance enables her to move beyond biomimicry towards a synthetic mode of design that actively integrates biological thinking within architectural processes.</p><p>Crucially, Goidea situates her research against the backdrop of the Anthropocene and the unsustainable material culture of contemporary construction. Rather than offering immediate market-ready solutions, the thesis proposes conceptual and methodological shifts, providing a foundation for future practices that are more attuned to environmental dynamics. By articulating transcalarity as both an analytical lens and a design driver, Goidea opens up new possibilities for systemic, materially intelligent architectures that operate across disciplinary and scalar boundaries.</p>",
      "index": 80
    },
    {
      "id": "Agarwala, N. et al. 2021",
      "Theme": "Decentralized Governance & Commons",
      "category": "Secondary",
      "author": "Agarwala, N.; Chaudhary, R. D.",
      "title": "‘Made in China 2025’: Poised for Success?",
      "year": 2021,
      "publisher": "India Quarterly [Internet];77(3):424–61",
      "URL": "https://doi.org/10.1177/09749284211027250",
      "Description": "<p>Agarwala and Chaudhary’s article offers a geopolitical and economic examination of Made in China 2025 (MIC25), China’s strategic industrial policy launched in 2015 to shift from a low-cost, export-oriented manufacturing model to one centered on technological innovation, domestic capacity building, and global competitiveness. The authors contextualize MIC25 as a response to structural economic stagnation following decades of rapid growth driven by cheap labor, foreign investment, and outsourced production. As China confronts the “middle-income trap,” the policy outlines transformations in three key areas—human capital, export structure, and productivity—mirroring the developmental trajectories historically followed by advanced economies.</p><p>A central contribution of the article lies in framing MIC25 not merely as an industrial upgrade program but as part of a broader national strategy for economic sovereignty and geopolitical positioning. By emulating Germany’s Industry 4.0, China aims to develop core technologies and intellectual property domestically, focusing on ten strategic sectors including robotics, aerospace, renewable energy, and advanced materials. This state-directed innovation model—heavily reliant on government support, policy incentives, and infrastructural investment—represents a deliberate move away from dependency on foreign technologies. Simultaneously, it challenges the global distribution of technological power, provoking protective reactions from the US and EU.</p><p>The article’s analysis foregrounds how technological policy functions as a lever for systemic transformation, intertwining economic restructuring with geopolitical ambitions. Importantly, MIC25 is presented as both a solution to internal economic pressures and a catalyst for reshaping global industrial networks. While the authors remain cautious about China’s ability to overcome entrenched technological dependencies amid external resistance, they highlight the coherence of MIC25 as a long-term strategy. This dual lens—internal developmental logic and external power dynamics—makes the article particularly useful for understanding how design, production, and technological frameworks can be mobilized at national scales to recalibrate global material and industrial ecologies.</p>",
      "index": 81
    },
    {
      "id": "Watts, D. et al. 1998",
      "Theme": "Decentralized Governance & Commons",
      "category": "Secondary",
      "author": "Watts, D. J.; Strogatz, S. H.",
      "title": "Collective dynamics of ‘small-world’ networks",
      "year": 1998,
      "publisher": "Nature [Internet]",
      "URL": "https://doi.org/10.1038/30918",
      "Description": "<p>Watts and Strogatz’s landmark paper introduces the concept of “small-world” networks, situated between regular and random graph topologies. Their model demonstrates that a small fraction of long-range connections within an otherwise locally clustered network drastically reduces average path length without significantly disrupting local cohesion. This simple but powerful insight has profound implications for understanding how information, resources, and behaviors circulate within interconnected systems—from social relations to infrastructural networks.</p><p>From a socio-economic perspective, the small-world model helps explain how localized, tightly knit communities can remain socially cohesive while participating in global flows. In the context of local economies, high clustering reflects strong neighborhood ties and shared practices, while a few “shortcuts”—analogous to trade links, digital platforms, or influential actors—can rapidly integrate these local systems into global circuits. This structure underlies the internet’s role in enabling decentralized but globally connected networks of production, communication, and innovation. For example, small design or fabrication collectives can retain local embeddedness while achieving global visibility and coordination through minimal but strategic online links.</p><p>In contrast to fully centralized systems, small-world networks do not require massive infrastructural or organizational overhauls to scale; marginal increases in connectivity yield disproportionately large effects on reach and synchronization. This has direct relevance for decentralized or distributed economies, where the challenge is often to maintain local autonomy while benefiting from global exchange. The small-world framework reveals how minimal infrastructural interventions—such as digital platforms, peer-to-peer protocols, or knowledge-sharing networks—can catalyze systemic transformation.</p><p>Finally, Watts and Strogatz show that small-world structures accelerate contagion and synchronization processes, offering both opportunities and risks in globally networked societies. Economically, ideas, technologies, or disruptions can propagate rapidly across loosely coupled but globally integrated networks. The paper thus provides a conceptual backbone for understanding contemporary globalization as a dynamic interplay between local clustering and sparse but powerful connective tissue.</p>",
      "index": 82
    },
    {
      "id": "Andréen, D. et al. 2022",
      "Theme": "Symbiotic Material Ecologies",
      "category": "Secondary",
      "author": "Andréen, D.; Goidea, A.",
      "title": "Principles of biological design as a model for biodesign and biofabrication in architecture",
      "year": 2022,
      "publisher": "Architecture. Structures. Construction, 2, pp. 481–491",
      "URL": "https://doi.org/10.1007/s44150-022-00049-6",
      "Description": "<p>This paper articulates a compelling framework for integrating biological principles into architectural biodesign and biofabrication. It distinguishes between biological design—the morphogenetic processes linking genotype to phenotype—and biodesign, which applies biological materials or approaches to human contexts. Rather than imitating biological forms superficially, the authors advocate learning from the processes that generate them, identifying four key principles to inform architectural practice: diversity, complexity and specificity, durability through resilience, and feedback and adaptation.</p><p>Diversity is positioned as an antidote to industrial standardization. By harnessing the transformative capabilities of biological organisms such as fungi, architecture can move away from homogenized materials toward a dynamic palette of locally sourced, heterogeneous resources. The discussion of fungal biotransformation foregrounds material processes that are adaptive, decentralized, and context-responsive. Similarly, the emphasis on complexity and specificity challenges architectural norms of linear dependency and uniformity. Biological systems fluidly integrate function across scales, using spatial differentiation rather than bulk material properties to achieve performance. This opens avenues for transcalar design methodologies, where form, material, and function are continuously negotiated.</p><p>The principles of durability through resilience and feedback and adaptation further position biological systems as models for non-static architectures. Resilience is framed not as resistance to change but as adaptive capacity, resonating with ecological definitions of complex adaptive systems. Feedback processes, exemplified by termite mounds or fungal growth, suggest construction logics that are procedural, agent-based, and temporally extended, rather than top-down and blueprint-driven. This implies a shift in the designer’s role—from formal author to programmer of relationships and behaviours—enabling buildings to evolve alongside their material and ecological contexts.</p><p>Ultimately, the paper proposes a paradigm where architecture is conceived as a living, adaptive, and materially embedded process, offering a robust conceptual bridge between biological morphogenesis and future biofabrication practices.</p>",
      "index": 83
    },
    {
      "id": "Goodbun, J. et al. 2012",
      "Theme": "Symbiotic Material Ecologies",
      "category": "Secondary",
      "author": "Goodbun, J.; Jaschke, K.",
      "title": "Architecture and relational Resources: towards a new Materialist practice",
      "year": 2012,
      "publisher": "Architectural Design [Internet]. 1;82(4):28–33",
      "URL": "https://doi.org/10.1002/ad.1424",
      "Description": "<p>Jon Goodbun and Karin Jaschke’s essay develops a critical framework for understanding material scarcity and architectural practice through the lens of new materialism. They argue that scarcity is not simply a question of commodity availability but the manifestation of extended spatial and temporal processes that entwine natural, social, and technological systems. Building materials are conceived not as inert resources but as active participants in complex metabolic networks stretching from extraction sites to construction, occupation, abandonment, and recycling. Against the linear, market-driven narratives of resource flow, they emphasize matter’s inherent activity and its entanglement with political, economic, and cognitive formations.</p><p>Drawing from Prigogine and Stengers’ notion of “the timing of space,” alongside thinkers such as Bennett, Morton, and Ingold, the authors call for a radical revision of the relationship between humans and matter—one that recognizes performative agency in non-human entities. This conceptual shift destabilizes the binary of nature and culture and reframes architectural practice as embedded in vibrant, contested networks of material and social actors. Examples such as Arcosanti, open-cast mining operations, and abandoned quarries underscore how architectural spaces are both products and ongoing participants in these wider ecologies.</p><p>Importantly, Goodbun and Jaschke highlight architecture’s potential role in this epistemic shift. Beyond technical solutions to resource depletion, they advocate for an affirmative and critical materialist practice that is attuned to metabolic processes and ethical responsibilities toward non-human worlds. This involves reconfiguring disciplinary boundaries, embracing urban political ecology, and experimenting with both digital fabrication and hands-on making. The text positions architecture not as a passive consumer of materials but as an active agent in reimagining material flows and relationships, suggesting a political and ecological reorientation of architectural practice.</p>",
      "index": 84
    },
    {
      "id": "Ramsgaard Thomsen, M. 2022",
      "Theme": "Symbiotic Material Ecologies",
      "category": "Secondary",
      "author": "Ramsgaard Thomsen, M. ",
      "title": "Computational design logics for bio‑based design",
      "year": 2022,
      "publisher": "Architectural Intelligence 1:13 ",
      "URL": "https://doi.org/10.1007/s44223-022-00015-8",
      "Description": "<p>Mette Ramsgaard Thomsen’s article critically examines the computational design field as a methodological bridge toward sustainable, regenerative, and bio-based material practices. She identifies three central contributions of computational design—advanced information modelling, functional grading, and integrated sensing—and explores how these can be reoriented to engage with the heterogeneous, behaving, and living characteristics of bio-based materials. Originally developed within the logic of industrialised building systems, these computational infrastructures are reframed as potential steppingstones for addressing the complexity and temporality of renewable material systems.</p><p>Advanced information modelling is discussed not merely as a prescriptive design tool but as a dynamic, multi-scalar feedback system that shifts architectural representation from “how things look” to “how things behave.” Functional grading is presented as a means to instrumentally steer heterogeneous material responses, challenging standardisation by treating materials as actively variable rather than fixed. Integrated sensing enables adaptive fabrication, where live data continuously informs both material characterisation and fabrication control, supporting non-linear, cyclical workflows that replace industrial linearity.</p><p>Thomsen’s key intervention lies in transferring these computational methods to a bio-based paradigm. She identifies three transformative dimensions: characterising heterogeneity to move beyond standardised classification systems; capturing dynamic responses to design in time rather than for permanence; and designing with living materials, where growth and environmental interaction are integrated into the design chain. This framework situates architecture within metabolistic cycles of growth and decay, challenging the ideal of static, enduring buildings and foregrounding maintenance and adaptation as integral design concerns.</p><p>Overall, the article articulates a rigorous theoretical and methodological foundation for rethinking computational design in an ecological age, positioning digital practices as essential instruments in transitioning architecture toward renewable, regenerative, and temporally dynamic material systems.</p>",
      "index": 85
    },
    {
      "id": "Imhof, B. et al. 2015",
      "Theme": "Symbiotic Material Ecologies",
      "category": "Secondary",
      "author": "Imhof, B.; Gruber, P.",
      "title": "Built to grow: Blending Architecture and Biology",
      "year": 2015,
      "publisher": "Birkhaüser",
      "URL": null,
      "Description": "<p>This volume is a cornerstone in the discourse on bio-integrated architecture, documenting the interdisciplinary research project Growing As Building (GrAB). It interrogates how biological principles—growth, adaptation, self-organization, resilience—can be operationalized within architectural design and fabrication. Rather than using biology as metaphor, the editors advocate for direct engagement with living processes, positioning architecture as an active participant in ecological and technological systems. The book combines theoretical essays, a glossary of life-related concepts, and detailed accounts of biolab experiments involving slime molds, mycelium composites, hydrogels, and metabolic systems. These investigations challenge architecture’s static paradigm, proposing dynamic, evolving structures capable of negotiating environmental conditions and resource cycles.</p><p>A key conceptual thread is the transition from the Anthropocene to what Rachel Armstrong terms the “Ecocene,” where design augments planetary ecosystems rather than depleting them. This shift resonates with post-anthropogenic agendas, emphasizing co-creation among biological, computational, and human agents. Practical explorations include DIY biofabrication, mobile cable-driven 3D printers, and semi-closed metabolic loops integrating algae and calcium carbonate—anticipating decentralized, adaptive fabrication ecologies. Ethical considerations such as agency, risk, and negotiated symbiosis permeate the discourse, framing design as a relational practice rather than a deterministic act.</p><p>While many proposals remain speculative, the book’s strength lies in its systemic approach and experimental rigor. It offers conceptual frameworks and technical precedents for non-standard tectonics, transcalar fabrication, and open design systems. For research concerned with global symbiosis and distributed design ecologies, Built to Grow provides a provocative lens through which architecture can evolve beyond anthropocentric constraints, embracing uncertainty, emergence, and ecological reciprocity as design drivers.</p>",
      "index": 86
    },
    {
      "id": "Wigley, M. 1993",
      "Theme": "Decentralized Governance & Commons",
      "category": "Secondary",
      "author": "Wigley, M. A.",
      "title": "The Architecture of Deconstruction: Derrida’s Haunt",
      "year": 1993,
      "publisher": "MIT Press",
      "URL": null,
      "Description": "<p>Mark Wigley’s The Architecture of Deconstruction: Derrida’s Haunt (1993) situates architectural theory within the linguistic and philosophical terrain of deconstruction, proposing that architecture, far from being a purely material or structural practice, is haunted by the very conceptual binaries it seeks to stabilize—presence/absence, structure/ornament, inside/outside. Wigley interprets Derrida’s thought not as an external critique of architecture, but as one that emerges from within it. Architecture, in this reading, becomes a discursive field where meaning is continuously deferred, its tectonics inherently textual and interpretative.</p><p>In relation to post-anthropogenic design-to-fabrication practices, Wigley’s exploration of “haunting” can be reinterpreted as an early critique of human-centered authorship and control. His deconstructive lens exposes how architectural intention is never autonomous—it is conditioned by systems of representation, language, and technological mediation. This perspective resonates with contemporary computational and decentralized design approaches that challenge the architect’s singular agency. Just as deconstruction disperses the authority of the author, post-human and open design ecologies disperse authorship across human and non-human agents, algorithms, and material systems.</p><p>Moreover, Wigley’s notion of the “supplement”—the excess or remainder that destabilizes the architectural whole—prefigures the generative indeterminacy of digital and material computation, where emergent behaviors, fabrication tolerances, and feedback loops become integral rather than peripheral. In this sense, the “haunt” can be reimagined as the spectral presence of matter, data, and ecology within design: forces that exceed the designer’s intent yet structure the outcome.</p><p>Ultimately, The Architecture of Deconstruction offers a critical foundation for understanding contemporary shifts from anthropocentric authorship to distributed, systemic forms of making. It situates architecture as an open, interpretive practice—one that must reckon with the ghosts of its own assumptions about control, authorship, and meaning—precisely the questions that underpin emergent post-anthropogenic, transcalar, and symbiotic design frameworks.</p>",
      "index": 87
    },
    {
      "id": "Sweet, K. 2015",
      "Theme": "Phygital Practices",
      "category": "Secondary",
      "author": "Sweet, K.",
      "title": "ROBOTIC WORKFLOW An Architectural Pedagogical Approach",
      "year": 2015,
      "publisher": "CAADRIA ",
      "URL": "https://doi.org/10.52842/conf.caadria.2015.519",
      "Description": "<p>Kevin Sweet’s Robotic Workflow: An Architectural Pedagogical Approach (2015) offers a foundational framework for understanding how robotic fabrication reshapes architectural education and design cognition. Rather than positioning robotics merely as an advanced tool for production, Sweet frames it as an epistemological shift — one that demands a multi-layered understanding of systems, feedback loops, and recursive learning between physical and digital domains. His pedagogical model unfolds through sequential modules that move from physical modeling to digital simulation, and finally to robotic fabrication, reflecting an iterative “design-to-fabrication” continuum where material behavior, computational logic, and machine agency co-evolve.</p><p>Central to Sweet’s argument is the cultivation of parametric thinking — not as software proficiency, but as an ontological attitude toward relationships, variability, and emergence. By engaging students first with tangible assemblies, he grounds computation in material experience, allowing digital simulation to emerge as an abstraction of physical phenomena rather than its replacement. This inversion destabilizes the hierarchy between design intent and fabrication execution, revealing architecture as a cyber-physical negotiation rather than a linear pipeline. In this sense, Sweet’s approach resonates with the notion of digital materiality advanced by Gramazio and Kohler, where the digital and material orders are not oppositional but symbiotic, co-defining the expressive and performative dimensions of architecture.</p><p>Sweet’s pedagogical strategy also anticipates broader discussions on decentralization and distributed authorship within digital fabrication. The robot, framed as both tool and collaborator, embodies a post-anthropocentric agency — one that repositions the human designer as a participant within a network of interdependent systems. The iterative reciprocity between code, toolpath, and material echoes the systemic logic of ecological interrelation. Thus, Robotic Workflow provides more than a didactic model: it articulates an early, practice-based vision of how architecture can evolve toward systemic thinking and collaborative intelligence across scales — a crucial step toward reimagining design as a multi-agent, symbiotic process.</p>",
      "index": 88
    },
    {
      "id": "Walter-Herrmann, J. et al. 2014",
      "Theme": "Decentralized Governance & Commons",
      "category": "Secondary",
      "author": "Walter-Herrmann, J.; Büching, C.",
      "title": "Fablab: Of Machines, Makers and Inventors",
      "year": 2014,
      "publisher": "Transcript Verlag",
      "URL": null,
      "Description": "<p>This edited volume offers a critical and multifaceted exploration of the Fab Lab movement, tracing its origins, socio-technical structures, and cultural implications in relation to open-source fabrication and the democratization of production. The editors and contributors situate Fab Labs as nodes within a broader transformation of design and manufacturing — one that decentralizes material production and redefines relationships between humans, machines, and knowledge. The book’s discourse extends beyond the practical realm of digital fabrication to engage with epistemological and social shifts, positioning Fab Labs as experimental grounds for new forms of agency, authorship, and collective intelligence.</p><p>In relation to post-anthropogenic and decentralized design paradigms, Fablab provides an early framework for understanding distributed material practices that operate outside industrial hierarchies. Its examination of local production and open design communities foregrounds the potential for globally networked yet contextually grounded fabrication systems — an idea resonant with transcalar approaches to design ecologies. The contributors recognize Fab Labs not merely as technological infrastructures but as socio-material assemblages that mediate between high-tech and low-tech cultures, enabling hybrid modes of making that challenge centralized production logics.</p><p>However, the text also exposes certain contradictions: the tension between ideals of openness and the proprietary nature of many digital fabrication tools, as well as the uneven accessibility of such technologies across global contexts. These issues highlight the limits of the Fab Lab model as a universal template for distributed design, emphasizing the need for more ecologically and culturally responsive systems of fabrication. Within a broader discourse on global symbiosis, Fablab thus serves as both a foundational reference and a critical point of departure — illustrating the aspirations and shortcomings of early maker infrastructures in realizing equitable, post-humanist fabrication networks.</p>",
      "index": 89
    },
    {
      "id": "Bechthold, M. 2014",
      "Theme": "Phygital Practices",
      "category": "Secondary",
      "author": "Bechthold, M.",
      "title": "Design Robotics: A New Paradigm in Process-Based Design",
      "year": 2014,
      "publisher": "Oxman, R. & Oxman, R. (eds.) Theories of the Digital in Architecture. New York; London, Routledge, Taylor & Francis Group",
      "URL": null,
      "Description": "<p>Martin Bechthold’s chapter articulates a pivotal shift in architectural production from form-driven to process-based design thinking, positioning robotic fabrication as a catalyst for reconfiguring design intelligence and material practice. By examining how robotic systems enable iterative feedback between digital models, material behavior, and fabrication constraints, Bechthold reframes robotics not as mere automation but as an epistemological tool that reshapes how architects engage with material processes. The text advances a discourse where design and making become inseparable, emphasizing performativity, adaptability, and the negotiation between computational precision and material agency.</p><p>In a broader theoretical sense, Bechthold’s notion of “design robotics” suggests a paradigm that transcends deterministic digital fabrication by embedding agency within the process itself. His emphasis on feedback loops — between design intent, robotic control, and material response — anticipates later discussions on post-anthropogenic modes of authorship, where human and non-human actants collaborate in open-ended systems. The chapter thus contributes to an understanding of robotic fabrication as a distributed intelligence network, rather than a centralized, human-controlled toolchain.</p><p>While Bechthold’s argument is grounded in academic and institutional research contexts, it also reveals implicit tensions between the technological sophistication of robotic systems and their accessibility or ecological viability. The paradigm he outlines remains largely situated within high-tech infrastructures, raising questions about scalability and inclusion in decentralized or low-tech environments. Nevertheless, his framework remains foundational for any discussion of adaptive, multi-scalar, and feedback-oriented fabrication systems. Design Robotics therefore stands as a critical reference in understanding how robotic agency reshapes design culture — not only in terms of efficiency or precision, but as an epistemic transformation in how architecture conceptualizes making, matter, and collaboration across human and machinic domains.</p>",
      "index": 90
    },
    {
      "id": "Fuller, R. 1963",
      "Theme": "Decentralized Governance & Commons",
      "category": "Secondary",
      "author": "Fuller, R. B.",
      "title": "Utopia or Oblivion The Prospects for Humanity",
      "year": 1963,
      "publisher": "New York: Bantam Books.",
      "URL": null,
      "Description": "<p>In Utopia or Oblivion, R. Buckminster Fuller articulates a technocratic yet deeply ecological vision of planetary stewardship, presenting technology as a means through which humanity might transcend its destructive tendencies and achieve global equilibrium. The book’s collection of essays oscillates between optimism and existential urgency, framing the evolution of design and engineering as integral to humanity’s survival. Fuller’s concept of “comprehensive anticipatory design science” envisions a systemic intelligence that integrates technology, resource management, and ethics to sustain the planet — a framework that positions design as a moral and planetary act rather than a purely aesthetic or functional endeavor.</p><p>Fuller’s thinking foregrounds a transscalar understanding of design, where the smallest technological artifact is implicated in the global ecological system. His proposals for geodesic structures and resource-efficient production prefigure contemporary discourses on sustainable and circular economies, as well as distributed fabrication. He advocates for a shift from ownership-based to knowledge-based economies — a notion resonant with later movements in open-source design and decentralized innovation. Importantly, Fuller’s technological optimism challenges the dichotomy between nature and machine, arguing instead for a symbiotic relationship in which human ingenuity operates in alignment with natural laws.</p><p>However, the text also embodies a distinctly modernist belief in design as salvation, revealing a tension between systemic foresight and techno-utopian determinism. While Fuller’s vision is profoundly ecological, it presumes a universalist human agency that risks overlooking the socio-political asymmetries inherent in technological adoption. Yet, his holistic approach remains invaluable in framing contemporary post-anthropogenic design debates — those seeking to move beyond human-centered paradigms toward planetary and multi-agent ecologies. Utopia or Oblivion thus endures as both a prophetic manifesto and a cautionary meditation on design’s potential to mediate between survival and collapse at the scale of the Earth itself.</p>",
      "index": 91
    },
    {
      "id": "Sharma, S. 2020",
      "Theme": "Symbiotic Material Ecologies",
      "category": "Secondary",
      "author": "Sharma, S.",
      "title": "Designing the organism-environment relationship",
      "year": 2020,
      "publisher": "PhD Dissertation, MIT ",
      "URL": "https://hdl.handle.net/1721.1/127499",
      "Description": "<p>Sharma’s dissertation presents a profound rethinking of the relationship between living systems and design, offering an integrated framework termed Organism–Environment Design that seeks to treat both organism and environment with equal ontological and operational importance. Positioned at the intersection of biology, design, and systems theory, the work moves beyond metaphorical engagements with life to propose a rigorous methodology that unites scientific observation, experimental prototyping, and design speculation. Central to this framework is the Representative Environment Analogue (REA) — a physical and conceptual model that enables the study and co-design of living systems within controllable, yet dynamic, contexts. Through the development of Generative Microscopy, Sharma reconceives observational tools as instruments of creation, transforming microscopy from a passive imaging technique into an active, generative mode of design inquiry.</p><p>The thesis unfolds through a rich taxonomy of projects that operate across scales — from molecular to ecological — emphasizing dynamism, nonlinearity, and uncertainty as intrinsic properties of life. By embracing rather than eliminating uncertainty, Sharma positions unpredictability as a creative driver in design, challenging the reductionist and control-oriented paradigms inherited from modern scientific traditions. Her work bridges quantitative and qualitative methods, proposing a nonlinear design loop that mirrors biological complexity and allows for reciprocal feedback between experiment and theory.</p><p>In a broader conceptual sense, Designing the Organism–Environment Relationship resonates with post-anthropocentric approaches to design, wherein agency is distributed across human and non-human participants. Sharma’s framework dissolves disciplinary boundaries between science, design, and ecology, inviting an ethical and procedural redefinition of biodesign as a symbiotic practice rather than one of domination or control. The dissertation thus stands as a seminal contribution to the evolution of design research — one that reframes life not as a material to be manipulated, but as a collaborator in the unfolding of new ecological and epistemic possibilities.</p>",
      "index": 92
    },
    {
      "id": "Mitchell, T. 2011",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Secondary",
      "author": "Mitchell, T.",
      "title": "Carbon Democracy: Political Power in the Age of Oil",
      "year": 2011,
      "publisher": "Verso",
      "URL": null,
      "Description": "<p>Timothy Mitchell’s Carbon Democracy offers a groundbreaking political and historical analysis of how energy infrastructures — particularly those based on coal and oil — have shaped the development and distribution of democratic power. He argues that the material characteristics of energy systems determine the forms of political organization that emerge around them. Coal, with its labor-intensive extraction and reliance on localized transport networks, enabled organized labor movements to leverage collective power, giving rise to mass democratic politics. In contrast, oil’s fluidity, centralization, and global reach reconfigured these power relations, facilitating new mechanisms of control and insulating political systems from popular influence.</p><p>Mitchell’s central contribution lies in revealing the deep entanglement between material energy regimes, geopolitical economies, and the architecture of governance. By tracing the infrastructural logic of carbon-based economies, he exposes how the apparent autonomy of political systems is in fact contingent upon the physical and logistical properties of energy flows. His analysis challenges conventional narratives that treat democracy as an abstract or purely ideological construct, instead framing it as a material consequence of industrial organization and resource management.</p><p>Viewed more broadly, Carbon Democracy offers critical insight into the ecological and political underpinnings of contemporary design and production systems. It underscores how technological and infrastructural choices embed political agency and ecological dependency, suggesting that shifts toward renewable or decentralized systems entail not only environmental transformations but also profound political realignments. Mitchell’s emphasis on material politics resonates with discussions of post-anthropogenic or distributed agency, in which human and non-human forces are interwoven within planetary systems of power and production. The book remains essential for understanding how design and fabrication practices are inseparable from the energy ecologies that sustain them — and how reimagining those ecologies requires a parallel rethinking of democracy, autonomy, and collective agency.</p>",
      "index": 93
    },
    {
      "id": "Asimov, I. 1951",
      "Theme": "Decentralized Governance & Commons",
      "category": "Secondary",
      "author": "Asimov, I.",
      "title": "Foundation",
      "year": 1951,
      "publisher": null,
      "URL": null,
      "Description": "<p>Isaac Asimov’s Foundation inaugurates one of the most influential science fiction series of the twentieth century, centering on the concept of psychohistory — a speculative science that merges mathematics, sociology, and history to predict the collective behavior of large populations. Conceived by the mathematician Hari Seldon, psychohistory embodies a paradoxical vision: it seeks to impose rational predictability upon the chaos of human civilization. Through this fictional discipline, Asimov constructs a universe in which the future of societies can be statistically modeled and manipulated, transforming social processes into a kind of algorithmic material.</p><p>Psychohistory functions as both a metaphor and critique of technocratic rationality. It imagines the total quantification of human behavior, reducing culture, politics, and emotion to probabilistic functions — a gesture that simultaneously reveals the allure and danger of control through knowledge. The Foundation itself becomes a socio-technical project designed to preserve human progress amid galactic decline, exemplifying how predictive modeling might serve as an instrument of governance, stabilization, and continuity. Yet, Asimov also acknowledges the fragility of such systems: the appearance of the unpredictable “Mule” — an anomaly that disrupts the statistical model — exposes the limits of determinism and the persistence of contingency within complex systems.</p><p>From a contemporary perspective, psychohistory prefigures debates surrounding algorithmic prediction, data-driven governance, and systems theory — where the attempt to map and anticipate human and environmental behavior raises ethical and epistemological questions about agency, uncertainty, and control. The novel thus resonates beyond science fiction, offering a speculative framework for understanding the tensions between systemic modeling and emergent phenomena. In this sense, Foundation remains a critical reflection on the boundaries of knowledge in complex, adaptive systems — a narrative exploration of how large-scale order might arise, collapse, and reconstitute itself in the interplay between prediction and unpredictability.</p>",
      "index": 94
    },
    {
      "id": "Zhou, J. 2019",
      "Theme": "Symbiotic Material Ecologies",
      "category": "Secondary",
      "author": "Zhou, J",
      "title": "Interwoven: Designing Biodigital Objects with Plant Roots",
      "year": 2019,
      "publisher": "Master Thesis, TU Delft",
      "URL": "https://resolver.tudelft.nl/uuid:ffdcf947-06df-4941-a587-bdf008f87783",
      "Description": "<p>Jingwen Zhou’s Interwoven thesis represents a compelling exploration of biodigital fabrication, where living plant roots become both medium and collaborator in the formation of new material systems. Building on the Material Driven Design methodology developed by Elvin Karana, Zhou extends this framework to engage biological growth as an active design parameter. The project seeks to transform Interwoven—a fragile, root-based textile developed by artist Diana Scherer—into a durable and applicable product material. In doing so, Zhou establishes a process of hybrid fabrication that combines natural morphogenetic processes with digital design tools such as parametric modeling and 3D printing.</p><p>The research situates itself at the intersection of material ecology, biofabrication, and computational design, emphasizing an iterative and experimental approach. Over fifty material experiments were conducted to map root behaviors and identify ways to reinforce the material through three-dimensional porous scaffolds. This bio-digital synthesis allows natural root growth to act as a binding agent—literally weaving and gluing discrete components into cohesive, volumetric forms. The resulting composites are not merely functional materials but manifestations of co-authorship between biological and computational agencies.</p><p>Conceptually, Interwoven challenges the anthropocentric paradigm of fabrication by foregrounding processes of negotiation between living and artificial systems. The work reveals both conflict and collaboration between human intention and vegetal autonomy, proposing a material experience vision that celebrates the aesthetics of hybrid growth. This articulation of co-creation not only contributes to the field of sustainable design but also frames a philosophical inquiry into post-anthropogenic making—where design becomes an act of stewardship and symbiosis rather than domination. Zhou’s thesis thus stands as a significant example of biodigital experimentation that redefines material ontology through entanglement, adaptation, and the cultivation of living systems as design partners.</p>",
      "index": 95
    },
    {
      "id": "Del Castillo Lopez, G. et al. 2019",
      "Theme": "Phygital Practices",
      "category": "Secondary",
      "author": "Del Castillo Lopez, G.; Luis, J.",
      "title": "Enactive Robotics: An Action-State Model for Concurrent Machine Control",
      "year": 2019,
      "publisher": "Phd Dissertation, Harvard GSD",
      "URL": "https://dash.harvard.edu/handle/1/41021631",
      "Description": "<p>Jose Luis Del Castillo Lopez’s Enactive Robotics presents a critical rethinking of human–robot interaction, proposing a paradigm shift from the dominant “offline” control model of industrial robotics toward an enactive, concurrent, and cognitively accessible approach to machine control. The authors challenge the historical separation between design and execution that has defined automation since the mid-20th century—where robot behaviors are pre-scripted, unidirectional, and insulated from real-time feedback. Instead, they advocate for an action-state framework in which human operators can act and learn through direct engagement, allowing machine behavior to evolve in response to changing contexts, material conditions, and sensory inputs.</p><p>The dissertation situates this model within the lineage of constructivist and enactivist cognitive theories—from Bruner’s enactive-iconic-symbolic framework to Papert’s notion of “objects-to-think-with”—and translates these into a robotics methodology that privileges embodied learning, real-time feedback, and open-ended interaction. This cognitive grounding positions robotics not as an abstracted symbolic discipline but as a tangible medium for situated experimentation, blurring the distinction between user, tool, and environment. The “enactive” model thus reframes the robot as both agent and interlocutor, capable of mediating creative and improvisational forms of making.</p><p>Critically, the text aligns with the larger movement toward open and democratized technological infrastructures. Del Castillo Lopez emphasizes accessibility, openness, and the integration of robotics into creative and non-industrial domains such as art, architecture, and design. The proposed model aims to lower cognitive and technical barriers, allowing novice users to engage with robotic systems through immediate, sensory interaction rather than formalized code or proprietary software.</p><p>Ultimately, Enactive Robotics articulates a vital conceptual and practical bridge between computational reasoning and embodied making. It contributes not only to the field of human–robot interaction but also to broader discourses on participatory technologies, distributed fabrication, and post-disciplinary design practices that seek to dissolve the artificial divide between thinking, making, and living systems.</p>",
      "index": 96
    },
    {
      "id": "Weil, S. 1949",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Extra",
      "author": "Weil, S.",
      "title": "The Need for Roots [L'enracinement]",
      "year": 1949,
      "publisher": null,
      "URL": null,
      "Description": null,
      "index": 97
    },
    {
      "id": "Smith, A. 1776",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Extra",
      "author": "Smith, A.",
      "title": "An Inquiry into the Nature and Causes of the Wealth of Nations",
      "year": 1776,
      "publisher": null,
      "URL": null,
      "Description": null,
      "index": 98
    },
    {
      "id": "Marx, K. et al. 1848",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Extra",
      "author": "Marx, K.; Engels, F.",
      "title": "The Communist Manifesto",
      "year": 1848,
      "publisher": null,
      "URL": null,
      "Description": null,
      "index": 99
    },
    {
      "id": "Huxley, A. 1962",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Extra",
      "author": "Huxley, A.",
      "title": "Island",
      "year": 1962,
      "publisher": null,
      "URL": null,
      "Description": null,
      "index": 100
    },
    {
      "id": "Orwell, G. 1949",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Extra",
      "author": "Orwell, G.",
      "title": "Nineteen Eighty-Four",
      "year": 1949,
      "publisher": null,
      "URL": null,
      "Description": null,
      "index": 101
    },
    {
      "id": "Ballard, J. 1962",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Extra",
      "author": "Ballard, J. G.",
      "title": "Vermillion Sand – The Thousand Dreams of Stellavista",
      "year": 1962,
      "publisher": "Psychotropic / live house",
      "URL": null,
      "Description": null,
      "index": 102
    },
    {
      "id": "Amtsberg, F. et al. 2021",
      "Theme": "Phygital Practices",
      "category": "Extra",
      "author": "Amtsberg, F.; Mueller, C.; Raspall, F.",
      "title": "Di-terial – Matching Digital Fabrication and Natural Grown Resources for the Development of Resource Efficient Structures",
      "year": 2021,
      "publisher": "CDRF 2021",
      "URL": "https://doi.org/10.1007/978-981-16-5983-6_30",
      "Description": null,
      "index": 103
    },
    {
      "id": "Diniz, N. et al. 2023",
      "Theme": "Symbiotic Material Ecologies",
      "category": "Extra",
      "author": "Diniz, N.; Melendez, F.",
      "title": "Symbiont Substrate: A Bio-Digital Fabrication Method for Large Scale 3D Printing Of Bioreceptive Clay Modules And Automated Colonization Of Lichen Communities",
      "year": 2023,
      "publisher": "Acadia 2023",
      "URL": null,
      "Description": null,
      "index": 104
    },
    {
      "id": "Capra, F. 1975",
      "Theme": "Ethics & Philosophical Frameworks",
      "category": "Extra",
      "author": "Capra, F.",
      "title": "The Tao of Physics: An Exploration of the Parallels Between Modern Physics and Eastern Mysticism",
      "year": 1975,
      "publisher": "Shambhala",
      "URL": null,
      "Description": null,
      "index": 105
    },
    {
      "id": "Hilbert, D. 1902",
      "Theme": "Computational Exploration",
      "category": "Extra",
      "author": "Hilbert, D.",
      "title": "Mathematical Problems",
      "year": 1902,
      "publisher": null,
      "URL": null,
      "Description": null,
      "index": 106
    },
    {
      "id": "Turing, A. 1936",
      "Theme": "Computational Exploration",
      "category": "Extra",
      "author": "Turing, A. M.",
      "title": "On Computable Numbers, with an Application to the Entscheidungsproblem",
      "year": 1936,
      "publisher": null,
      "URL": null,
      "Description": null,
      "index": 107
    },
    {
      "id": "Gödel, K. 1931",
      "Theme": "Computational Exploration",
      "category": "Extra",
      "author": "Gödel, K.",
      "title": "Über formal unentscheidbare Sätze der Principia Mathematica und verwandter Systeme I",
      "year": 1931,
      "publisher": null,
      "URL": null,
      "Description": null,
      "index": 108
    },
    {
      "id": "Goidea, A. et al. 2022",
      "Theme": "Symbiotic Material Ecologies",
      "category": "Extra",
      "author": "Goidea, A.; Floudas, D.; Andréen, D.",
      "title": "Transcalar Design: An Approach to Biodesign in the Built Environment",
      "year": 2022,
      "publisher": "Infrastructures [Internet];7(4):50",
      "URL": "https://doi.org/10.3390/infrastructures7040050",
      "Description": null,
      "index": 109
    },
    {
      "id": "Von Neumann, J. 1966",
      "Theme": "Computational Exploration",
      "category": "Extra",
      "author": "Von Neumann, J.",
      "title": "The Theory of Self-Reproducing Automata",
      "year": 1966,
      "publisher": "University of Illinois Press",
      "URL": null,
      "Description": null,
      "index": 110
    }
  ],
  "links": [
    {
      "source": "Diamond, J. 1997",
      "target": "Diamond, J. 2004"
    },
    {
      "source": "Fuller, R. 1969",
      "target": "Fuller, R. 1963"
    },
    {
      "source": "Fuller, R. 1969",
      "target": "Fuller, R. et al. 1975"
    },
    {
      "source": "Fuller, R. et al. 1975",
      "target": "Fuller, R. 1963"
    },
    {
      "source": "Huxley, A. 1932",
      "target": "Huxley, A. 1962"
    },
    {
      "source": "Weil, S. 1934",
      "target": "Weil, S. 1949"
    },
    {
      "source": "Weil, S. 1934",
      "target": "Fuller, R. 1969"
    },
    {
      "source": "Weil, S. 1934",
      "target": "Huxley, A. 1932"
    },
    {
      "source": "Weil, S. 1934",
      "target": "Lafargue, P. 1883"
    },
    {
      "source": "Meadows, D. et al. 1972",
      "target": "Weil, S. 1934"
    },
    {
      "source": "Meadows, D. et al. 1972",
      "target": "Daggett, C. 2019"
    },
    {
      "source": "Thomson, D. 1917",
      "target": "Haeckel, E. 1899"
    },
    {
      "source": "Allen, S. 1997",
      "target": "Allen, S. 1998"
    },
    {
      "source": "Snooks, R. 2017",
      "target": "Snooks, R. 2022"
    },
    {
      "source": "Snooks, R. 2017",
      "target": "Deleuze, G. 1993"
    },
    {
      "source": "Snooks, R. 2017",
      "target": "Cache, B. 1995"
    },
    {
      "source": "Snooks, R. 2017",
      "target": "Allen, S. 1997"
    },
    {
      "source": "Snooks, R. 2022",
      "target": "Allen, S. 1997"
    },
    {
      "source": "Deleuze, G. 1993",
      "target": "Deleuze, G. et al. 1987"
    },
    {
      "source": "Cache, B. 1995",
      "target": "Deleuze, G. 1993"
    },
    {
      "source": "Negroponte, N. 1998",
      "target": "Negroponte, N. 1970"
    },
    {
      "source": "Mitchell, W. 2005",
      "target": "Mitchell, W. 1979"
    },
    {
      "source": "Crolla, K. 2018",
      "target": "Negroponte, N. 1998"
    },
    {
      "source": "Crolla, K. 2018",
      "target": "Mitchell, W. 2005"
    },
    {
      "source": "Jandrić, P. 2023",
      "target": "Jandrić, P. et al. 2018"
    },
    {
      "source": "Jandrić, P. 2023",
      "target": "Negroponte, N. 1998"
    },
    {
      "source": "Menges, A. 2013",
      "target": "Menges, A. et al. 2008"
    },
    {
      "source": "Menges, A. 2013",
      "target": "Thomson, D. 1917"
    },
    {
      "source": "Carpo, M. 2024",
      "target": "Carpo, M. 2017"
    },
    {
      "source": "Carpo, M. 2024",
      "target": "Carpo, M. 2023"
    },
    {
      "source": "Carpo, M. 2017",
      "target": "Carpo, M. 2023"
    },
    {
      "source": "Braumann, J. et al. 2012",
      "target": "Braumann, J. et al. 2021"
    },
    {
      "source": "Menges, A. et al. 2008",
      "target": "Thomson, D. 1917"
    },
    {
      "source": "Ramsgaard Thomsen, M. et al. 2022",
      "target": "Ramsgaard Thomsen, M. 2022"
    },
    {
      "source": "Turing, A. 1952",
      "target": "Turing, A. 1936"
    },
    {
      "source": "Goidea, A. 2023",
      "target": "Andréen, D. et al. 2022"
    },
    {
      "source": "Goidea, A. 2023",
      "target": "Goidea, A. et al. 2022"
    },
    {
      "source": "Goidea, A. 2023",
      "target": "Thomson, D. 1917"
    },
    {
      "source": "Andréen, D. et al. 2022",
      "target": "Goidea, A. et al. 2022"
    },
    {
      "source": "Baudisch, P. et al. 2017",
      "target": "Gershenfeld, N. 2008"
    },
    {
      "source": "Gramazio, F. et al. 2014",
      "target": "Vazquez, A. et al. 2016"
    },
    {
      "source": "Llach, D. 2007",
      "target": "Thomson, D. 1917"
    },
    {
      "source": "Leach, N. 2016",
      "target": "Ng, P. 2025"
    },
    {
      "source": "Stamets, P. 2005",
      "target": "Watson, J. 2019"
    },
    {
      "source": "Burry, M. 2011",
      "target": "Mitchell, W. 1979"
    },
    {
      "source": "Sweet, K. 2015",
      "target": "Del Castillo Lopez, G. et al. 2019"
    },
    {
      "source": "Del Castillo Lopez, G. et al. 2019",
      "target": "Braumann, J. et al. 2012"
    },
    {
      "source": "Calixto, V. et al. 2024",
      "target": "Gershenfeld, N. 2008"
    },
    {
      "source": "Gershenfeld, N. 2008",
      "target": "Crolla, K. 2018"
    },
    {
      "source": "Chomsky, N. 1992",
      "target": "Daggett, C. 2019"
    },
    {
      "source": "Carpo, M. 2017",
      "target": "Thomson, D. 1917"
    },
    {
      "source": "DeLanda, M. 2004",
      "target": "DeLanda, M. 2002"
    },
    {
      "source": "Zhou, J. et al. 2021",
      "target": "Stamets, P. 2005"
    },
    {
      "source": "Gramazio, F. et al. 2014",
      "target": "Braumann, J. et al. 2012"
    },
    {
      "source": "Davis, D. et al. 2013",
      "target": "Calixto, V. et al. 2024"
    },
    {
      "source": "Turing, A. 1952",
      "target": "Thomson, D. 1917"
    },
    {
      "source": "Venturi, R. 1966",
      "target": "Mitchell, W. 2005"
    },
    {
      "source": "Deleuze, G. 1993",
      "target": "Crolla, K. 2018"
    },
    {
      "source": "Deleuze, G. et al. 1987",
      "target": "Fuller, R. 1963"
    },
    {
      "source": "Carpo, M. 2024",
      "target": "Crolla, K. 2018"
    },
    {
      "source": "Oxman, N. 2012",
      "target": "Ramsgaard Thomsen, M. et al. 2022"
    },
    {
      "source": "Ramsgaard Thomsen, M. et al. 2022",
      "target": "Carpo, M. 2017"
    },
    {
      "source": "Yan, C. et al. 2024",
      "target": "Larsson, M. et al. 2019"
    },
    {
      "source": "Cojocaru, A. et al. 2021",
      "target": "Carpo, M. 2024"
    },
    {
      "source": "Ball, P. 2004",
      "target": "Allen, S. 1997"
    },
    {
      "source": "Cramer, F. 2014",
      "target": "Jandrić, P. 2023"
    },
    {
      "source": "Zhou, J. et al. 2021",
      "target": "Oxman, N. 2012"
    },
    {
      "source": "Vazquez, A. et al. 2016",
      "target": "Snooks, R. 2022"
    },
    {
      "source": "Amtsberg, F. et al. 2021",
      "target": "Ramsgaard Thomsen, M. et al. 2022"
    },
    {
      "source": "Watts, D. et al. 1998",
      "target": "Ng, P. 2025"
    },
    {
      "source": "Bechthold, M. 2014",
      "target": "Gramazio, F. et al. 2014"
    },
    {
      "source": "Smith, A. 1776",
      "target": "Weil, S. 1934"
    },
    {
      "source": "Walter-Herrmann, J. et al. 2014",
      "target": "Gershenfeld, N. 2008"
    },
    {
      "source": "Bingham‐Hall, J. 2017",
      "target": "Ng, P. 2025"
    },
    {
      "source": "Schon, D. 1984",
      "target": "Sennett, R. 2009"
    },
    {
      "source": "Mumford, L. 1959",
      "target": "Agarwala, N. et al. 2021"
    },
    {
      "source": "Mumford, L. 1959",
      "target": "Ng, P. 2025"
    },
    {
      "source": "Leach, N. 2016",
      "target": "Diamond, J. 2004"
    },
    {
      "source": "Lynn, G. 1993",
      "target": "Deleuze, G. 1993"
    },
    {
      "source": "Marx, K. et al. 1848",
      "target": "Smith, A. 1776"
    },
    {
      "source": "Marx, K. et al. 1848",
      "target": "Weil, S. 1934"
    },
    {
      "source": "Marx, K. et al. 1848",
      "target": "Lafargue, P. 1883"
    },
    {
      "source": "Poincaré, H. 1890",
      "target": "Von Neumann, J. 1966"
    },
    {
      "source": "Jacobs, J. 1961",
      "target": "Mumford, L. 1959"
    },
    {
      "source": "Fuller, R. 1969",
      "target": "Gershenfeld, N. 2008"
    },
    {
      "source": "Yan, C. et al. 2024",
      "target": "Negroponte, N. 1998"
    },
    {
      "source": "Menges, A. et al. 2008",
      "target": "Cojocaru, A. et al. 2021"
    },
    {
      "source": "Goidea, A. 2023",
      "target": "Ramsgaard Thomsen, M. et al. 2022"
    },
    {
      "source": "Goidea, A. 2023",
      "target": "Oxman, N. 2012"
    },
    {
      "source": "Zhou, J. 2019",
      "target": "Zhou, J. et al. 2021"
    },
    {
      "source": "Diamond, J. 1997",
      "target": "Chomsky, N. 1992"
    },
    {
      "source": "Ng, P. 2025",
      "target": "Yan, C. et al. 2024"
    },
    {
      "source": "Say, J. B. 1803",
      "target": "Meadows, D. et al. 1972"
    },
    {
      "source": "Say, J. B. 1803",
      "target": "Smith, A. 1776"
    },
    {
      "source": "Sennett, R. 2009",
      "target": "Carpo, M. 2023"
    },
    {
      "source": "Sennett, R. 2009",
      "target": "Carpo, M. 2017"
    },
    {
      "source": "Schon, D. 1984",
      "target": "Vazquez, A. et al. 2016"
    },
    {
      "source": "Gannon, M. 2018",
      "target": "Vazquez, A. et al. 2016"
    },
    {
      "source": "Gannon, M. 2018",
      "target": "Del Castillo Lopez, G. et al. 2019"
    },
    {
      "source": "Braumann, J. et al. 2021",
      "target": "Gannon, M. 2018"
    },
    {
      "source": "Gramazio, F. et al. 2014",
      "target": "Gannon, M. 2018"
    },
    {
      "source": "Conway, J. 1970",
      "target": "Allen, S. 1998"
    },
    {
      "source": "Diniz, N. et al. 2023",
      "target": "Oxman, N. 2012"
    },
    {
      "source": "Watson, J. 2019",
      "target": "Crolla, K. 2018"
    },
    {
      "source": "Asimov, I. 1951",
      "target": "Ng, P. 2025"
    },
    {
      "source": "Reynolds, C. 1987",
      "target": "Wolfram, S. 2002"
    },
    {
      "source": "Reynolds, C. 1987",
      "target": "Allen, S. 1997"
    },
    {
      "source": "Von Neumann, J. 1966",
      "target": "Allen, S. 1997"
    },
    {
      "source": "Reynolds, C. 1987",
      "target": "Snooks, R. 2017"
    },
    {
      "source": "Hughes, F. 2014",
      "target": "Carpo, M. 2024"
    },
    {
      "source": "Hughes, F. 2014",
      "target": "Crolla, K. 2018"
    },
    {
      "source": "Imhof, B. et al. 2015",
      "target": "Zhou, J. et al. 2021"
    },
    {
      "source": "López‐Durán, F. et al. 2010",
      "target": "Ng, P. 2025"
    },
    {
      "source": "López‐Durán, F. et al. 2010",
      "target": "Imhof, B. et al. 2015"
    },
    {
      "source": "Witt, A. 2010",
      "target": "Burry, M. 2011"
    },
    {
      "source": "Witt, A. 2010",
      "target": "Schon, D. 1984"
    },
    {
      "source": "Witt, A. 2010",
      "target": "Sennett, R. 2009"
    },
    {
      "source": "Wiener, N. 1948",
      "target": "Poincaré, H. 1890"
    },
    {
      "source": "Ng, P. 2025",
      "target": "Fuller, R. et al. 1975"
    },
    {
      "source": "Leach, N. 2016",
      "target": "Fuller, R. 1969"
    },
    {
      "source": "Licklider, J. 1960",
      "target": "Wiener, N. 1948"
    },
    {
      "source": "Licklider, J. 1960",
      "target": "Yan, C. et al. 2024"
    },
    {
      "source": "Negroponte, N. 1970",
      "target": "Ng, P. 2025"
    },
    {
      "source": "Haeckel, E. 1899",
      "target": "Goidea, A. 2023"
    },
    {
      "source": "Mitchell, T. 2011",
      "target": "Daggett, C. 2019"
    },
    {
      "source": "Orwell, G. 1949",
      "target": "Huxley, A. 1932"
    },
    {
      "source": "Weaver, W. 1948",
      "target": "Conway, J. 1970"
    },
    {
      "source": "Lorenz, E. 1963",
      "target": "Poincaré, H. 1890"
    },
    {
      "source": "Lorenz, E. 1963",
      "target": "Weaver, W. 1948"
    },
    {
      "source": "Weaver, W. 1948",
      "target": "Crolla, K. 2018"
    },
    {
      "source": "Baudrillard, J. 1968",
      "target": "Calixto, V. et al. 2024"
    },
    {
      "source": "Baudrillard, J. 1968",
      "target": "Gannon, M. 2018"
    },
    {
      "source": "Baudrillard, J. 1968",
      "target": "Carpo, M. 2023"
    },
    {
      "source": "Goodbun, J. et al. 2012",
      "target": "Oxman, N. 2012"
    },
    {
      "source": "Goodbun, J. et al. 2012",
      "target": "Crolla, K. 2018"
    },
    {
      "source": "Hughes, F. 2014",
      "target": "Goodbun, J. et al. 2012"
    },
    {
      "source": "Prigogine, I. et al. 1984",
      "target": "Reynolds, C. 1987"
    },
    {
      "source": "Wolfram, S. 2002",
      "target": "Prigogine, I. et al. 1984"
    },
    {
      "source": "Gulay, E. et al. 2019",
      "target": "Yan, C. et al. 2024"
    },
    {
      "source": "Gulay, E. et al. 2019",
      "target": "Goodbun, J. et al. 2012"
    },
    {
      "source": "Gulay, E. et al. 2019",
      "target": "Vazquez, A. et al. 2016"
    },
    {
      "source": "Wigley, M. 1993",
      "target": "Snooks, R. 2017"
    },
    {
      "source": "Wigley, M. 1993",
      "target": "Snooks, R. 2022"
    },
    {
      "source": "Wigley, M. 1993",
      "target": "Venturi, R. 1966"
    },
    {
      "source": "Mitchell, W. 2005",
      "target": "Gershenfeld, N. 2008"
    },
    {
      "source": "Weaver, W. 1948",
      "target": "Jacobs, J. 1961"
    },
    {
      "source": "DeLanda, M. 2004",
      "target": "Deleuze, G. et al. 1987"
    },
    {
      "source": "DeLanda, M. 2002",
      "target": "Deleuze, G. et al. 1987"
    },
    {
      "source": "DeLanda, M. 2002",
      "target": "Snooks, R. 2017"
    },
    {
      "source": "Braumann, J. et al. 2012",
      "target": "Burry, M. 2011"
    },
    {
      "source": "Burry, M. 2011",
      "target": "Crolla, K. 2018"
    },
    {
      "source": "Burry, M. 2011",
      "target": "Davis, D. et al. 2013"
    },
    {
      "source": "Negroponte, N. 1970",
      "target": "Calixto, V. et al. 2024"
    },
    {
      "source": "Waldrop, M. 1993",
      "target": "Reynolds, C. 1987"
    },
    {
      "source": "Waldrop, M. 1993",
      "target": "Poincaré, H. 1890"
    },
    {
      "source": "Ball, P. 2004",
      "target": "Watts, D. et al. 1998"
    },
    {
      "source": "Prigogine, I. et al. 1984",
      "target": "Zhou, J. 2019"
    },
    {
      "source": "Sharma, S. 2020",
      "target": "Oxman, N. 2012"
    },
    {
      "source": "Sharma, S. 2020",
      "target": "Diniz, N. et al. 2023"
    },
    {
      "source": "Sharma, S. 2020",
      "target": "Goidea, A. et al. 2022"
    },
    {
      "source": "Sharma, S. 2020",
      "target": "Imhof, B. et al. 2015"
    },
    {
      "source": "Imhof, B. et al. 2015",
      "target": "Stamets, P. 2005"
    },
    {
      "source": "Diniz, N. et al. 2023",
      "target": "Stamets, P. 2005"
    },
    {
      "source": "Hughes, F. 2014",
      "target": "Wolfram, S. 2002"
    },
    {
      "source": "Gödel, K. 1931",
      "target": "Wolfram, S. 2002"
    },
    {
      "source": "Gödel, K. 1931",
      "target": "Turing, A. 1936"
    },
    {
      "source": "Hilbert, D. 1902",
      "target": "Turing, A. 1936"
    },
    {
      "source": "Turing, A. 1936",
      "target": "Von Neumann, J. 1966"
    },
    {
      "source": "Capra, F. 1975",
      "target": "Fuller, R. et al. 1975"
    },
    {
      "source": "Ballard, J. 1962",
      "target": "Deleuze, G. et al. 1987"
    },
    {
      "source": "Daggett, C. 2019",
      "target": "Agarwala, N. et al. 2021"
    },
    {
      "source": "Carpo, M. 2023",
      "target": "Gramazio, F. et al. 2014"
    },
    {
      "source": "Witt, A. 2010",
      "target": "Gramazio, F. et al. 2014"
    },
    {
      "source": "Jandrić, P. et al. 2018",
      "target": "Negroponte, N. 1998"
    },
    {
      "source": "Jandrić, P. 2023",
      "target": "Fuller, R. 1969"
    },
    {
      "source": "Cramer, F. 2014",
      "target": "Gershenfeld, N. 2008"
    },
    {
      "source": "Diamond, J. 2004",
      "target": "Weil, S. 1934"
    },
    {
      "source": "López‐Durán, F. et al. 2010",
      "target": "Weil, S. 1934"
    },
    {
      "source": "Weil, S. 1934",
      "target": "Mumford, L. 1959"
    },
    {
      "source": "Wigley, M. 1993",
      "target": "Jacobs, J. 1961"
    }
  ]
}